MILES/arx/miles.org
;;*****************************************************************************
;;*
;;*                                MILES
;;*                  Mid-Infrared Line Extraction Software
;:*
;;*****************************************************************************


* Make the Qabs Structure Once and For All
** FUNCTION ~make_Qabs~, waveIN, TYPE=type
#+BEGIN_SRC idl
FUNCTION make_Qabs, waveIN, TYPE=type

  ;; Structure initilisation
  Nw = N_ELEMENTS(waveIN)
  nu = !MKS.clight/!MKS.micron/waveIN
  Nbb = N_ELEMENTS(type)
  rad = 0.01D ;; microns
  units = "w, rad [micron]; nu [Hz]; Qova [m-1]; rho [kg/m3]"
  Qabs_str = REPLICATE({Nw:Nw, w:waveIN, rad:rad, type:type, $
                        Qova:DBLARR(Nw), rho:0.D, units:units},Nbb)
  
  ;; Optical properties
  FOR i=0,Nbb-1 DO BEGIN
    CASE type[i] OF
      "carbon_BE": typenorm = "crb"
      "amorphous carbon": typenorm = "crb"
      "silicate": typenorm = "sil"
      "astronomical silicate": typenorm = "sil"
      "graphite": typenorm = "gra"
      "alox_compact": typenorm = "al2o3_compact"
      "compact corundum": typenorm = "al2o3_compact"
      "alox_porous": typenorm = "al2o3_porous"
      "porous corundum": typenorm = "al2o3_porous"
      "alox_compact_cde": typenorm = "al2o3_compact_cde"
      "compact corundum (CDE)": typenorm = "al2o3_compact_cde"
      "alox_koike": typenorm = "al2o3_koike"
      "Koike's corundum": typenorm = "al2o3_koike"
      "alox_koike_cde": typenorm = "al2o3_koike_cde"
      "Koike's corundum (CDE)": typenorm = "al2o3_koike_cde"
      "normal silicates": typenorm = "sil_norm"
      "oxygen deficient silicates": typenorm = "sil_Odef"
      ELSE: typenorm = type[i]
    ENDCASE
    CASE typenorm OF
      "crb": BEGIN
        RESTORE, !IDLFRED+"Dust/Data/MIEwisc_carbon_BE.idl"
        Qabs = REFORM(Qabs_dust[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 2.24D3
      END
      "sil": BEGIN
        RESTORE, !IDLFRED+"Dust/Data/MIEwisc_silicate.idl"
        Qabs = REFORM(Qabs_sil[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 3.5D3
      END
      "gra": BEGIN
        RESTORE, !IDLFRED+"Dust/Data/MIEwisc_graphite.idl"
        Qabs = REFORM(Qabs_grf[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 2.24D3
      END
      "al2o3_compact": BEGIN
        RESTORE, !IDLFRED+"Dust/Data/Qabs_Al2O3_compact.xdr"
        Qabs = REFORM(Qabs_Al2O3[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 3.5D3
      END
      "al2o3_porous": BEGIN
        RESTORE, !IDLFRED+"Dust/Data/Qabs_Al2O3_porous.xdr"
        Qabs = REFORM(Qabs_Al2O3[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 3.5D3
      END
      "al2o3_compact_cde": BEGIN
        RESTORE, !IDLFRED+"Dust/Data/Qabs_Al2O3_compact_cde.xdr"
        Qabs = REFORM(Qabs_Al2O3[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 3.5D3
      END
      "al2o3_koike_cde": BEGIN
        RESTORE, !IDLFRED+"Dust/Data/Qabs_Al2O3_koike_cde.xdr"
        Qabs = REFORM(Qabs_Al2O3[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 3.5D3
      END
      "al2o3_koike": BEGIN
        RESTORE, !IDLFRED+"Dust/Data/Qabs_Al2O3_koike.xdr"
        Qabs = REFORM(Qabs_Al2O3[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 3.5D3
      END
      "sil_norm": BEGIN
        RESTORE, !IDLFRED+"Dust/Data/Qabs_silicate_normal.xdr"
        Qabs = REFORM(Qabs_sil[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 3.5D3
      END
      "sil_Odef": BEGIN
        RESTORE, !IDLFRED+"Dust/Data/Qabs_silicate_oxygen_deficient.xdr"
        Qabs = REFORM(Qabs_sil[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 3.5D3
      END
    ENDCASE
  ENDFOR

  RETURN, Qabs_str

END
#+END_SRC
* Analytical Functions of the Individual Features
** 1) N BB
#+BEGIN_SRC idl
FUNCTION modifBB, Q_str, TEMPBB=temp

  ;; Fnu [MJy/sr]
  ;; in 1 Msun/dist^2 [Msun/kpc2]
  Fnu = !MKS.Msun/!MKS.kpc^2 * 3.D*!PI/4./Q_str.rho * Q_str.Qova $
      * ABSOLUTEBB(Q_str.w,temp,/WAVE,/BNU,/MKS) / !MKS.Jy

  RETURN, Fnu

END
#+END_SRC
