MILES/archives/miles.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-11 Mon 10:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="HU Dangning" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org04a760e">1. Make the Qabs Structure Once and For All</a>
<ul>
<li><a href="#orgf83baba">1.1. FUNCTION <code>make_Qabs</code>, waveIN, TYPE=type</a></li>
</ul>
</li>
<li><a href="#org4dca8dc">2. Analytical Functions of the Individual Features</a>
<ul>
<li><a href="#orgdca11be">2.1. 1) N BB</a></li>
<li><a href="#org7b978f3">2.2. 2) Gauss profile</a></li>
<li><a href="#org0ffd238">2.3. 3) Asymmetric lorentz profile</a></li>
</ul>
</li>
<li><a href="#org82f561a">3. Automatize the degradation of the spectral resolution</a></li>
<li><a href="#org4545cbf">4. Create the parameter structure</a></li>
<li><a href="#org2f70901">5. Independent Fit of the lines</a></li>
<li><a href="#org493b7b4">6. Total model</a></li>
<li><a href="#orgd77fbdc">7. Main program</a>
<ul>
<li><a href="#org6d140d2">7.1. Organize the inputs</a></li>
<li><a href="#org53e7f18">7.2. Spectral Feature Properties and Templates</a>
<ul>
<li><a href="#orgda02a1b">7.2.1. Model wavelength grid</a></li>
<li><a href="#org7debdf9">7.2.2. 1) Grain continuum</a></li>
<li><a href="#orgb2f6ffb">7.2.3. 2) Lines</a></li>
<li><a href="#orgc96e852">7.2.4. 3) Bands</a></li>
<li><a href="#org93379e1">7.2.5. 4) Stellar ISRF</a></li>
<li><a href="#org656b5a8">7.2.6. 5) Dust and ice extinction</a></li>
</ul>
</li>
<li><a href="#org26be6e2">7.3. Initital Guesses and Parameter Variations</a>
<ul>
<li><a href="#org7f6b196">7.3.1. Parameters</a></li>
<li><a href="#org2369724">7.3.2. BIG LOOP</a></li>
</ul>
</li>
<li><a href="#orga7ff6dc">7.4. Preliminary Line Fit</a></li>
<li><a href="#orgd4448c5">7.5. Complete Fit</a>
<ul>
<li><a href="#org3d2ffc7">7.5.1. Initialisation</a></li>
<li><a href="#orgd8ce7fe">7.5.2. Fit of the SED</a></li>
<li><a href="#orgf263028">7.5.3. Outputs</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
;;*****************************************************************************
;;*
;;*                                MILES
;;*                  Mid-Infrared Line Extraction Software
;:*
;;*****************************************************************************
</p>


<div id="outline-container-org04a760e" class="outline-2">
<h2 id="org04a760e"><span class="section-number-2">1</span> Make the Qabs Structure Once and For All</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf83baba" class="outline-3">
<h3 id="orgf83baba"><span class="section-number-3">1.1</span> FUNCTION <code>make_Qabs</code>, waveIN, TYPE=type</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-idl"><span style="color: #afd8af;">FUNCTION</span> <span style="color: #ff69b4;">make_Qabs</span>, <span style="color: #ff69b4;">waveIN</span>, <span style="color: #ff69b4;">TYPE</span>=type

  ;; Structure <span style="color: #afd8af;">initilisation</span>
  <span style="color: #ff69b4;">Nw</span> = N_ELEMENTS(waveIN)
  nu = !MKS.clight/!MKS.micron/waveIN
  Nbb = N_ELEMENTS(type)
  rad = 0.01D ;; <span style="color: #afd8af;">microns</span>
  <span style="color: #ff69b4;">units</span> = <span style="color: #61CE3C;">"w, rad [micron]; nu [Hz]; Qova [m-1]; rho [kg/m3]"</span>
  Qabs_str = REPLICATE({Nw:Nw, w:waveIN, rad:rad, type:type, $
                        Qova:DBLARR(Nw), rho:0.D, units:units},Nbb)

  ;; Optical properties
  <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">i</span>=0,<span style="color: #ff69b4;">Nbb</span>-1 DO BEGIN
    CASE type[i] OF
      <span style="color: #61CE3C;">"carbon_BE"</span>: typenorm = <span style="color: #61CE3C;">"crb"</span>
      <span style="color: #61CE3C;">"amorphous carbon"</span>: typenorm = <span style="color: #61CE3C;">"crb"</span>
      <span style="color: #61CE3C;">"silicate"</span>: typenorm = <span style="color: #61CE3C;">"sil"</span>
      <span style="color: #61CE3C;">"astronomical silicate"</span>: typenorm = <span style="color: #61CE3C;">"sil"</span>
      <span style="color: #61CE3C;">"graphite"</span>: typenorm = <span style="color: #61CE3C;">"gra"</span>
      <span style="color: #61CE3C;">"alox_compact"</span>: typenorm = <span style="color: #61CE3C;">"al2o3_compact"</span>
      <span style="color: #61CE3C;">"compact corundum"</span>: typenorm = <span style="color: #61CE3C;">"al2o3_compact"</span>
      <span style="color: #61CE3C;">"alox_porous"</span>: typenorm = <span style="color: #61CE3C;">"al2o3_porous"</span>
      <span style="color: #61CE3C;">"porous corundum"</span>: typenorm = <span style="color: #61CE3C;">"al2o3_porous"</span>
      <span style="color: #61CE3C;">"alox_compact_cde"</span>: typenorm = <span style="color: #61CE3C;">"al2o3_compact_cde"</span>
      <span style="color: #61CE3C;">"compact corundum (CDE)"</span>: typenorm = <span style="color: #61CE3C;">"al2o3_compact_cde"</span>
      <span style="color: #61CE3C;">"alox_koike"</span>: typenorm = <span style="color: #61CE3C;">"al2o3_koike"</span>
      <span style="color: #61CE3C;">"Koike's corundum"</span>: typenorm = <span style="color: #61CE3C;">"al2o3_koike"</span>
      <span style="color: #61CE3C;">"alox_koike_cde"</span>: typenorm = <span style="color: #61CE3C;">"al2o3_koike_cde"</span>
      <span style="color: #61CE3C;">"Koike's corundum (CDE)"</span>: typenorm = <span style="color: #61CE3C;">"al2o3_koike_cde"</span>
      <span style="color: #61CE3C;">"normal silicates"</span>: typenorm = <span style="color: #61CE3C;">"sil_norm"</span>
      <span style="color: #61CE3C;">"oxygen deficient silicates"</span>: typenorm = <span style="color: #61CE3C;">"sil_Odef"</span>
      ELSE: typenorm = type[i]
    ENDCASE
    CASE typenorm OF
      <span style="color: #61CE3C;">"crb"</span>: BEGIN
        RESTORE, !IDLFRED+<span style="color: #61CE3C;">"Dust/Data/MIEwisc_carbon_BE.idl"</span>
        Qabs = REFORM(Qabs_dust[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 2.24D3
      END
      <span style="color: #61CE3C;">"sil"</span>: BEGIN
        RESTORE, !IDLFRED+<span style="color: #61CE3C;">"Dust/Data/MIEwisc_silicate.idl"</span>
        Qabs = REFORM(Qabs_sil[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 3.5D3
      END
      <span style="color: #61CE3C;">"gra"</span>: BEGIN
        RESTORE, !IDLFRED+<span style="color: #61CE3C;">"Dust/Data/MIEwisc_graphite.idl"</span>
        Qabs = REFORM(Qabs_grf[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 2.24D3
      END
      <span style="color: #61CE3C;">"al2o3_compact"</span>: BEGIN
        RESTORE, !IDLFRED+<span style="color: #61CE3C;">"Dust/Data/Qabs_Al2O3_compact.xdr"</span>
        Qabs = REFORM(Qabs_Al2O3[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 3.5D3
      END
      <span style="color: #61CE3C;">"al2o3_porous"</span>: BEGIN
        RESTORE, !IDLFRED+<span style="color: #61CE3C;">"Dust/Data/Qabs_Al2O3_porous.xdr"</span>
        Qabs = REFORM(Qabs_Al2O3[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 3.5D3
      END
      <span style="color: #61CE3C;">"al2o3_compact_cde"</span>: BEGIN
        RESTORE, !IDLFRED+<span style="color: #61CE3C;">"Dust/Data/Qabs_Al2O3_compact_cde.xdr"</span>
        Qabs = REFORM(Qabs_Al2O3[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 3.5D3
      END
      <span style="color: #61CE3C;">"al2o3_koike_cde"</span>: BEGIN
        RESTORE, !IDLFRED+<span style="color: #61CE3C;">"Dust/Data/Qabs_Al2O3_koike_cde.xdr"</span>
        Qabs = REFORM(Qabs_Al2O3[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 3.5D3
      END
      <span style="color: #61CE3C;">"al2o3_koike"</span>: BEGIN
        RESTORE, !IDLFRED+<span style="color: #61CE3C;">"Dust/Data/Qabs_Al2O3_koike.xdr"</span>
        Qabs = REFORM(Qabs_Al2O3[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 3.5D3
      END
      <span style="color: #61CE3C;">"sil_norm"</span>: BEGIN
        RESTORE, !IDLFRED+<span style="color: #61CE3C;">"Dust/Data/Qabs_silicate_normal.xdr"</span>
        Qabs = REFORM(Qabs_sil[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 3.5D3
      END
      <span style="color: #61CE3C;">"sil_Odef"</span>: BEGIN
        RESTORE, !IDLFRED+<span style="color: #61CE3C;">"Dust/Data/Qabs_silicate_oxygen_deficient.xdr"</span>
        Qabs = REFORM(Qabs_sil[CLOSEST(asize,rad),*])
        Qabs_str[i].Qova = FINTERPOL(Qabs,wave,waveIN,/POW)/rad/!MKS.micron
        Qabs_str[i].rho = 3.5D3
      END
    ENDCASE
  ENDFOR

  RETURN, <span style="color: #afd8af;">Qabs_str</span>

<span style="color: #ff69b4;">END</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4dca8dc" class="outline-2">
<h2 id="org4dca8dc"><span class="section-number-2">2</span> Analytical Functions of the Individual Features</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgdca11be" class="outline-3">
<h3 id="orgdca11be"><span class="section-number-3">2.1</span> 1) N BB</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-idl"><span style="color: #afd8af;">FUNCTION</span> <span style="color: #ff69b4;">modifBB</span>, <span style="color: #ff69b4;">Q_str</span>, <span style="color: #ff69b4;">TEMPBB</span>=temp

  ;; Fnu [MJy/sr]
  ;; <span style="color: #4c83ff;">in</span> 1 Msun/dist^2 [Msun/kpc2]
  Fnu = !MKS.Msun/!MKS.kpc^2 * 3.D*!PI/4./Q_str.rho * Q_str.Qova $
      * ABSOLUTEBB(Q_str.w,temp,/WAVE,/BNU,/MKS) / !MKS.Jy

  RETURN, <span style="color: #afd8af;">Fnu</span>

<span style="color: #ff69b4;">END</span>
</pre>
</div>
</div>
</div>
