MILES/arx/miles.org
** 2) Gauss profile
#+BEGIN_SRC idl
FUNCTION gaussLine, waveIN, wave_ref, sigma

  nuIN = !MKS.clight/!MKS.micron / waveIN

  nucen = !MKS.clight/!MKS.micron / wave_ref
  nusig = ( 1./(wave_ref-sigma) - 1./(wave_ref+sigma) ) $
          * !MKS.clight/!MKS.micron / 2.D

  Fnu0_norm = EXP( - (nuIN-nucen)^2 / (2.D*nusig^2) ) / SQRT(2.*!PI*nusig^2)

  RETURN, Fnu0_norm

END
#+END_SRC
** 3) Asymmetric lorentz profile
#+BEGIN_SRC idl
FUNCTION lorentzBand, waveIN, wave_ref, sigmaS, sigmaL

  IF (N_PARAMS() EQ 3) THEN sigmaL = sigmaS

  Nw = N_ELEMENTS(waveIN)
  nuIN = !MKS.clight/!MKS.micron / waveIN

  nucen = !MKS.clight/!MKS.micron / wave_ref
  nusigS = ( 1./(wave_ref-sigmaS) - 1./wave_ref ) * !MKS.clight/!MKS.micron
  nusigL = ( 1./wave_ref - 1./(wave_ref+sigmaL) ) * !MKS.clight/!MKS.micron

  whS = WHERE(waveIN LE wave_ref, NS, COMP=whL, NCOMP=NL)
  Fnu0_norm = DBLARR(Nw)

  AS = 2.D/(1.+nusigL/nusigS)
  AL = AS*nusigL/nusigS
  IF (NS GT 0) THEN $
    Fnu0_norm[whS] = AS * nusigS/!PI / ( (nuIN[whS]-nucen)^2 + nusigS^2 )
  IF (NL GT 0) THEN $
    Fnu0_norm[whL] = AL * nusigL/!PI / ( (nuIN[whL]-nucen)^2 + nusigL^2 )

  RETURN, Fnu0_norm

END
#+END_SRC
* Automatize the degradation of the spectral resolution
#+BEGIN_SRC idl
FUNCTION degradeRes, wc, dw, INSTRUMENT=instr

  ;; Line width fixed by the instrumental resolution
  dw_w_CAM = 0.010373835D
  dw_w_SL = 0.0055722841D
  dw_w_SH = 0.00075127093D
  dw_w_LL = 0.0057517091D
  dw_w_LH = 0.00070906159D
  dw_w_SWS = 0.0011044189D
  dw_w_SWSfine = 0.00036671469D
  dw_w_AKARI_Ns = 0.00356688D
  
  ;; Fix the linewidth
  CASE instr OF
    "SH": sigma = dw_w_SH * wc
    "LH": sigma = dw_w_LH * wc
    "SL": sigma = dw_w_SL * wc
    "LL": sigma = dw_w_LL * wc
    "SL-SH": BEGIN
      IF (wc LT 10.) THEN sigma = dw_w_SL * wc
      IF (wc GE 10.) THEN sigma = dw_w_SH * wc
    END
    "SL-LL": BEGIN
      IF (wc LT 12.) THEN sigma = dw_w_SL * wc
      IF (wc GE 12.) THEN sigma = dw_w_LL * wc
    END
    "Ns-SL": BEGIN
      IF (wc LT 5.) THEN sigma = dw_w_AKARI_Ns * wc
      IF (wc GE 5.) THEN sigma = dw_w_SL * wc
    END
    "CAM": sigma = dw_w_CAM * wc
    "SWS": sigma = dw_w_SWS * wc
    "SWSfine": sigma = dw_w_SWSfine * wc
    ELSE: sigma = dw
  ENDCASE

  RETURN, sigma

END
#+END_SRC
* Create the parameter structure
#+BEGIN_SRC idl
FUNCTION parstruct, parm, Nbb=Nbb, Nline=Nline, Nband=Nband, NAv=NAv,Nstar=Nstar

  par = { massBB: DBLARR(MAXI(Nbb,1)), $
          tempBB: DBLARR(MAXI(Nbb,1)), $
          Iline: DBLARR(MAXI(Nline,1)), $
          Cline: DBLARR(MAXI(Nline,1)), $
          Wline: DBLARR(MAXI(Nline,1)), $
          Iband: DBLARR(MAXI(Nband,1)), $
          Cband: DBLARR(MAXI(Nband,1)), $
          WSband: DBLARR(MAXI(Nband,1)), $
          WLband: DBLARR(MAXI(Nband,1)), $
          Av: DBLARR(MAXI(NAv,1)), $
          massStar: 0.D }

  ;; 1) Continuum
  i0 = 0
  FOR i=0,Nbb-1 DO BEGIN
    par.massBB[i] = parm[i0+2*i]
    par.tempBB[i] = parm[i0+2*i+1]
  ENDFOR
  ;; 2) Lines
  i0 += 2*Nbb
  FOR i=0,Nline-1 DO BEGIN
    par.Iline[i] = parm[i0+3*i]
    par.Cline[i] = parm[i0+3*i+1]
    par.Wline[i] = parm[i0+3*i+2]
  ENDFOR
  ;; 3) Bands
  i0 += 3*Nline
  FOR i=0,Nband-1 DO BEGIN
    par.Iband[i] = parm[i0+4*i]
    par.Cband[i] = parm[i0+4*i+1]
    par.WSband[i] = parm[i0+4*i+2]
    par.WLband[i] = parm[i0+4*i+3]
  ENDFOR
  ;; 4) Av
  i0 += 4*Nband
  FOR i=0,NAv-1 DO par.Av[i] = parm[i0+i]
  ;; 5) Star
  i0 += NAv
  IF (Nstar GT 0) THEN par.massStar = parm[i0]

  RETURN, par

END
#+END_SRC
* Independent Fit of the lines
#+BEGIN_SRC idl
PRO linealone, wave, parm, FnuOUT, _EXTRA=extra

  ;; Line
  Iline = parm[0]
  Cline = parm[1]
  Wline = parm[2]
  Fnu_line = Iline*GAUSSLINE(wave,Cline,Wline)

  ;; Continuum
  a = parm[3]
  b = parm[4]
  c = parm[5]
  x = (wave - extra.center)/extra.center
  Fnu_cont = a*(1+b*x+c*x^2)

  ;; Total
  FnuOUT = Fnu_cont + Fnu_line

  ;; Display
  IF (extra.noplot LT 1) THEN BEGIN
    wh = WHERE(extra.FnuObs GT 0.)
    ranFnu = [MIN(extra.FnuObs[wh])*0.9,1.05*MAX(extra.FnuObs)]
    PLOTAXIS, MI=extra.milli, XRANGE=extra.ranw, YRANGE=ranFnu, $
              YLOG=extra.logplot, TITLE="!6"+extra.title, $
              XTITLE=!PL.wmic, YTITLE=!PL.Fnu+" [MJy/sr]"
    OPLOT, wave, Fnu_cont, COLOR=!RED
    OPLOT, wave, Fnu_cont+Fnu_line, COLOR=!BLUE
    OPLOT, wave, FnuOUT, LINE=2, COLOR=!DARKGREY
    WONDERRPLOT, extra.wavObs, extra.FnuObs, extra.wavObs*0., extra.dFnuObs, $
                 PSYM="circ", SYMSIZE=0.3*!P.SYMSIZE, BARTHICK=0.3*!P.THICK
  ENDIF

END
#+END_SRC

