MILES/archives/miles.html
<div id="outline-container-org7b978f3" class="outline-3">
<h3 id="org7b978f3"><span class="section-number-3">2.2</span> 2) Gauss profile</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-idl"><span style="color: #afd8af;">FUNCTION</span> <span style="color: #ff69b4;">gaussLine</span>, <span style="color: #ff69b4;">waveIN</span>, <span style="color: #ff69b4;">wave_ref</span>, <span style="color: #ff69b4;">sigma</span>

  nuIN = !MKS.clight/!MKS.micron / waveIN

  nucen = !MKS.clight/!MKS.micron / wave_ref
  nusig = ( 1./(wave_ref-sigma) - 1./(wave_ref+sigma) ) $
          * !MKS.clight/!MKS.micron / 2.D

  Fnu0_norm = EXP( - (nuIN-nucen)^2 / (2.D*nusig^2) ) / SQRT(2.*!PI*nusig^2)

  RETURN, <span style="color: #ff69b4;">Fnu0_norm</span>

END
</pre>
</div>
</div>
</div>
<div id="outline-container-org0ffd238" class="outline-3">
<h3 id="org0ffd238"><span class="section-number-3">2.3</span> 3) Asymmetric lorentz profile</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-idl"><span style="color: #afd8af;">FUNCTION</span> <span style="color: #ff69b4;">lorentzBand</span>, <span style="color: #ff69b4;">waveIN</span>, <span style="color: #ff69b4;">wave_ref</span>, <span style="color: #ff69b4;">sigmaS</span>, <span style="color: #ff1493;">sigmaL</span>

  IF (N_PARAMS() EQ 3) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">sigmaL</span> = sigmaS

  Nw = N_ELEMENTS(waveIN)
  nuIN = !MKS.clight/!MKS.micron / waveIN

  nucen = !MKS.clight/!MKS.micron / wave_ref
  nusigS = ( 1./(wave_ref-sigmaS) - 1./wave_ref ) * !MKS.clight/!MKS.micron
  nusigL = ( 1./wave_ref - 1./(wave_ref+sigmaL) ) * !MKS.clight/!MKS.micron

  whS = WHERE(waveIN <span style="color: #afd8af;">LE</span> <span style="color: #ff69b4;">wave_ref</span>, NS, COMP=whL, NCOMP=NL)
  Fnu0_norm = DBLARR(Nw)

  AS = 2.D/(1.+nusigL/nusigS)
  AL = AS*nusigL/nusigS
  IF (<span style="color: #afd8af;">NS</span> <span style="color: #ff69b4;">GT</span> 0) THEN $
    Fnu0_norm[whS] = AS * nusigS/!PI / ( (nuIN[whS]-nucen)^2 + nusigS^2 )
  IF (<span style="color: #afd8af;">NL</span> <span style="color: #ff69b4;">GT</span> 0) THEN $
    Fnu0_norm[whL] = AL * nusigL/!PI / ( (nuIN[whL]-nucen)^2 + nusigL^2 )

  RETURN, <span style="color: #ff69b4;">Fnu0_norm</span>

END
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org82f561a" class="outline-2">
<h2 id="org82f561a"><span class="section-number-2">3</span> Automatize the degradation of the spectral resolution</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-idl"><span style="color: #afd8af;">FUNCTION</span> <span style="color: #ff69b4;">degradeRes</span>, <span style="color: #ff69b4;">wc</span>, <span style="color: #ff69b4;">dw</span>, <span style="color: #ff69b4;">INSTRUMENT</span>=instr

  ;; Line width <span style="color: #afd8af;">fixed</span> <span style="color: #ff69b4;">by</span> the instrumental resolution
  dw_w_CAM = 0.010373835D
  dw_w_SL = 0.0055722841D
  dw_w_SH = 0.00075127093D
  dw_w_LL = 0.0057517091D
  dw_w_LH = 0.00070906159D
  dw_w_SWS = 0.0011044189D
  dw_w_SWSfine = 0.00036671469D
  dw_w_AKARI_Ns = 0.00356688D

  ;; Fix the linewidth
  CASE <span style="color: #afd8af;">instr</span> <span style="color: #ff69b4;">OF</span>
    <span style="color: #61CE3C;">"SH"</span>: sigma = dw_w_SH * wc
    <span style="color: #61CE3C;">"LH"</span>: sigma = dw_w_LH * wc
    <span style="color: #61CE3C;">"SL"</span>: sigma = dw_w_SL * wc
    <span style="color: #61CE3C;">"LL"</span>: sigma = dw_w_LL * wc
    <span style="color: #61CE3C;">"SL-SH"</span>: BEGIN
      IF (<span style="color: #afd8af;">wc</span> <span style="color: #ff69b4;">LT</span> 10.) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">sigma</span> = dw_w_SL * wc
      IF (<span style="color: #afd8af;">wc</span> <span style="color: #ff69b4;">GE</span> 10.) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">sigma</span> = dw_w_SH * wc
    END
    <span style="color: #61CE3C;">"SL-LL"</span>: BEGIN
      IF (<span style="color: #afd8af;">wc</span> <span style="color: #ff69b4;">LT</span> 12.) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">sigma</span> = dw_w_SL * wc
      IF (<span style="color: #afd8af;">wc</span> <span style="color: #ff69b4;">GE</span> 12.) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">sigma</span> = dw_w_LL * wc
    END
    <span style="color: #61CE3C;">"Ns-SL"</span>: BEGIN
      IF (<span style="color: #afd8af;">wc</span> <span style="color: #ff69b4;">LT</span> 5.) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">sigma</span> = dw_w_AKARI_Ns * wc
      IF (<span style="color: #afd8af;">wc</span> <span style="color: #ff69b4;">GE</span> 5.) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">sigma</span> = dw_w_SL * wc
    END
    <span style="color: #61CE3C;">"CAM"</span>: sigma = dw_w_CAM * wc
    <span style="color: #61CE3C;">"SWS"</span>: sigma = dw_w_SWS * wc
    <span style="color: #61CE3C;">"SWSfine"</span>: sigma = dw_w_SWSfine * wc
    ELSE: sigma = dw
  ENDCASE

  RETURN, <span style="color: #ff69b4;">sigma</span>

END
</pre>
</div>
</div>
</div>
<div id="outline-container-org4545cbf" class="outline-2">
<h2 id="org4545cbf"><span class="section-number-2">4</span> Create the parameter structure</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-idl"><span style="color: #afd8af;">FUNCTION</span> <span style="color: #ff69b4;">parstruct</span>, <span style="color: #ff69b4;">parm</span>, <span style="color: #ff69b4;">Nbb</span>=Nbb, <span style="color: #ff69b4;">Nline</span>=Nline, <span style="color: #ff69b4;">Nband</span>=Nband, <span style="color: #ff69b4;">NAv</span>=NAv,<span style="color: #ff69b4;">Nstar</span>=Nstar

  par = { massBB: DBLARR(MAXI(Nbb,1)), $
          tempBB: DBLARR(MAXI(Nbb,1)), $
          Iline: DBLARR(MAXI(Nline,1)), $
          Cline: DBLARR(MAXI(Nline,1)), $
          Wline: DBLARR(MAXI(Nline,1)), $
          Iband: DBLARR(MAXI(Nband,1)), $
          Cband: DBLARR(MAXI(Nband,1)), $
          WSband: DBLARR(MAXI(Nband,1)), $
          WLband: DBLARR(MAXI(Nband,1)), $
          Av: DBLARR(MAXI(NAv,1)), $
          massStar: 0.D }

  ;; 1) <span style="color: #afd8af;">Continuum</span>
  <span style="color: #ff69b4;">i0</span> = 0
  FOR i=0,<span style="color: #ff69b4;">Nbb</span>-1 DO BEGIN
    par.massBB[i] = parm[i0+2*i]
    par.tempBB[i] = parm[i0+2*i+1]
  ENDFOR
  ;; 2) <span style="color: #afd8af;">Lines</span>
  <span style="color: #ff69b4;">i0</span> += 2*Nbb
  FOR i=0,<span style="color: #ff69b4;">Nline</span>-1 DO BEGIN
    par.Iline[i] = parm[i0+3*i]
    par.Cline[i] = parm[i0+3*i+1]
    par.Wline[i] = parm[i0+3*i+2]
  ENDFOR
  ;; 3) <span style="color: #afd8af;">Bands</span>
  <span style="color: #ff69b4;">i0</span> += 3*Nline
  FOR i=0,<span style="color: #ff69b4;">Nband</span>-1 DO BEGIN
    par.Iband[i] = parm[i0+4*i]
    par.Cband[i] = parm[i0+4*i+1]
    par.WSband[i] = parm[i0+4*i+2]
    par.WLband[i] = parm[i0+4*i+3]
  ENDFOR
  ;; 4) <span style="color: #afd8af;">Av</span>
  <span style="color: #ff69b4;">i0</span> += 4*Nband
  FOR i=0,<span style="color: #ff69b4;">NAv</span>-1 DO par.Av[i] = parm[i0+i]
  ;; 5) <span style="color: #afd8af;">Star</span>
  <span style="color: #ff69b4;">i0</span> += NAv
  IF (<span style="color: #afd8af;">Nstar</span> <span style="color: #ff69b4;">GT</span> 0) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">par</span>.massStar = parm[i0]

  RETURN, <span style="color: #ff69b4;">par</span>

END
</pre>
</div>
</div>
</div>
<div id="outline-container-org2f70901" class="outline-2">
<h2 id="org2f70901"><span class="section-number-2">5</span> Independent Fit of the lines</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-idl"><span style="color: #afd8af;">PRO</span> <span style="color: #ff69b4;">linealone</span>, <span style="color: #ff69b4;">wave</span>, <span style="color: #ff69b4;">parm</span>, <span style="color: #ff69b4;">FnuOUT</span>, <span style="color: #ff69b4;">_EXTRA</span>=extra

  ;; <span style="color: #afd8af;">Line</span>
  <span style="color: #ff69b4;">Iline</span> = parm[0]
  Cline = parm[1]
  Wline = parm[2]
  Fnu_line = Iline*GAUSSLINE(wave,Cline,Wline)

  ;; <span style="color: #afd8af;">Continuum</span>
  <span style="color: #ff69b4;">a</span> = parm[3]
  b = parm[4]
  c = parm[5]
  x = (wave - extra.center)/extra.center
  Fnu_cont = a*(1+b*x+c*x^2)

  ;; <span style="color: #afd8af;">Total</span>
  <span style="color: #ff69b4;">FnuOUT</span> = Fnu_cont + Fnu_line

  ;; <span style="color: #afd8af;">Display</span>
  <span style="color: #ff1493;">IF</span> (extra.noplot LT 1) THEN <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #ff69b4;">wh</span> = WHERE(extra.FnuObs GT 0.)
    ranFnu = [MIN(extra.FnuObs[wh])*0.9,1.05*MAX(extra.FnuObs)]
    PLOTAXIS, <span style="color: #ff69b4;">MI</span>=extra.milli, <span style="color: #ff69b4;">XRANGE</span>=extra.ranw, <span style="color: #ff69b4;">YRANGE</span>=ranFnu, $
              YLOG=extra.logplot, TITLE=<span style="color: #61CE3C;">"!6"</span>+extra.title, $
              XTITLE=!PL.wmic, YTITLE=!PL.Fnu+<span style="color: #61CE3C;">" [MJy/sr]"</span>
    OPLOT, wave, Fnu_cont, COLOR=!RED
    OPLOT, wave, Fnu_cont+Fnu_line, COLOR=!BLUE
    OPLOT, wave, FnuOUT, LINE=2, COLOR=!DARKGREY
    WONDERRPLOT, extra.wavObs, extra.FnuObs, extra.wavObs*0., extra.dFnuObs, $
                 PSYM=<span style="color: #61CE3C;">"circ"</span>, SYMSIZE=0.3*!P.SYMSIZE, BARTHICK=0.3*!P.THICK
  ENDIF

END
</pre>
</div>
</div>
</div>
