MILES/arx/miles.org
* Total model
#+BEGIN_SRC idl
PRO specmodel, wave, parm, FnuOUT, FNU_BB=Fnu_cont_tab, PABS=Pabs, $
               FNU_BAND=Fnu_band_tab, FNU_LINE=Fnu_line, $
               FNU_STAR=Fnu_star, _EXTRA=extra

  ;; Parameters
  par = PARSTRUCT(parm,Nbb=extra.Nbb,Nline=extra.Nline,Nband=extra.Nband, $ 
                       NAv=extra.NAv,Nstar=extra.Nstar)
  w = extra.w
  FnuOUT = DBLARR(extra.Nw)


  ;; Screen extinction
  ;;------------------
  IF (extra.NAv GT 0) THEN BEGIN 
    tau_tab = DBLARR(extra.NAv,extra.Nw)
    FOR i=0,extra.NAv-1 DO BEGIN
      Av = par.Av[i]
      tau_tab[i,*] = Av/1.086*extra.extinct[i].tau0
    ENDFOR
    Pabs = EXP(-TOTAL(tau_tab,1))
  ENDIF ELSE Pabs = REPLICATE(1.D,extra.Nw)


  ;; Continuum
  ;;----------
  IF (extra.Nbb GT 0) THEN BEGIN
    Fnu_cont_tab = DBLARR(extra.Nbb,extra.Nw)
    FOR i=0,extra.Nbb-1 DO $
      Fnu_cont_tab[i,*] =par.massBB[i]*MODIFBB(extra.Qabs[i],TEMP=par.tempBB[i])
  ENDIF ELSE Fnu_cont_tab = DBLARR(1,extra.Nw)
  Fnu_cont = TOTAL(Fnu_cont_tab,1)


  ;; Lines
  ;;------
  IF (extra.Nline GT 0) THEN BEGIN

    ;; Line profile
    Fnu_line = DBLARR(extra.Nw)
    IF (extra.Nline2 GT 0) THEN BEGIN
      Fnu_line_tab = DBLARR(extra.Nline,extra.Nw)
      FOR i=0,extra.Nlinefree-1 DO $
        Fnu_line_tab[extra.whlinefree[i],*] = par.Iline[extra.whlinefree[i]] $
          * GAUSSLINE(w,par.Cline[extra.whlinefree[i]], $
                      par.Wline[extra.whlinefree[i]])
      FOR i=0,extra.Nlinefix-1 DO $
        Fnu_line_tab[extra.whlinefix[i],*] = par.Iline[extra.whlinefix[i]] $
          * extra.lines[extra.whlinefix[i]].Fnu0

      Fnu_line += TOTAL(Fnu_line_tab[extra.whline2,*],1)*Pabs
    ENDIF

    ;; Lines which were computed first are not absorbed!
    IF (extra.Nline1 GT 0) THEN Fnu_line += extra.Fnu0_line

  ENDIF ELSE Fnu_line = DBLARR(extra.Nw)


  ;; Bands
  ;;------
  IF (extra.Nband GT 0) THEN BEGIN
    Fnu_band_tab = DBLARR(extra.Nband,extra.Nw)

    ;; Bands which are free to vary
    FOR i=0,extra.Nbandfree-1 DO $
      Fnu_band_tab[extra.whbandfree[i],*] = par.Iband[extra.whbandfree[i]] $
        * LORENTZBAND(w,par.Cband[extra.whbandfree[i]], $
                        par.WSband[extra.whbandfree[i]], $
                        par.WLband[extra.whbandfree[i]])

    ;; Fixed profiles
    FOR i=0,extra.Nbandfix-1 DO $
      Fnu_band_tab[extra.whbandfix[i],*] = par.Iband[extra.whbandfix[i]] $
        * extra.bands[extra.whbandfix[i]].Fnu0

  ENDIF ELSE Fnu_band_tab = DBLARR(1,extra.Nw)
  Fnu_band = TOTAL(Fnu_band_tab,1)


  ;; Stellar continuum
  ;;------------------
  IF (extra.Nstar GT 0) THEN Fnu_star = par.massStar * extra.Fnu_star0 $
                        ELSE Fnu_star = DBLARR(extra.Nw)


  ;; Final fit & display
  ;;--------------------
  Fnu_tot = (Fnu_cont+Fnu_band+Fnu_star)*Pabs + Fnu_line
  IF (extra.hires NE 1) THEN FnuOUT = Fnu_tot $
                        ELSE FnuOUT = FINTERPOL(Fnu_tot,w,extra.wavobs)

  IF (extra.noplot LE 1) THEN BEGIN

    PLOTAXIS, OO=extra.logplot, MI=extra.milli, $
              XRANGE=extra.ranw, YRANGE=extra.ranFnu, $
              TITLE="!6"+extra.title, $
              XTITLE=!PL.wmic, YTITLE=!PL.Fnu+" [MJy/sr]"

      Nw_thresh = 800
      IF (extra.Nw LT Nw_thresh) THEN BEGIN
        OPLOT, extra.wavOBS, extra.FnuOBS
        WONDERRPLOT, extra.wavOBS, extra.FnuOBS, $
                     extra.wavOBS*0., extra.dFnuOBS, $
                     PSYM="circ", SYMSIZE=0.1*!P.SYMSIZE, $
                     BARTHICK=0.1*!P.THICK, COLOR=!DARKGREY
      ENDIF ELSE BEGIN
        CURVEFILL, extra.wavOBS, extra.FnuOBS-extra.dFnuOBS, $
                   extra.wavOBS, extra.FnuOBS+extra.dFnuOBS, $
                   COLOR=!SHADEGREY, XRANGE=MINMAX(extra.wavOBS)
      ENDELSE

      OPLOT, w, Fnu_star*Pabs, COLOR=!YELLOW
      FOR i=0,extra.Nbb-1 DO BEGIN
        CASE extra.cont[i].type OF
          "sil": col = !ROSE
          "sil_norm": col = !ROSE
          "sil_Odef": col = !ROSE
          "al2o3": col = !RED
          "al2o3_compact": col = !RED
          "al2o3_porous": col = !RED
          "al2o3_compact_cde": col = !RED
          "al2o3_koike_cde": col = !RED
          "al2o3_koike": col = !RED
          ELSE: col = !ORANGE
        ENDCASE
        OPLOT, w, REFORM(Fnu_cont_tab[i,*])*Pabs, COLOR=col
      ENDFOR

      FOR i=0,extra.Nline-1 DO $
        OPLOT, w, (Fnu_star+Fnu_cont)*Pabs+Fnu_line, COLOR=!FORREST

      FOR i=0,extra.Nband-1 DO $
        OPLOT, w, (Fnu_star+Fnu_cont+REFORM(Fnu_band_tab[i,*]))*Pabs, $
               COLOR=!BLUE

      IF (extra.Nw LT Nw_thresh) THEN $
        OPLOT, extra.wavOBS, extra.FnuOBS, PSYM=SYMB("circ"), $
               SYMSIZE=0.1*!P.SYMSIZE $
        ELSE OPLOT, extra.wavOBS, extra.FnuOBS, LINE=2
      OPLOT, w, Fnu_tot, COLOR=!LIGHTGREY, THICK=1.3*!P.THICK

    PLOTAXIS, OO=extra.logplot, MI=extra.milli, $
              XRANGE=extra.ranw, YRANGE=extra.ranFnu, $
              TITLE="!6"+extra.title, $
              XTITLE=!PL.wmic, YTITLE=!PL.Fnu+" [MJy/sr]", $
              /NOERASE

 ENDIF


END
#+END_SRC


  ;;=========================================================================

