MILES/archives/miles.html

<div id="outline-container-org493b7b4" class="outline-2">
<h2 id="org493b7b4"><span class="section-number-2">6</span> Total model</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-idl"><span style="color: #afd8af;">PRO</span> <span style="color: #ff69b4;">specmodel</span>, <span style="color: #ff69b4;">wave</span>, <span style="color: #ff69b4;">parm</span>, <span style="color: #ff69b4;">FnuOUT</span>, <span style="color: #ff69b4;">FNU_BB</span>=Fnu_cont_tab, <span style="color: #ff69b4;">PABS</span>=Pabs, $
               FNU_BAND=Fnu_band_tab, FNU_LINE=Fnu_line, $
               FNU_STAR=Fnu_star, _EXTRA=extra

  ;; <span style="color: #afd8af;">Parameters</span>
  <span style="color: #ff69b4;">par</span> = PARSTRUCT(parm,Nbb=extra.Nbb,Nline=extra.Nline,Nband=extra.Nband, $ 
                       NAv=extra.NAv,Nstar=extra.Nstar)
  w = extra.w
  FnuOUT = DBLARR(extra.Nw)


  ;; <span style="color: #afd8af;">Screen</span> <span style="color: #ff69b4;">extinction</span>
  ;;------------------
  IF (extra.NAv GT 0) THEN <span style="color: #afd8af;">BEGIN</span> 
    <span style="color: #ff69b4;">tau_tab</span> = DBLARR(extra.NAv,extra.Nw)
    <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">i</span>=0,<span style="color: #ff69b4;">extra</span>.NAv-1 DO BEGIN
      Av = par.Av[i]
      tau_tab[i,*] = Av/1.086*extra.extinct[i].tau0
    ENDFOR
    Pabs = EXP(-TOTAL(tau_tab,1))
  ENDIF <span style="color: #afd8af;">ELSE</span> <span style="color: #ff69b4;">Pabs</span> = REPLICATE(1.D,extra.Nw)


  ;; Continuum
  ;;----------
  IF (extra.Nbb GT 0) THEN <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #ff69b4;">Fnu_cont_tab</span> = DBLARR(extra.Nbb,extra.Nw)
    <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">i</span>=0,<span style="color: #ff69b4;">extra</span>.Nbb-1 DO $
      Fnu_cont_tab[i,*] =par.massBB[i]*MODIFBB(extra.Qabs[i],TEMP=par.tempBB[i])
  ENDIF <span style="color: #afd8af;">ELSE</span> <span style="color: #ff69b4;">Fnu_cont_tab</span> = DBLARR(1,extra.Nw)
  Fnu_cont = TOTAL(Fnu_cont_tab,1)


  ;; Lines
  ;;------
  IF (extra.Nline GT 0) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">BEGIN</span>

    ;; Line <span style="color: #afd8af;">profile</span>
    <span style="color: #ff69b4;">Fnu_line</span> = DBLARR(extra.Nw)
    IF (extra.Nline2 GT 0) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
      <span style="color: #ff69b4;">Fnu_line_tab</span> = DBLARR(extra.Nline,extra.Nw)
      <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">i</span>=0,<span style="color: #ff69b4;">extra</span>.Nlinefree-1 DO $
        Fnu_line_tab[extra.whlinefree[i],*] = par.Iline[extra.whlinefree[i]] $
          * GAUSSLINE(w,par.Cline[extra.whlinefree[i]], $
                      par.Wline[extra.whlinefree[i]])
      <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">i</span>=0,<span style="color: #ff69b4;">extra</span>.Nlinefix-1 DO $
        Fnu_line_tab[extra.whlinefix[i],*] = par.Iline[extra.whlinefix[i]] $
          * extra.lines[extra.whlinefix[i]].Fnu0

      Fnu_line += TOTAL(Fnu_line_tab[extra.whline2,*],1)*Pabs
    ENDIF

    ;; Lines which were computed first are <span style="color: #afd8af;">not</span> <span style="color: #ff1493;">absorbed</span>!
    IF (extra.Nline1 GT 0) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">Fnu_line</span> += extra.Fnu0_line

  ENDIF ELSE Fnu_line = DBLARR(extra.Nw)


  ;; Bands
  ;;------
  IF (extra.Nband GT 0) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #ff69b4;">Fnu_band_tab</span> = DBLARR(extra.Nband,extra.Nw)

    ;; Bands which are free to vary
    <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">i</span>=0,<span style="color: #ff69b4;">extra</span>.Nbandfree-1 DO $
      Fnu_band_tab[extra.whbandfree[i],*] = par.Iband[extra.whbandfree[i]] $
        * LORENTZBAND(w,par.Cband[extra.whbandfree[i]], $
                        par.WSband[extra.whbandfree[i]], $
                        par.WLband[extra.whbandfree[i]])

    ;; Fixed profiles
    <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">i</span>=0,<span style="color: #ff69b4;">extra</span>.Nbandfix-1 DO $
      Fnu_band_tab[extra.whbandfix[i],*] = par.Iband[extra.whbandfix[i]] $
        * extra.bands[extra.whbandfix[i]].Fnu0

  ENDIF ELSE Fnu_band_tab = DBLARR(1,extra.Nw)
  Fnu_band = TOTAL(Fnu_band_tab,1)


  ;; <span style="color: #afd8af;">Stellar</span> <span style="color: #ff69b4;">continuum</span>
  ;;------------------
  IF (extra.Nstar GT 0) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">Fnu_star</span> = par.massStar * extra.Fnu_star0 $
                        ELSE Fnu_star = DBLARR(extra.Nw)


  ;; <span style="color: #afd8af;">Final</span> <span style="color: #ff69b4;">fit</span> &amp; display
  ;;--------------------
  Fnu_tot = (Fnu_cont+Fnu_band+Fnu_star)*Pabs + Fnu_line
  IF (extra.hires NE 1) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">FnuOUT</span> = Fnu_tot $
                        ELSE FnuOUT = FINTERPOL(Fnu_tot,w,extra.wavobs)

  IF (extra.noplot LE 1) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>

    <span style="color: #ff69b4;">PLOTAXIS</span>, <span style="color: #ff69b4;">OO</span>=extra.logplot, <span style="color: #ff69b4;">MI</span>=extra.milli, $
              XRANGE=extra.ranw, YRANGE=extra.ranFnu, $
              TITLE=<span style="color: #61CE3C;">"!6"</span>+extra.title, $
              XTITLE=!PL.wmic, YTITLE=!PL.Fnu+<span style="color: #61CE3C;">" [MJy/sr]"</span>

      Nw_thresh = 800
      IF (extra.Nw LT Nw_thresh) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
        <span style="color: #ff69b4;">OPLOT</span>, <span style="color: #ff69b4;">extra</span>.wavOBS, <span style="color: #ff69b4;">extra</span>.FnuOBS
        WONDERRPLOT, <span style="color: #ff69b4;">extra</span>.wavOBS, <span style="color: #ff69b4;">extra</span>.FnuOBS, $
                     extra.wavOBS*0., extra.dFnuOBS, $
                     PSYM=<span style="color: #61CE3C;">"circ"</span>, SYMSIZE=0.1*!P.SYMSIZE, $
                     BARTHICK=0.1*!P.THICK, COLOR=!DARKGREY
      ENDIF ELSE BEGIN
        CURVEFILL, extra.wavOBS, extra.FnuOBS-extra.dFnuOBS, $
                   extra.wavOBS, extra.FnuOBS+extra.dFnuOBS, $
                   COLOR=!SHADEGREY, XRANGE=MINMAX(extra.wavOBS)
      <span style="color: #afd8af;">ENDELSE</span>

      <span style="color: #ff69b4;">OPLOT</span>, <span style="color: #ff69b4;">w</span>, <span style="color: #ff69b4;">Fnu_star</span>*Pabs, <span style="color: #ff69b4;">COLOR</span>=!YELLOW
      FOR i=0,<span style="color: #ff69b4;">extra</span>.Nbb-1 DO BEGIN
        CASE extra.cont[i].type OF
          <span style="color: #61CE3C;">"sil"</span>: col = !ROSE
          <span style="color: #61CE3C;">"sil_norm"</span>: col = !ROSE
          <span style="color: #61CE3C;">"sil_Odef"</span>: col = !ROSE
          <span style="color: #61CE3C;">"al2o3"</span>: col = !RED
          <span style="color: #61CE3C;">"al2o3_compact"</span>: col = !RED
          <span style="color: #61CE3C;">"al2o3_porous"</span>: col = !RED
          <span style="color: #61CE3C;">"al2o3_compact_cde"</span>: col = !RED
          <span style="color: #61CE3C;">"al2o3_koike_cde"</span>: col = !RED
          <span style="color: #61CE3C;">"al2o3_koike"</span>: col = !RED
          ELSE: col = !ORANGE
        ENDCASE
        OPLOT, <span style="color: #ff69b4;">w</span>, <span style="color: #ff1493;">REFORM</span>(Fnu_cont_tab[i,*])*Pabs, COLOR=col
      ENDFOR

      FOR i=0,extra.Nline-1 DO $
        OPLOT, w, (Fnu_star+Fnu_cont)*Pabs+Fnu_line, COLOR=!FORREST

      FOR i=0,extra.Nband-1 DO $
        OPLOT, w, (Fnu_star+Fnu_cont+REFORM(Fnu_band_tab[i,*]))*Pabs, $
               COLOR=!BLUE

      IF (extra.Nw LT Nw_thresh) THEN $
        OPLOT, extra.wavOBS, extra.FnuOBS, PSYM=SYMB(<span style="color: #61CE3C;">"circ"</span>), $
               SYMSIZE=0.1*!P.SYMSIZE $
        ELSE OPLOT, extra.wavOBS, extra.FnuOBS, LINE=2
      OPLOT, w, Fnu_tot, COLOR=!LIGHTGREY, THICK=1.3*!P.THICK

    PLOTAXIS, OO=extra.logplot, MI=extra.milli, $
              XRANGE=extra.ranw, YRANGE=extra.ranFnu, $
              TITLE=<span style="color: #61CE3C;">"!6"</span>+extra.title, $
              XTITLE=!PL.wmic, YTITLE=!PL.Fnu+<span style="color: #61CE3C;">" [MJy/sr]"</span>, $
              /NOERASE

 ENDIF


END
</pre>
</div>


<p>
;;=========================================================================
</p>
</div>
</div>
