MILES/arx/miles.org
* Main program
#+BEGIN_SRC idl
PRO MILES, wavobsIN, FnuobsIN, dFnuobsIN, WEIGHTS=weightsIN, MASK=maskIN, $
    INSTRUMENT=instrumentIN, $
    ;; Printings and savings
    COPY=filepsIN, PDF=pdfIN, EPS=epsIN, SAVE=filexdrIN, MODELSAVE=modsaveIN, $
    NOPLOT=noplotIN, LOGPLOT=logplotIN, QUIET=quietIN, MILLI=milliIN, $
    TITLE=titleIN, RANGEWAVELENGTH=rangewaveIN, RANGEFLUX=rangefluxIN, $
    HIGHRESOLUTION=hiresIN, COPLINE=coplineIN, $
    ;; Tolerance and iteration
    FTOL=ftolIN, NITER=NiterIN, RESTART=restartIN, $
    ;; Physical components
    BBTYPE=BBtypeIN, LINES=linesIN, BANDS=bandsIN, EXTINCTION=extinctionIN, $
    OLD_STARS=old_starIN, LINE_FIRST=line_firstIN, $
    BB_STRUCTURE=bb_structIN, BAND_STRUCTURE=band_structIN, $
    ;; BB parameters
    TEMPBB=tempBBIN, FIXTEMPBB=fixtempBBIN, TMINBB=TminBBIN, TMAXBB=TmaxBBIN, $
    ;; Lines
    FIXCENTERLINE=fixcenterlineIN, FIXSIGMALINE=fixsigmalineIN, $
    ;; Bands
    FIXCENTERBAND=fixcenterbandIN, FIXSIGMABAND=fixsigmabandIN, $
    UNTIESIGMABAND=untiesigmabandIN, $
    ;; Extinction
    Av=AvIN, FIXAV=fixAvIN, MAXAV=AvmaxIN, TCO2=TCO2IN, $
    ;; Field stars
    MASSSTAR=massStarIN, FIXMASSSTAR=fixmassStarIN, $
    RANGEMASSSTAR=ranmassStarIN, $
    ;; Outputs
    PARSTR=parstrOUT, ERRPARSTR=errparstrOUT, PARINFO=parinfoOUT, $
    FIT=fitOUT, STATUS=statusOUT, CHI2=chi2OUT, NOX=noX

 
  !EXCEPT = 0
#+END_SRC
