MILES/archives/miles.html

<div id="outline-container-orgd77fbdc" class="outline-2">
<h2 id="orgd77fbdc"><span class="section-number-2">7</span> Main program</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-idl"><span style="color: #afd8af;">PRO</span> <span style="color: #ff69b4;">MILES</span>, <span style="color: #ff69b4;">wavobsIN</span>, <span style="color: #ff69b4;">FnuobsIN</span>, <span style="color: #ff69b4;">dFnuobsIN</span>, <span style="color: #ff69b4;">WEIGHTS</span>=weightsIN, <span style="color: #ff69b4;">MASK</span>=maskIN, $
    INSTRUMENT=instrumentIN, $
    ;; Printings and <span style="color: #afd8af;">savings</span>
    <span style="color: #ff69b4;">COPY</span>=filepsIN, <span style="color: #ff69b4;">PDF</span>=pdfIN, <span style="color: #ff69b4;">EPS</span>=epsIN, <span style="color: #ff69b4;">SAVE</span>=filexdrIN, <span style="color: #ff69b4;">MODELSAVE</span>=modsaveIN, $
    NOPLOT=noplotIN, LOGPLOT=logplotIN, QUIET=quietIN, MILLI=milliIN, $
    TITLE=titleIN, RANGEWAVELENGTH=rangewaveIN, RANGEFLUX=rangefluxIN, $
    HIGHRESOLUTION=hiresIN, COPLINE=coplineIN, $
    ;; Tolerance and <span style="color: #afd8af;">iteration</span>
    <span style="color: #ff69b4;">FTOL</span>=ftolIN, <span style="color: #ff69b4;">NITER</span>=NiterIN, <span style="color: #ff69b4;">RESTART</span>=restartIN, $
    ;; Physical <span style="color: #afd8af;">components</span>
    <span style="color: #ff69b4;">BBTYPE</span>=BBtypeIN, <span style="color: #ff69b4;">LINES</span>=linesIN, <span style="color: #ff69b4;">BANDS</span>=bandsIN, <span style="color: #ff69b4;">EXTINCTION</span>=extinctionIN, $
    OLD_STARS=old_starIN, LINE_FIRST=line_firstIN, $
    BB_STRUCTURE=bb_structIN, BAND_STRUCTURE=band_structIN, $
    ;; BB <span style="color: #afd8af;">parameters</span>
    <span style="color: #ff69b4;">TEMPBB</span>=tempBBIN, <span style="color: #ff69b4;">FIXTEMPBB</span>=fixtempBBIN, <span style="color: #ff69b4;">TMINBB</span>=TminBBIN, <span style="color: #ff69b4;">TMAXBB</span>=TmaxBBIN, $
    ;; <span style="color: #afd8af;">Lines</span>
    <span style="color: #ff69b4;">FIXCENTERLINE</span>=fixcenterlineIN, <span style="color: #ff69b4;">FIXSIGMALINE</span>=fixsigmalineIN, $
    ;; <span style="color: #afd8af;">Bands</span>
    <span style="color: #ff69b4;">FIXCENTERBAND</span>=fixcenterbandIN, <span style="color: #ff69b4;">FIXSIGMABAND</span>=fixsigmabandIN, $
    UNTIESIGMABAND=untiesigmabandIN, $
    ;; <span style="color: #afd8af;">Extinction</span>
    <span style="color: #ff69b4;">Av</span>=AvIN, <span style="color: #ff69b4;">FIXAV</span>=fixAvIN, <span style="color: #ff69b4;">MAXAV</span>=AvmaxIN, <span style="color: #ff69b4;">TCO2</span>=TCO2IN, $
    ;; Field <span style="color: #afd8af;">stars</span>
    <span style="color: #ff69b4;">MASSSTAR</span>=massStarIN, <span style="color: #ff69b4;">FIXMASSSTAR</span>=fixmassStarIN, $
    RANGEMASSSTAR=ranmassStarIN, $
    ;; <span style="color: #afd8af;">Outputs</span>
    <span style="color: #ff69b4;">PARSTR</span>=parstrOUT, <span style="color: #ff69b4;">ERRPARSTR</span>=errparstrOUT, <span style="color: #ff69b4;">PARINFO</span>=parinfoOUT, $
    FIT=fitOUT, STATUS=statusOUT, CHI2=chi2OUT, NOX=noX


  !EXCEPT = 0
</pre>
</div>
</div>
