MILES/arx/miles.org
** Organize the inputs
#+BEGIN_SRC idl
  ;; Banners
  ;;--------
  ;; Info
  banner = [STRJOIN(REPLICATE("-",80)), $
            STRJOIN(REPLICATE(" ",15))+"MILES: "+ $
            "Mid-Infrared Line Extraction Software.",$
            "It belongs to the SWING (SoftWares for Interpreting Nebulae and " $
            +"Galaxies) package", $
            STRJOIN(REPLICATE(" ",30))+"(written by F. G.).", $
            STRJOIN(REPLICATE(" ",80))]
  
  ;; Manual
  manual = $
  ["MILES, wavOBS[N], FnuOBS[N][Nx,Ny,N], dFnuOBS[N][Nx,Ny,N], INSTRUMENT=[N],"$
   +" WEIGHTS=[N][Nx,Ny,N],", $
   "   MASK=mask[Nx,Ny],", $
   "        (wave in microns is supposed to be sorted, Fnu in MJy/sr)", $
   "   COPY=fileps, /PDF, /EPS, SAVE=filexdr, /MODELSAVE, /NOPLOT, /LOGPLOT,"$
   +" /QUIET, TITLE=''[Nx,Ny]], ", $
   "   /MILLI, RANGEWAVELENGTH=[,], /HIGHRES, FTOL=1.D-5, NITER=250, "$
   +"/RESTART, /COPLINE", $
   "        (Physical components)", $
   "   BBTYPE={1,['crb','gra','sil_norm','al2o3_koike',etc.]}, ", $
   "   LINES={1,['[ArII]','[SIV]',etc.]},", $
   "   BANDS={1,['PAH6.2','PAH7.4',etc.]}, ", $
   "   EXTINCTION={1,['Dudley','CO2']},", $
   "   LINE_FIRST={1,['[ArII]',etc.]},", $
   "        (BB parameters)", $
   "   TEMPBB=[Nbb], FIXTEMPBB={1,[Nbb]}, TMINBB={T,[Nbb]}, TMAXBB={T,[Nbb]},",$
   "        (Field stars)", $
   "   MASSSTAR=, /FIXMASSSTAR, RANGEMASSSTAR=[,], ", $
   "        (Line parameters)", $
   "   FIXCENTERLINE={1,[Nline]}, FIXSIGMALINE={1,[Nline]}, ", $
   "        (band parameters)", $
   "   FIXCENTERBAND={1,[Nband]}, FIXSIGMABAND={1,[Nband]}, /UNTIESIGMABAND, ",$
   "        (Extinction)", $
   "   Av=, /FIXAV, RANGEAV=[,],", $
   "        (Outputs)", $
   "   PARSTR=, ERRPARSTR=, PARINFO=, FIT=, STATUS=, CHI2=," $
   +" BAND_STRUCTURE=bandIN, BB_STRUCTURE=bbIN, /NOX"]
  IF (N_PARAMS() LE 1) THEN BEGIN
    FOR i=0,N_ELEMENTS(manual)-1 DO PRINT, manual[i]
    RETURN
  ENDIF
  t0 = SYSTIME(1)


  ;; Input parameters
  ;;-----------------
  ;; Observed SED (wave is supposed to be sorted and uniqued)
  wavobs = wavobsIN
  nuobs = !MKS.clight/(wavobs*!MKS.micron)
  IF (NOT KEYWORD_SET(rangewaveIN)) THEN ranw = [ MAXI(1.D,0.9*MIN(wavobs)),$
                                                  MINI(40.D,1.1*MAX(wavobs)) ] $
                                    ELSE ranw = rangewaveIN
  IF (N_PARAMS() EQ 2) THEN dFnuobsIN = 0.05*FnuobsIN
  siz = SIZE(FnuOBSIN)
  CASE siz[0] OF
    1: BEGIN
      Nx = 1
      Ny = 1
      Nobs = siz[1]
    END
    2: BEGIN
      Nx = siz[1] 
      Ny = 1
      Nobs = siz[2]
    END
    3: BEGIN
      Nx = siz[1] 
      Ny = siz[2] 
      Nobs = siz[3]
    END
  ENDCASE
  IF (Nobs NE N_ELEMENTS(wavobs)) THEN BEGIN
    PRINT, "!!! MILES: WAVOBS and FNUOBS have incompatible sizes..."
    RETURN
  ENDIF
  Fnuobs = REFORM(FnuobsIN,Nx,Ny,Nobs)
  dFnuobs = REFORM(dFnuobsIN,Nx,Ny,Nobs)
  IF (NOT KEYWORD_SET(maskIN)) THEN BEGIN
    mask = BYTARR(Nx,Ny)
    wh0 = WHERE(TOTAL(Fnuobs,3) EQ 0.D OR FINITE(TOTAL(Fnuobs,3)) EQ 0,N0)
    IF (N0 GT 0) THEN mask[wh0] = 1
  ENDIF ELSE mask = REFORM(maskIN,Nx,Ny)

  ;; Chi square weighting
  IF (NOT KEYWORD_SET(weightsIN)) THEN weights = 1/dFnuobs^2 $
                                  ELSE weights = REFORM(weightsIN,Nx,Ny,Nobs)

  ;; Instrument
  IF (NOT KEYWORD_SET(instrumentIN)) THEN instrument = REPLICATE("",Nobs) $
    ELSE IF (N_ELEMENTS(instrument) EQ Nobs) THEN instrument = instrumentIN $
            ELSE instrument = REPLICATE(instrumentIN[0],Nobs)

  ;; EPS files
  IF KEYWORD_SET(filepsIN) THEN BEGIN
    IF (N_ELEMENTS(filepsIN) EQ 1) THEN BEGIN
      filepsrad = STRREPLACE(filepsIN,[".eps"],[""])
      IF (Ny EQ 1) THEN $
        IF (Nx EQ 1) THEN fileps = filepsrad+".eps" $
                     ELSE fileps = filepsrad+"_"+PRING(INDGEN(Nx)+1)+".eps" $
      ELSE BEGIN
        fileps = STRARR(Nx,Ny)
        FOR x=0,Nx-1 DO $
          fileps[x,*] = filepsrad+"_"+PRING(x+1)+"_"+PRING(INDGEN(Ny)+1)+".eps"
      ENDELSE
    ENDIF ELSE fileps = filepsIN
  ENDIF ELSE fileps = 0


  ;; Fit control parameters
  ;;-----------------------
  ;; Tolerance, iteration, printing
  IF (NOT KEYWORD_SET(milliIN)) THEN milli = 0 ELSE milli = milliIN
  IF (NOT KEYWORD_SET(titleIN)) THEN title = "" ELSE title = titleIN+" "
  IF (NOT KEYWORD_SET(noplotIN)) THEN noplot = 0 ELSE noplot = noplotIN
  IF (NOT KEYWORD_SET(logplotIN)) THEN logplot = 0 ELSE logplot = logplotIN
  IF (NOT KEYWORD_SET(quietIN)) THEN quiet = 0 ELSE quiet = quietIN
  IF (NOT KEYWORD_SET(ftolIN)) THEN ftol = 1.D-10 ELSE ftol = ftolIN
  IF (NOT KEYWORD_SET(NiterIN)) THEN Niter = 250 ELSE Niter = NiterIN
  IF (NOT KEYWORD_SET(restartIN)) THEN restart = 0 ELSE restart = restartIN
  IF (NOT KEYWORD_SET(hiresIN)) THEN hires = 0 ELSE hires = hiresIN

  ;; Banner
  IF (quiet LE 2) THEN BEGIN
    PRINT, banner
  ENDIF
#+END_SRC
