MILES/archives/miles.html
<div id="outline-container-org6d140d2" class="outline-3">
<h3 id="org6d140d2"><span class="section-number-3">7.1</span> Organize the inputs</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-idl">;; Banners
;;--------
;; <span style="color: #afd8af;">Info</span>
<span style="color: #ff69b4;">banner</span> = [STRJOIN(REPLICATE(<span style="color: #61CE3C;">"-"</span>,80)), $
          STRJOIN(REPLICATE(<span style="color: #61CE3C;">" "</span>,15))+<span style="color: #61CE3C;">"MILES: "</span>+ $
          <span style="color: #61CE3C;">"Mid-Infrared Line Extraction Software."</span>,$
          <span style="color: #61CE3C;">"It belongs to the SWING (SoftWares for Interpreting Nebulae and "</span> $
          +<span style="color: #61CE3C;">"Galaxies) package"</span>, $
          STRJOIN(REPLICATE(<span style="color: #61CE3C;">" "</span>,30))+<span style="color: #61CE3C;">"(written by F. G.)."</span>, $
          STRJOIN(REPLICATE(<span style="color: #61CE3C;">" "</span>,80))]

;; <span style="color: #afd8af;">Manual</span>
<span style="color: #ff69b4;">manual</span> = $
[<span style="color: #61CE3C;">"MILES, wavOBS[N], FnuOBS[N][Nx,Ny,N], dFnuOBS[N][Nx,Ny,N], INSTRUMENT=[N],"</span>$
 +<span style="color: #61CE3C;">" WEIGHTS=[N][Nx,Ny,N],"</span>, $
 <span style="color: #61CE3C;">"   MASK=mask[Nx,Ny],"</span>, $
 <span style="color: #61CE3C;">"        (wave in microns is supposed to be sorted, Fnu in MJy/sr)"</span>, $
 <span style="color: #61CE3C;">"   COPY=fileps, /PDF, /EPS, SAVE=filexdr, /MODELSAVE, /NOPLOT, /LOGPLOT,"</span>$
 +<span style="color: #61CE3C;">" /QUIET, TITLE=''[Nx,Ny]], "</span>, $
 <span style="color: #61CE3C;">"   /MILLI, RANGEWAVELENGTH=[,], /HIGHRES, FTOL=1.D-5, NITER=250, "</span>$
 +<span style="color: #61CE3C;">"/RESTART, /COPLINE"</span>, $
 <span style="color: #61CE3C;">"        (Physical components)"</span>, $
 <span style="color: #61CE3C;">"   BBTYPE={1,['crb','gra','sil_norm','al2o3_koike',etc.]}, "</span>, $
 <span style="color: #61CE3C;">"   LINES={1,['[ArII]','[SIV]',etc.]},"</span>, $
 <span style="color: #61CE3C;">"   BANDS={1,['PAH6.2','PAH7.4',etc.]}, "</span>, $
 <span style="color: #61CE3C;">"   EXTINCTION={1,['Dudley','CO2']},"</span>, $
 <span style="color: #61CE3C;">"   LINE_FIRST={1,['[ArII]',etc.]},"</span>, $
 <span style="color: #61CE3C;">"        (BB parameters)"</span>, $
 <span style="color: #61CE3C;">"   TEMPBB=[Nbb], FIXTEMPBB={1,[Nbb]}, TMINBB={T,[Nbb]}, TMAXBB={T,[Nbb]},"</span>,$
 <span style="color: #61CE3C;">"        (Field stars)"</span>, $
 <span style="color: #61CE3C;">"   MASSSTAR=, /FIXMASSSTAR, RANGEMASSSTAR=[,], "</span>, $
 <span style="color: #61CE3C;">"        (Line parameters)"</span>, $
 <span style="color: #61CE3C;">"   FIXCENTERLINE={1,[Nline]}, FIXSIGMALINE={1,[Nline]}, "</span>, $
 <span style="color: #61CE3C;">"        (band parameters)"</span>, $
 <span style="color: #61CE3C;">"   FIXCENTERBAND={1,[Nband]}, FIXSIGMABAND={1,[Nband]}, /UNTIESIGMABAND, "</span>,$
 <span style="color: #61CE3C;">"        (Extinction)"</span>, $
 <span style="color: #61CE3C;">"   Av=, /FIXAV, RANGEAV=[,],"</span>, $
 <span style="color: #61CE3C;">"        (Outputs)"</span>, $
 <span style="color: #61CE3C;">"   PARSTR=, ERRPARSTR=, PARINFO=, FIT=, STATUS=, CHI2=,"</span> $
 +<span style="color: #61CE3C;">" BAND_STRUCTURE=bandIN, BB_STRUCTURE=bbIN, /NOX"</span>]
IF (N_PARAMS() LE 1) THEN BEGIN
  <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">i</span>=0,<span style="color: #ff1493;">N_ELEMENTS</span>(manual)-1 DO PRINT, manual[i]
  RETURN
ENDIF
t0 = SYSTIME(1)


;; <span style="color: #afd8af;">Input</span> <span style="color: #ff69b4;">parameters</span>
;;-----------------
;; <span style="color: #afd8af;">Observed</span> <span style="color: #ff1493;">SED</span> (wave is supposed to be sorted <span style="color: #afd8af;">and</span> <span style="color: #ff69b4;">uniqued</span>)
wavobs = wavobsIN
nuobs = !MKS.clight/(wavobs*!MKS.micron)
IF (<span style="color: #afd8af;">NOT</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">rangewaveIN</span>)) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">ranw</span> = [ MAXI(1.D,0.9*MIN(wavobs)),$
                                                MINI(40.D,1.1*MAX(wavobs)) ] $
                                  ELSE ranw = rangewaveIN
IF (N_PARAMS() EQ 2) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">dFnuobsIN</span> = 0.05*FnuobsIN
siz = SIZE(FnuOBSIN)
<span style="color: #afd8af;">CASE</span> <span style="color: #ff69b4;">siz</span>[0] OF
  1: BEGIN
    Nx = 1
    Ny = 1
    Nobs = siz[1]
  END
  2: BEGIN
    Nx = siz[1] 
    Ny = 1
    Nobs = siz[2]
  END
  3: BEGIN
    Nx = siz[1] 
    Ny = siz[2] 
    Nobs = siz[3]
  END
ENDCASE
IF (Nobs <span style="color: #afd8af;">NE</span> <span style="color: #ff1493;">N_ELEMENTS</span>(<span style="color: #afd8af;">wavobs</span>)) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
  <span style="color: #ff69b4;">PRINT</span>, <span style="color: #61CE3C;">"!!! MILES: WAVOBS and FNUOBS have incompatible sizes..."</span>
  RETURN
ENDIF
Fnuobs = REFORM(FnuobsIN,Nx,Ny,Nobs)
dFnuobs = REFORM(dFnuobsIN,Nx,Ny,Nobs)
IF (<span style="color: #afd8af;">NOT</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">maskIN</span>)) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
  <span style="color: #ff69b4;">mask</span> = BYTARR(Nx,Ny)
  wh0 = WHERE(TOTAL(Fnuobs,3) EQ 0.D OR FINITE(TOTAL(Fnuobs,3)) EQ 0,N0)
  IF (<span style="color: #afd8af;">N0</span> <span style="color: #ff69b4;">GT</span> 0) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">mask</span>[wh0] = 1
ENDIF ELSE mask = REFORM(maskIN,Nx,Ny)

;; Chi square <span style="color: #afd8af;">weighting</span>
<span style="color: #ff1493;">IF</span> (<span style="color: #afd8af;">NOT</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">weightsIN</span>)) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">weights</span> = 1/dFnuobs^2 $
                                ELSE weights = REFORM(weightsIN,Nx,Ny,Nobs)

;; <span style="color: #afd8af;">Instrument</span>
<span style="color: #ff1493;">IF</span> (<span style="color: #afd8af;">NOT</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">instrumentIN</span>)) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">instrument</span> = REPLICATE(<span style="color: #61CE3C;">""</span>,Nobs) $
  ELSE IF (N_ELEMENTS(instrument) <span style="color: #afd8af;">EQ</span> <span style="color: #ff69b4;">Nobs</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">instrument</span> = instrumentIN $
          ELSE instrument = REPLICATE(instrumentIN[0],Nobs)

;; EPS files
<span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">filepsIN</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
  <span style="color: #ff1493;">IF</span> (N_ELEMENTS(<span style="color: #afd8af;">filepsIN</span>) EQ 1) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #ff69b4;">filepsrad</span> = STRREPLACE(filepsIN,[<span style="color: #61CE3C;">".eps"</span>],[<span style="color: #61CE3C;">""</span>])
    IF (<span style="color: #afd8af;">Ny</span> <span style="color: #ff69b4;">EQ</span> 1) THEN $
      IF (<span style="color: #afd8af;">Nx</span> <span style="color: #ff69b4;">EQ</span> 1) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">fileps</span> = filepsrad+<span style="color: #61CE3C;">".eps"</span> $
                   ELSE fileps = filepsrad+<span style="color: #61CE3C;">"_"</span>+PRING(INDGEN(Nx)+1)+<span style="color: #61CE3C;">".eps"</span> $
    ELSE BEGIN
      fileps = STRARR(Nx,Ny)
      <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">x</span>=0,<span style="color: #ff69b4;">Nx</span>-1 DO $
        fileps[x,*] = filepsrad+<span style="color: #61CE3C;">"_"</span>+PRING(x+1)+<span style="color: #61CE3C;">"_"</span>+PRING(INDGEN(Ny)+1)+<span style="color: #61CE3C;">".eps"</span>
    ENDELSE
  ENDIF ELSE fileps = filepsIN
ENDIF ELSE fileps = 0


;; Fit <span style="color: #afd8af;">control</span> <span style="color: #ff69b4;">parameters</span>
;;-----------------------
;; Tolerance, iteration, <span style="color: #afd8af;">printing</span>
<span style="color: #ff1493;">IF</span> (<span style="color: #afd8af;">NOT</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">milliIN</span>)) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">milli</span> = 0 ELSE milli = milliIN
IF (<span style="color: #afd8af;">NOT</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">titleIN</span>)) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">title</span> = <span style="color: #61CE3C;">""</span> ELSE title = titleIN+<span style="color: #61CE3C;">" "</span>
IF (<span style="color: #afd8af;">NOT</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">noplotIN</span>)) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">noplot</span> = 0 ELSE noplot = noplotIN
IF (<span style="color: #afd8af;">NOT</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">logplotIN</span>)) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">logplot</span> = 0 ELSE logplot = logplotIN
IF (<span style="color: #afd8af;">NOT</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">quietIN</span>)) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">quiet</span> = 0 ELSE quiet = quietIN
IF (<span style="color: #afd8af;">NOT</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">ftolIN</span>)) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">ftol</span> = 1.D-10 ELSE ftol = ftolIN
IF (<span style="color: #afd8af;">NOT</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">NiterIN</span>)) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">Niter</span> = 250 ELSE Niter = NiterIN
IF (<span style="color: #afd8af;">NOT</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">restartIN</span>)) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">restart</span> = 0 ELSE restart = restartIN
IF (<span style="color: #afd8af;">NOT</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">hiresIN</span>)) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">hires</span> = 0 ELSE hires = hiresIN

;; <span style="color: #afd8af;">Banner</span>
<span style="color: #ff1493;">IF</span> (<span style="color: #afd8af;">quiet</span> <span style="color: #ff69b4;">LE</span> 2) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
  <span style="color: #ff69b4;">PRINT</span>, <span style="color: #ff69b4;">banner</span>
ENDIF
</pre>
</div>
</div>
</div>
