MILES/arx/miles.org
** Spectral Feature Properties and Templates
*** Model wavelength grid
#+BEGIN_SRC idl
  IF (NOT KEYWORD_SET(hiresIN)) THEN BEGIN
    wmod = wavOBS
    Nwmod = Nobs
  ENDIF ELSE BEGIN
    Nmin = 10 ;; minimum number of wavelengths
    Nw_mic = 100 ;; number of wavelengths per micron
    N_mic = ranw[1]-ranw[0] ;; number of microns
    Nwmod = MAXI(ROUND(Nw_mic*N_mic),Nmin)
    wmod = [RAMP(Nwmod,ranw[0],ranw[1]),wavOBS]
    ;; Reorder and remove duplicates
    wmod = wmod[UNIQ(wmod)]
    wmod = wmod[SORT(wmod)]
    Nwmod = N_ELEMENTS(wmod)
  ENDELSE
  numod = !MKS.clight/!MKS.micron/wmod
  
  ;; Average interval between two consecutive wavelengths
  dwOBS = (MAX(wavOBS)-MIN(wavOBS)) / Nobs
#+END_SRC
*** 1) Grain continuum
#+BEGIN_SRC idl
  contstr = {type:"crb", T:50.D, Tmin:10.D, Tmax:3000.D, $
             Mfixed:0, Tfixed:0, Fnu0:DBLARR(Nwmod)}
  IF KEYWORD_SET(BBtypeIN) THEN BEGIN

    ;; Dust composition
    BBtype = BBtypeIN  
    IF (PRING(BBtypeIN[0]) EQ '1') THEN $
      BBtype = ["crb","crb","sil_norm","al2o3_koike"]
    Nbb = N_ELEMENTS(BBtype)
    cont = REPLICATE(contstr,Nbb)
    cont.type = BBtype
    Qabs_str = MAKE_QABS(wmod,TYPE=cont.type)

    ;; Initial temperatures
    IF KEYWORD_SET(tempBBIN) THEN BEGIN
      IF (N_ELEMENTS(tempBBIN) NE Nbb) THEN BEGIN
        PRINT, "!!! MILES: wrong TEMPBB keyword..."
        RETURN
      ENDIF ELSE cont.T = tempBBIN
    ENDIF ELSE BEGIN
      IF (PRING(BBtypeIN[0]) EQ '1') THEN BEGIN
        cont.T = [300.D,80.D,150.D,180.D]
      ENDIF ELSE cont.T = 40.D + DINDGEN(Nbb)*30.D
    ENDELSE

    ;; Temperature variation
    IF KEYWORD_SET(fixtempBBIN) THEN BEGIN
      CASE N_ELEMENTS(fixtempBBIN) OF
        1: cont.Tfixed = REPLICATE(fixtempBBIN,Nbb)
        Nbb: cont.Tfixed = fixtempBBIN
        ELSE: BEGIN
          PRINT, "!!! MILES: wrong FIXTEMPBB keyword..."
          RETURN
        END
      ENDCASE
    ENDIF
    
    ;; Minimum temperature
    IF KEYWORD_SET(TminBBIN) THEN BEGIN
      CASE N_ELEMENTS(TminBBIN) OF
        1: cont.Tmin = REPLICATE(TminBBIN,Nbb)
        Nbb: cont.Tmin = TminBBIN
        ELSE: BEGIN
          PRINT, "!!! MILES: wrong TMINBB keyword..."
          RETURN
        END
      ENDCASE      
    ENDIF

    ;; Maximum temperature
    IF KEYWORD_SET(TmaxBBIN) THEN BEGIN
      CASE N_ELEMENTS(TmaxBBIN) OF
        1: cont.Tmax = REPLICATE(TmaxBBIN,Nbb)
        Nbb: cont.Tmax = TmaxBBIN
        ELSE: BEGIN
          PRINT, "!!! MILES: wrong TMAXBB keyword..."
          RETURN
        END
      ENDCASE      
    ENDIF

    ;; Normalized component
    FOR i=0,Nbb-1 DO cont[i].Fnu0 = MODIFBB(Qabs_str[i],TEMPBB=cont[i].T)
    
  ENDIF ELSE BEGIN

    ;; No continuum
    Nbb = 0 
    BBtype = 0
    cont = 0

  ENDELSE

  ;; Special BB structure
  IF KEYWORD_SET(BB_structIN) THEN BEGIN
    cont = BB_structIN
    Nbb = N_ELEMENTS(cont)
    BBtype = cont.type
    Qabs_str = MAKE_QABS(wmod,TYPE=cont.type)
    FOR i=0,Nbb-1 DO cont[i].Fnu0 = MODIFBB(Qabs_str[i],TEMPBB=cont[i].T)
  ENDIF
#+END_SRC
