MILES/archives/miles.html
<div id="outline-container-org53e7f18" class="outline-3">
<h3 id="org53e7f18"><span class="section-number-3">7.2</span> Spectral Feature Properties and Templates</h3>
<div class="outline-text-3" id="text-7-2">
</div>
<div id="outline-container-orgda02a1b" class="outline-4">
<h4 id="orgda02a1b"><span class="section-number-4">7.2.1</span> Model wavelength grid</h4>
<div class="outline-text-4" id="text-7-2-1">
<div class="org-src-container">
<pre class="src src-idl">IF (<span style="color: #afd8af;">NOT</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">hiresIN</span>)) THEN <span style="color: #afd8af;">BEGIN</span>
  <span style="color: #ff69b4;">wmod</span> = wavOBS
  Nwmod = Nobs
ENDIF ELSE BEGIN
  Nmin = 10 ;; <span style="color: #afd8af;">minimum</span> <span style="color: #ff69b4;">number</span> <span style="color: #4c83ff;">of</span> <span style="color: #afd8af;">wavelengths</span>
  Nw_mic = 100 ;; number <span style="color: #4c83ff;">of</span> <span style="color: #afd8af;">wavelengths</span> per micron
  N_mic = ranw[1]-ranw[0] ;; number <span style="color: #4c83ff;">of</span> <span style="color: #afd8af;">microns</span>
  Nwmod = MAXI(ROUND(Nw_mic*N_mic),Nmin)
  wmod = [RAMP(Nwmod,ranw[0],ranw[1]),wavOBS]
  ;; Reorder and remove <span style="color: #afd8af;">duplicates</span>
  <span style="color: #ff69b4;">wmod</span> = wmod[UNIQ(wmod)]
  wmod = wmod[SORT(wmod)]
  Nwmod = N_ELEMENTS(wmod)
<span style="color: #afd8af;">ENDELSE</span>
<span style="color: #ff69b4;">numod</span> = !MKS.clight/!MKS.micron/wmod

;; Average interval between two consecutive <span style="color: #afd8af;">wavelengths</span>
<span style="color: #ff69b4;">dwOBS</span> = (MAX(wavOBS)-MIN(wavOBS)) / Nobs
</pre>
</div>
</div>
</div>
<div id="outline-container-org7debdf9" class="outline-4">
<h4 id="org7debdf9"><span class="section-number-4">7.2.2</span> 1) Grain continuum</h4>
<div class="outline-text-4" id="text-7-2-2">
<div class="org-src-container">
<pre class="src src-idl">contstr = {type:<span style="color: #61CE3C;">"crb"</span>, T:50.D, Tmin:10.D, Tmax:3000.D, $
           Mfixed:0, Tfixed:0, Fnu0:DBLARR(Nwmod)}
<span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">BBtypeIN</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">BEGIN</span>

  ;; <span style="color: #afd8af;">Dust</span> <span style="color: #4c83ff;">composition</span>
  <span style="color: #96CBFE;">BBtype</span> = BBtypeIN  
  IF (PRING(BBtypeIN[0]) EQ <span style="color: #61CE3C;">'1'</span>) THEN $
    BBtype = [<span style="color: #61CE3C;">"crb"</span>,<span style="color: #61CE3C;">"crb"</span>,<span style="color: #61CE3C;">"sil_norm"</span>,<span style="color: #61CE3C;">"al2o3_koike"</span>]
  Nbb = N_ELEMENTS(BBtype)
  cont = REPLICATE(contstr,Nbb)
  cont.type = BBtype
  Qabs_str = MAKE_QABS(wmod,TYPE=cont.type)

  ;; Initial temperatures
  <span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">tempBBIN</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #ff1493;">IF</span> (N_ELEMENTS(<span style="color: #afd8af;">tempBBIN</span>) <span style="color: #afd8af;">NE</span> <span style="color: #ff69b4;">Nbb</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
      <span style="color: #ff69b4;">PRINT</span>, <span style="color: #61CE3C;">"!!! MILES: wrong TEMPBB keyword..."</span>
      RETURN
    ENDIF ELSE cont.T = tempBBIN
  ENDIF ELSE BEGIN
    IF (PRING(BBtypeIN[0]) EQ <span style="color: #61CE3C;">'1'</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
      <span style="color: #ff69b4;">cont</span>.T = [300.D,80.D,150.D,180.D]
    ENDIF ELSE cont.T = 40.D + DINDGEN(Nbb)*30.D
  ENDELSE

  ;; Temperature variation
  <span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">fixtempBBIN</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #afd8af;">CASE</span> <span style="color: #ff1493;">N_ELEMENTS</span>(<span style="color: #afd8af;">fixtempBBIN</span>) OF
      1: cont.Tfixed = REPLICATE(fixtempBBIN,Nbb)
      Nbb: cont.Tfixed = fixtempBBIN
      ELSE: BEGIN
        PRINT, <span style="color: #61CE3C;">"!!! MILES: wrong FIXTEMPBB keyword..."</span>
        RETURN
      END
    ENDCASE
  ENDIF

  ;; Minimum temperature
  <span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">TminBBIN</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #afd8af;">CASE</span> <span style="color: #ff1493;">N_ELEMENTS</span>(<span style="color: #afd8af;">TminBBIN</span>) OF
      1: cont.Tmin = REPLICATE(TminBBIN,Nbb)
      Nbb: cont.Tmin = TminBBIN
      ELSE: BEGIN
        PRINT, <span style="color: #61CE3C;">"!!! MILES: wrong TMINBB keyword..."</span>
        RETURN
      END
    ENDCASE      
  ENDIF

  ;; Maximum temperature
  <span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">TmaxBBIN</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #afd8af;">CASE</span> <span style="color: #ff1493;">N_ELEMENTS</span>(<span style="color: #afd8af;">TmaxBBIN</span>) OF
      1: cont.Tmax = REPLICATE(TmaxBBIN,Nbb)
      Nbb: cont.Tmax = TmaxBBIN
      ELSE: BEGIN
        PRINT, <span style="color: #61CE3C;">"!!! MILES: wrong TMAXBB keyword..."</span>
        RETURN
      END
    ENDCASE      
  ENDIF

  ;; Normalized <span style="color: #4c83ff;">component</span>
  <span style="color: #afd8af;">FOR</span> <span style="color: #afd8af;">i</span>=0,<span style="color: #afd8af;">Nbb</span>-1 DO cont[i].Fnu0 = MODIFBB(Qabs_str[i],TEMPBB=cont[i].T)

ENDIF <span style="color: #afd8af;">ELSE</span> <span style="color: #ff69b4;">BEGIN</span>

  ;; No <span style="color: #afd8af;">continuum</span>
  <span style="color: #ff69b4;">Nbb</span> = 0 
  BBtype = 0
  cont = 0

ENDELSE

;; Special BB structure
<span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">BB_structIN</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
  <span style="color: #ff69b4;">cont</span> = BB_structIN
  Nbb = N_ELEMENTS(cont)
  BBtype = cont.type
  Qabs_str = MAKE_QABS(wmod,TYPE=cont.type)
  <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">i</span>=0,<span style="color: #ff69b4;">Nbb</span>-1 DO cont[i].Fnu0 = MODIFBB(Qabs_str[i],TEMPBB=cont[i].T)
ENDIF
</pre>
</div>
</div>
</div>
