MILES/arx/miles.org
*** 2) Lines
#+BEGIN_SRC idl
  ;; Bernard-Salas et al. (2001)
  IF KEYWORD_SET(linesIN) THEN BEGIN
  
    lines = REPLICATE( {wave:0.D, label:"", type:"", sigma:0.D, $
                        Ifixed:0, Wfixed:0, Cfixed:0, degpoly:0, $
                        Wlimits:[0.D,0.D], Climits:[0.D,0.D], $
                        Fnu0:DBLARR(Nwmod)}, 51)

    il = 0
    lines[il].wave = 4.052D    &  lines[il].label = "Bra"
      lines[il].type = "Bracket alpha"   &  il += 1
    lines[il].wave = 5.128657D    &  lines[il].label = "HI6-10"
      lines[il].type = "H!E !NI 6-10"   &  il += 1
    lines[il].wave = 5.51116D    &  lines[il].label = "H2S7"
      lines[il].type = "H!D2!N 0-0 S(7)"   &  il += 1
    lines[il].wave = 5.6098D    &  lines[il].label = "MgV"
      lines[il].type = "[Mg!E !NV] 3P!U2!N-3P!U1!N"   &  il += 1
    lines[il].wave = 5.908213D   &  lines[il].label = "Huc"
      lines[il].type = "Humphreys gamma"   &  il += 1
    lines[il].wave = 5.981D   &  lines[il].label = "KIV"
      lines[il].type = "[K!E !NIV]"   &  il += 1
    lines[il].wave = 6.10856D    &  lines[il].label = "H2S6"
      lines[il].type = "H!D2!N 0-0 S(6)"   &  il += 1
    lines[il].wave = 6.709D    &  lines[il].label = "ClV"
      lines[il].type = "[Cl!E !NV] 2P!U0!N-2P!U0!N"   &  il += 1
    lines[il].wave = 6.90952D    &  lines[il].label = "H2S5"
      lines[il].type = "H!D2!N 0-0 S(5)"   &  il += 1
    lines[il].wave = 6.947984D    &  lines[il].label = "HeII1"
      lines[il].type = "HeII 8-9"   &  il += 1
    lines[il].wave = 6.985274D   &  lines[il].label = "ArII"
      lines[il].type = "[Ar!E !NII] 2P!D3/2!N-2P!D1/2!N"   &  il += 1
    lines[il].wave = 7.3178D    &  lines[il].label = "NaIII"
      lines[il].type = "[Na!E !NIII] 2P!U0!N-2P!U0!N"   &  il += 1
    lines[il].wave = 7.459858D   &  lines[il].label = "Pfa"
      lines[il].type = "Pfund alpha"   &  il += 1
    lines[il].wave = 7.502493D   &  lines[il].label = "Hub"
      lines[il].type = "Humphreys beta"  &  il += 1
    lines[il].wave = 7.6524D   &  lines[il].label = "NeVI"
      lines[il].type = "[Ne!E !NVI] 2P!U0!N-2P!U0!N"  &  il += 1
    lines[il].wave = 7.8145D   &  lines[il].label = "FeVII"
      lines[il].type = "[Fe!E !NVII] 3F!U3!N-3F!U4!N"  &  il += 1
    lines[il].wave = 7.90158D   &  lines[il].label = "ArV"
      lines[il].type = "[Ar!E !NV] 3P!U1!N-3P!U2!N"  &  il += 1
    lines[il].wave = 8.02505D    &  lines[il].label = "H2S4"
      lines[il].type = "H!D2!N 0-0 S(4)"  &  il += 1
    lines[il].wave = 8.760064D    &  lines[il].label = "HI7-10"
      lines[il].type = "H!E !NI 7-10"  &  il += 1
    lines[il].wave = 8.99103D    &  lines[il].label = "ArIII1"
      lines[il].type = "[Ar!E !NIII] 3P!D2!N-3P!D1!N"  &  il += 1
    lines[il].wave = 9.042D    &  lines[il].label = "NiVI"
      lines[il].type = "[Ni!E !NVI] 4P!U5/2!N-4F!U5/2!N"  &  il += 1
    lines[il].wave = 9.5267D    &  lines[il].label = "FeVII"
      lines[il].type = "[Fe!E !NVII] 3F!D2!N-3F!D3!N"  &  il += 1
    lines[il].wave = 9.66491D    &  lines[il].label = "H2S3"
      lines[il].type = "H!D2!N 0-0 S(3)"  &  il += 1
    lines[il].wave = 9.713475D    &  lines[il].label = "HeII2"
      lines[il].type = "He!E !NII 9-10"  &  il += 1
    lines[il].wave = 10.3385D    &  lines[il].label = "SiI"
      lines[il].type = "[Si!E !NI] 1P!D1!N-1P!D2!N"  &  il += 1
    lines[il].wave = 10.5105D    &  lines[il].label = "SIV"
      lines[il].type = "[S!E !NIV] 2P!D3/2!N-2P!D1/2!N"  &  il += 1
    lines[il].wave = 12.27861D   &  lines[il].label = "H2S2"
      lines[il].type = "H!D2!N 0-0 S(2)"  &  il += 1
    lines[il].wave = 12.368527D  &  lines[il].label = "Hua"
      lines[il].type = "Humphreys alpha"  &  il += 1
    lines[il].wave = 12.81355D   &  lines[il].label = "NeII"
      lines[il].type = "[Ne!E !NII] 2P!D3/2!N-2P!D1/2!N"  &  il += 1
    lines[il].wave = 13.10219D   &  lines[il].label = "ArV"
      lines[il].type = "[Ar!E !NV] 3P!D0!N-3P!D1!N"  &  il += 1
    lines[il].wave = 13.521D   &  lines[il].label = "MgV"
      lines[il].type = "[Mg!E !NV] 3P!D1!N-3P!D0!N"  &  il += 1
    lines[il].wave = 14.32168D   &  lines[il].label = "NeV1"
      lines[il].type = "[Ne!E !NV] 3P!D1!N-3P!D2!N"  &  il += 1
    lines[il].wave = 15.555D     &  lines[il].label = "NeIII1"
      lines[il].type = "[Ne!E !NIII] 3P!D2!N-3P!D1!N"  &  il += 1
    lines[il].wave = 17.03483D   &  lines[il].label = "H2S1"
      lines[il].type = "H!D2!N 0-0 S(1)"  &  il += 1
    lines[il].wave = 17.608246D   &  lines[il].label = "HI11-18"
      lines[il].type = "H!E !NI 11-18"  &  il += 1
    lines[il].wave = 18.7129D    &  lines[il].label = "SIII1"
      lines[il].type = "[S!E !NIII] 3P!D2!N-3P!D1!N"  &  il += 1
    lines[il].wave = 19.061898D    &  lines[il].label = "HI7-8"
      lines[il].type = "H!E !NI 7-8"  &  il += 1
    lines[il].wave = 21.8291D    &  lines[il].label = "ArIII2"
      lines[il].type = "[Ar!E !NIII] 3P!U1!N-3P!U0!N"  &  il += 1
    lines[il].wave = 24.3175D    &  lines[il].label = "NeV2"
      lines[il].type = "[Ne!E !NV] 3P!U0!N-3P!U1!N"  &  il += 1
    lines[il].wave = 25.8903D    &  lines[il].label = "OIV"
      lines[il].type = "[O!E !NIV] 2P!D3/2!N-2P!D1/2!N"  &  il += 1
    lines[il].wave = 25.9882D    &  lines[il].label = "FeII1"
      lines[il].type = "[Fe!E !NII] 6D!D7/2!N-6D!D9/2!N"
    lines[il].wave = 28.21883D   &  lines[il].label = "H2S0"
      lines[il].type = "H!D2!N 0-0 S(0)"  &  il += 1
    lines[il].wave = 33.4810D    &  lines[il].label = "SIII2"
      lines[il].type = "[S!E !NIII] 3P!D1!N-3P!D0!N"  &  il += 1
    lines[il].wave = 34.8152D    &  lines[il].label = "SiII"
      lines[il].type = "[Si!E !NII] 2P!D3/2!N-2P!D1/2!N"  &  il += 1
    lines[il].wave = 35.3491D    &  lines[il].label = "FeII2"
      lines[il].type = "[Fe!E !NII] 6D!D5/2!N-6D!D7/2!N"  &  il += 1
    lines[il].wave = 36.0135D    &  lines[il].label = "NeIII2"
      lines[il].type = "[Ne!E !NIII] 3P!D1!N-3P!D0!N"  &  il += 1

    ;; Reduce the wavelength range to the observed wavelengths
    lines = lines[WHERE(lines.wave GT MIN(wavOBS) $
                        AND lines.wave LT MAX(wavOBS))]
    Nline = N_ELEMENTS(lines)
    
    ;; Input line list
    IF (PRING(linesIN[0]) NE '1') THEN BEGIN
      Nline = N_ELEMENTS(linesIN)
      whline = INTARR(Nline)
      FOR i=0,Nline-1 DO whline[i] = WHERE(lines.label EQ linesIN[i])
      lines = lines[whline]
    ENDIF ELSE lines = lines[WHERE(lines.wave GT 0.,Nline)]

    ;; Normalised components
    FOR i=0,Nline-1 DO BEGIN
      lines[i].sigma = DEGRADERES(lines[i].wave,dwOBS, $
                         INSTRUMENT=instrument[CLOSEST(wavOBS,lines[i].wave)])
      lines[i].Wlimits = [0.67D,1.5D]*lines[i].sigma
      lines[i].Climits = lines[i].wave + [-0.5,0.5]*dwOBS
      lines[i].Fnu0 = GAUSSLINE(wmod,lines[i].wave,lines[i].sigma)
    ENDFOR

    ;; Constraints
    IF KEYWORD_SET(fixcenterlineIN) THEN BEGIN
      CASE N_ELEMENTS(fixcenterlineIN) OF
        1: lines.Cfixed = REPLICATE(fixcenterlineIN,Nline)
        Nline: lines.Cfixed = fixcenterlineIN
        ELSE: BEGIN
          PRINT, "!!! MILES: wrong FIXCENTERLINE keyword..."
          RETURN
        END
      ENDCASE      
    ENDIF
    IF KEYWORD_SET(fixsigmalineIN) THEN BEGIN
      CASE N_ELEMENTS(fixsigmalineIN) OF
        1: lines.Wfixed = REPLICATE(fixsigmalineIN,Nline)
        Nline: lines.Wfixed = fixsigmalineIN
        ELSE: BEGIN
          PRINT, "!!! MILES: wrong FIXSIGMALINE keyword..."
          RETURN
        END
      ENDCASE
    ENDIF

    ;; First line fit
    IF KEYWORD_SET(line_firstIN) THEN BEGIN
      IF (PRING(line_firstIN[0]) EQ '1') THEN lines.degpoly = 2 ELSE BEGIN
        FOR i=0,Nline-1 DO BEGIN
          wh = WHERE(lines[i].label EQ line_firstIN.label,N)
          IF (N EQ 1) THEN lines[i].degpoly = 2
        ENDFOR
      ENDELSE
    ENDIF

  ENDIF ELSE BEGIN

    Nline = 0
    lines = 0    

  ENDELSE
#+END_SRC
