MILES/archives/miles.html
<div id="outline-container-orgb2f6ffb" class="outline-4">
<h4 id="orgb2f6ffb"><span class="section-number-4">7.2.3</span> 2) Lines</h4>
<div class="outline-text-4" id="text-7-2-3">
<div class="org-src-container">
<pre class="src src-idl">;; Bernard-Salas et al. (2001)
<span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">linesIN</span>) THEN <span style="color: #afd8af;">BEGIN</span>

  <span style="color: #ff69b4;">lines</span> = REPLICATE( {wave:0.D, label:<span style="color: #61CE3C;">""</span>, type:<span style="color: #61CE3C;">""</span>, sigma:0.D, $
                      Ifixed:0, Wfixed:0, Cfixed:0, degpoly:0, $
                      Wlimits:[0.D,0.D], Climits:[0.D,0.D], $
                      Fnu0:DBLARR(Nwmod)}, 51)

  il = 0
  lines[il].wave = 4.052D    &amp;  lines[il].label = <span style="color: #61CE3C;">"Bra"</span>
    lines[il].type = <span style="color: #61CE3C;">"Bracket alpha"</span>   &amp;  il += 1
  lines[il].wave = 5.128657D    &amp;  lines[il].label = <span style="color: #61CE3C;">"HI6-10"</span>
    lines[il].type = <span style="color: #61CE3C;">"H!E !NI 6-10"</span>   &amp;  il += 1
  lines[il].wave = 5.51116D    &amp;  lines[il].label = <span style="color: #61CE3C;">"H2S7"</span>
    lines[il].type = <span style="color: #61CE3C;">"H!D2!N 0-0 S(7)"</span>   &amp;  il += 1
  lines[il].wave = 5.6098D    &amp;  lines[il].label = <span style="color: #61CE3C;">"MgV"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Mg!E !NV] 3P!U2!N-3P!U1!N"</span>   &amp;  il += 1
  lines[il].wave = 5.908213D   &amp;  lines[il].label = <span style="color: #61CE3C;">"Huc"</span>
    lines[il].type = <span style="color: #61CE3C;">"Humphreys gamma"</span>   &amp;  il += 1
  lines[il].wave = 5.981D   &amp;  lines[il].label = <span style="color: #61CE3C;">"KIV"</span>
    lines[il].type = <span style="color: #61CE3C;">"[K!E !NIV]"</span>   &amp;  il += 1
  lines[il].wave = 6.10856D    &amp;  lines[il].label = <span style="color: #61CE3C;">"H2S6"</span>
    lines[il].type = <span style="color: #61CE3C;">"H!D2!N 0-0 S(6)"</span>   &amp;  il += 1
  lines[il].wave = 6.709D    &amp;  lines[il].label = <span style="color: #61CE3C;">"ClV"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Cl!E !NV] 2P!U0!N-2P!U0!N"</span>   &amp;  il += 1
  lines[il].wave = 6.90952D    &amp;  lines[il].label = <span style="color: #61CE3C;">"H2S5"</span>
    lines[il].type = <span style="color: #61CE3C;">"H!D2!N 0-0 S(5)"</span>   &amp;  il += 1
  lines[il].wave = 6.947984D    &amp;  lines[il].label = <span style="color: #61CE3C;">"HeII1"</span>
    lines[il].type = <span style="color: #61CE3C;">"HeII 8-9"</span>   &amp;  il += 1
  lines[il].wave = 6.985274D   &amp;  lines[il].label = <span style="color: #61CE3C;">"ArII"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Ar!E !NII] 2P!D3/2!N-2P!D1/2!N"</span>   &amp;  il += 1
  lines[il].wave = 7.3178D    &amp;  lines[il].label = <span style="color: #61CE3C;">"NaIII"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Na!E !NIII] 2P!U0!N-2P!U0!N"</span>   &amp;  il += 1
  lines[il].wave = 7.459858D   &amp;  lines[il].label = <span style="color: #61CE3C;">"Pfa"</span>
    lines[il].type = <span style="color: #61CE3C;">"Pfund alpha"</span>   &amp;  il += 1
  lines[il].wave = 7.502493D   &amp;  lines[il].label = <span style="color: #61CE3C;">"Hub"</span>
    lines[il].type = <span style="color: #61CE3C;">"Humphreys beta"</span>  &amp;  il += 1
  lines[il].wave = 7.6524D   &amp;  lines[il].label = <span style="color: #61CE3C;">"NeVI"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Ne!E !NVI] 2P!U0!N-2P!U0!N"</span>  &amp;  il += 1
  lines[il].wave = 7.8145D   &amp;  lines[il].label = <span style="color: #61CE3C;">"FeVII"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Fe!E !NVII] 3F!U3!N-3F!U4!N"</span>  &amp;  il += 1
  lines[il].wave = 7.90158D   &amp;  lines[il].label = <span style="color: #61CE3C;">"ArV"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Ar!E !NV] 3P!U1!N-3P!U2!N"</span>  &amp;  il += 1
  lines[il].wave = 8.02505D    &amp;  lines[il].label = <span style="color: #61CE3C;">"H2S4"</span>
    lines[il].type = <span style="color: #61CE3C;">"H!D2!N 0-0 S(4)"</span>  &amp;  il += 1
  lines[il].wave = 8.760064D    &amp;  lines[il].label = <span style="color: #61CE3C;">"HI7-10"</span>
    lines[il].type = <span style="color: #61CE3C;">"H!E !NI 7-10"</span>  &amp;  il += 1
  lines[il].wave = 8.99103D    &amp;  lines[il].label = <span style="color: #61CE3C;">"ArIII1"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Ar!E !NIII] 3P!D2!N-3P!D1!N"</span>  &amp;  il += 1
  lines[il].wave = 9.042D    &amp;  lines[il].label = <span style="color: #61CE3C;">"NiVI"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Ni!E !NVI] 4P!U5/2!N-4F!U5/2!N"</span>  &amp;  il += 1
  lines[il].wave = 9.5267D    &amp;  lines[il].label = <span style="color: #61CE3C;">"FeVII"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Fe!E !NVII] 3F!D2!N-3F!D3!N"</span>  &amp;  il += 1
  lines[il].wave = 9.66491D    &amp;  lines[il].label = <span style="color: #61CE3C;">"H2S3"</span>
    lines[il].type = <span style="color: #61CE3C;">"H!D2!N 0-0 S(3)"</span>  &amp;  il += 1
  lines[il].wave = 9.713475D    &amp;  lines[il].label = <span style="color: #61CE3C;">"HeII2"</span>
    lines[il].type = <span style="color: #61CE3C;">"He!E !NII 9-10"</span>  &amp;  il += 1
  lines[il].wave = 10.3385D    &amp;  lines[il].label = <span style="color: #61CE3C;">"SiI"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Si!E !NI] 1P!D1!N-1P!D2!N"</span>  &amp;  il += 1
  lines[il].wave = 10.5105D    &amp;  lines[il].label = <span style="color: #61CE3C;">"SIV"</span>
    lines[il].type = <span style="color: #61CE3C;">"[S!E !NIV] 2P!D3/2!N-2P!D1/2!N"</span>  &amp;  il += 1
  lines[il].wave = 12.27861D   &amp;  lines[il].label = <span style="color: #61CE3C;">"H2S2"</span>
    lines[il].type = <span style="color: #61CE3C;">"H!D2!N 0-0 S(2)"</span>  &amp;  il += 1
  lines[il].wave = 12.368527D  &amp;  lines[il].label = <span style="color: #61CE3C;">"Hua"</span>
    lines[il].type = <span style="color: #61CE3C;">"Humphreys alpha"</span>  &amp;  il += 1
  lines[il].wave = 12.81355D   &amp;  lines[il].label = <span style="color: #61CE3C;">"NeII"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Ne!E !NII] 2P!D3/2!N-2P!D1/2!N"</span>  &amp;  il += 1
  lines[il].wave = 13.10219D   &amp;  lines[il].label = <span style="color: #61CE3C;">"ArV"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Ar!E !NV] 3P!D0!N-3P!D1!N"</span>  &amp;  il += 1
  lines[il].wave = 13.521D   &amp;  lines[il].label = <span style="color: #61CE3C;">"MgV"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Mg!E !NV] 3P!D1!N-3P!D0!N"</span>  &amp;  il += 1
  lines[il].wave = 14.32168D   &amp;  lines[il].label = <span style="color: #61CE3C;">"NeV1"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Ne!E !NV] 3P!D1!N-3P!D2!N"</span>  &amp;  il += 1
  lines[il].wave = 15.555D     &amp;  lines[il].label = <span style="color: #61CE3C;">"NeIII1"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Ne!E !NIII] 3P!D2!N-3P!D1!N"</span>  &amp;  il += 1
  lines[il].wave = 17.03483D   &amp;  lines[il].label = <span style="color: #61CE3C;">"H2S1"</span>
    lines[il].type = <span style="color: #61CE3C;">"H!D2!N 0-0 S(1)"</span>  &amp;  il += 1
  lines[il].wave = 17.608246D   &amp;  lines[il].label = <span style="color: #61CE3C;">"HI11-18"</span>
    lines[il].type = <span style="color: #61CE3C;">"H!E !NI 11-18"</span>  &amp;  il += 1
  lines[il].wave = 18.7129D    &amp;  lines[il].label = <span style="color: #61CE3C;">"SIII1"</span>
    lines[il].type = <span style="color: #61CE3C;">"[S!E !NIII] 3P!D2!N-3P!D1!N"</span>  &amp;  il += 1
  lines[il].wave = 19.061898D    &amp;  lines[il].label = <span style="color: #61CE3C;">"HI7-8"</span>
    lines[il].type = <span style="color: #61CE3C;">"H!E !NI 7-8"</span>  &amp;  il += 1
  lines[il].wave = 21.8291D    &amp;  lines[il].label = <span style="color: #61CE3C;">"ArIII2"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Ar!E !NIII] 3P!U1!N-3P!U0!N"</span>  &amp;  il += 1
  lines[il].wave = 24.3175D    &amp;  lines[il].label = <span style="color: #61CE3C;">"NeV2"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Ne!E !NV] 3P!U0!N-3P!U1!N"</span>  &amp;  il += 1
  lines[il].wave = 25.8903D    &amp;  lines[il].label = <span style="color: #61CE3C;">"OIV"</span>
    lines[il].type = <span style="color: #61CE3C;">"[O!E !NIV] 2P!D3/2!N-2P!D1/2!N"</span>  &amp;  il += 1
  lines[il].wave = 25.9882D    &amp;  lines[il].label = <span style="color: #61CE3C;">"FeII1"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Fe!E !NII] 6D!D7/2!N-6D!D9/2!N"</span>
  lines[il].wave = 28.21883D   &amp;  lines[il].label = <span style="color: #61CE3C;">"H2S0"</span>
    lines[il].type = <span style="color: #61CE3C;">"H!D2!N 0-0 S(0)"</span>  &amp;  il += 1
  lines[il].wave = 33.4810D    &amp;  lines[il].label = <span style="color: #61CE3C;">"SIII2"</span>
    lines[il].type = <span style="color: #61CE3C;">"[S!E !NIII] 3P!D1!N-3P!D0!N"</span>  &amp;  il += 1
  lines[il].wave = 34.8152D    &amp;  lines[il].label = <span style="color: #61CE3C;">"SiII"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Si!E !NII] 2P!D3/2!N-2P!D1/2!N"</span>  &amp;  il += 1
  lines[il].wave = 35.3491D    &amp;  lines[il].label = <span style="color: #61CE3C;">"FeII2"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Fe!E !NII] 6D!D5/2!N-6D!D7/2!N"</span>  &amp;  il += 1
  lines[il].wave = 36.0135D    &amp;  lines[il].label = <span style="color: #61CE3C;">"NeIII2"</span>
    lines[il].type = <span style="color: #61CE3C;">"[Ne!E !NIII] 3P!D1!N-3P!D0!N"</span>  &amp;  il += 1

  ;; Reduce the wavelength range to the observed <span style="color: #afd8af;">wavelengths</span>
  <span style="color: #ff69b4;">lines</span> = lines[WHERE(lines.wave GT MIN(wavOBS) $
                      AND lines.wave LT MAX(wavOBS))]
  Nline = N_ELEMENTS(lines)

  ;; Input line <span style="color: #afd8af;">list</span>
  <span style="color: #ff1493;">IF</span> (PRING(<span style="color: #afd8af;">linesIN</span>[0]) NE <span style="color: #61CE3C;">'1'</span>) THEN <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #ff69b4;">Nline</span> = N_ELEMENTS(linesIN)
    whline = INTARR(Nline)
    <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">i</span>=0,<span style="color: #ff69b4;">Nline</span>-1 DO whline[i] = WHERE(lines.label EQ linesIN[i])
    lines = lines[whline]
  ENDIF ELSE lines = lines[WHERE(lines.wave GT 0.,Nline)]

  ;; Normalised components
  <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">i</span>=0,<span style="color: #ff69b4;">Nline</span>-1 DO BEGIN
    lines[i].sigma = DEGRADERES(lines[i].wave,dwOBS, $
                       INSTRUMENT=instrument[CLOSEST(wavOBS,lines[i].wave)])
    lines[i].Wlimits = [0.67D,1.5D]*lines[i].sigma
    lines[i].Climits = lines[i].wave + [-0.5,0.5]*dwOBS
    lines[i].Fnu0 = GAUSSLINE(wmod,lines[i].wave,lines[i].sigma)
  ENDFOR

  ;; Constraints
  <span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">fixcenterlineIN</span>) THEN <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #afd8af;">CASE</span> <span style="color: #ff1493;">N_ELEMENTS</span>(<span style="color: #afd8af;">fixcenterlineIN</span>) OF
      1: lines.Cfixed = REPLICATE(fixcenterlineIN,Nline)
      Nline: lines.Cfixed = fixcenterlineIN
      ELSE: BEGIN
        PRINT, <span style="color: #61CE3C;">"!!! MILES: wrong FIXCENTERLINE keyword..."</span>
        RETURN
      END
    ENDCASE      
  ENDIF
  IF KEYWORD_SET(fixsigmalineIN) THEN <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #afd8af;">CASE</span> <span style="color: #ff1493;">N_ELEMENTS</span>(<span style="color: #afd8af;">fixsigmalineIN</span>) OF
      1: lines.Wfixed = REPLICATE(fixsigmalineIN,Nline)
      Nline: lines.Wfixed = fixsigmalineIN
      ELSE: BEGIN
        PRINT, <span style="color: #61CE3C;">"!!! MILES: wrong FIXSIGMALINE keyword..."</span>
        RETURN
      END
    ENDCASE
  ENDIF

  ;; First line fit
  <span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">line_firstIN</span>) THEN <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #ff1493;">IF</span> (PRING(<span style="color: #afd8af;">line_firstIN</span>[0]) EQ <span style="color: #61CE3C;">'1'</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">lines</span>.degpoly = 2 ELSE BEGIN
      FOR i=0,<span style="color: #ff69b4;">Nline</span>-1 DO BEGIN
        wh = WHERE(lines[i].label EQ line_firstIN.label,N)
        IF (<span style="color: #afd8af;">N</span> <span style="color: #ff69b4;">EQ</span> 1) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">lines</span>[i].degpoly = 2
      ENDFOR
    ENDELSE
  ENDIF

ENDIF ELSE BEGIN

  Nline = 0
  lines = 0    

ENDELSE
</pre>
</div>
</div>
</div>
