MILES/arx/miles.org
*** 3) Bands
#+BEGIN_SRC idl
  IF KEYWORD_SET(bandsIN) THEN BEGIN

    ;; The limits are relative Wlimits*sigma
    bands = REPLICATE( {wave:0.D, label:'', type:'', sigmaS:0.D, sigmaL:0.D, $
                        Ifixed:0, Wfixed:0, Cfixed:0, tiesigma:1, $
                        Wlimits:[0.5D,2.D], Climits:[0.D,0.D], $
                        Fnu0:DBLARR(Nwmod)}, 33)

    bands[0].wave = 3.3  & bands[0].label = 'Main 3.3'
      bands[0].sigmaS = 0.04  & bands[0].sigmaL = 0.04
    bands[1].wave = 3.45  & bands[1].label = 'Main 3.4'
      bands[1].sigmaS = 0.04  & bands[1].sigmaL = 0.04
    bands[2].wave = 5.2394667  & bands[2].label = 'Small 5.2'
      bands[2].sigmaS = 0.025218240  & bands[2].sigmaL = 0.058333420
    bands[3].wave = 5.6437461  & bands[3].label = 'Small 5.7 (1)'
      bands[3].sigmaS = 0.040000000  & bands[3].sigmaL = 0.080000000
    bands[4].wave = 5.7490305  & bands[4].label = 'Small 5.7 (2)'
      bands[4].sigmaS = 0.040000000  & bands[4].sigmaL = 0.080000000
    bands[5].wave = 6.0106598  & bands[5].label = 'Small 6.0'
      bands[5].sigmaS = 0.040000000  & bands[5].sigmaL = 0.066646401
    bands[6].wave = 6.2034273  & bands[6].label = 'Main 6.2 (1)'
      bands[6].sigmaS = 0.031300317  & bands[6].sigmaL = 0.060000000
    bands[7].wave = 6.2672596  & bands[7].label = 'Main 6.2 (2)'
      bands[7].sigmaS = 0.036922155  & bands[7].sigmaL = 0.11633640
    bands[8].wave = 6.6273788  & bands[8].label = 'Small 6.6'
      bands[8].sigmaS = 0.12000000  & bands[8].sigmaL = 0.12000000
    bands[9].wave = 6.8548833  & bands[9].label = 'Small 6.8'
      bands[9].sigmaS = 0.080000000  & bands[9].sigmaL = 0.080000000
    bands[10].wave = 7.0791725  & bands[10].label = 'Small 7.1'
      bands[10].sigmaS = 0.080000000  & bands[10].sigmaL = 0.080000000
    bands[11].wave = 7.6000000  & bands[11].label = 'Plateau 7.7'
      bands[11].sigmaS = 0.48000000  & bands[11].sigmaL = 0.50247515
    bands[12].wave = 7.6171123  & bands[12].label = 'Main 7.7 (1)'
      bands[12].sigmaS = 0.11856752  & bands[12].sigmaL = 0.14531480
    bands[13].wave = 7.8704769  & bands[13].label = 'Main 7.7 (2)'
      bands[13].sigmaS = 0.16998357  & bands[13].sigmaL = 0.24523967
    bands[14].wave = 8.3623706  & bands[14].label = 'Small 8.3'
      bands[14].sigmaS = 0.016256724  & bands[14].sigmaL = 0.016256724
    bands[15].wave = 8.6204540  & bands[15].label = 'Main 8.6'
      bands[15].sigmaS = 0.18340577  & bands[15].sigmaL = 0.13337054
    bands[16].wave = 9.5244838  & bands[16].label = 'Small 9.5'
      bands[16].sigmaS = 0.10766965  & bands[16].sigmaL = 0.60000000
    bands[17].wave = 10.707132  & bands[17].label = 'Small 10.7'
      bands[17].sigmaS = 0.10000000  & bands[17].sigmaL = 0.10000000
    bands[18].wave = 11.038349  & bands[18].label = 'Small 11.0'
      bands[18].sigmaS = 0.026989462  & bands[18].sigmaL = 0.073146141
    bands[19].wave = 11.237893  & bands[19].label = 'Main 11.2'
      bands[19].sigmaS = 0.053507232  & bands[19].sigmaL = 0.15254629
    bands[20].wave = 11.400432  & bands[20].label = 'Plateau 11.3'
      bands[20].sigmaS = 0.72000000  & bands[20].sigmaL = 0.63657944
    bands[21].wave = 11.796389  & bands[21].label = 'Small 11.8'
      bands[21].sigmaS = 0.020813349  & bands[21].sigmaL = 0.020813349
    bands[22].wave = 11.949674  & bands[22].label = 'Small 11.9'
      bands[22].sigmaS = 0.080352283  & bands[22].sigmaL = 0.22192473
    bands[23].wave = 12.626842  & bands[23].label = 'Main 12.7 (1)'
      bands[23].sigmaS = 0.20000000  & bands[23].sigmaL = 0.094424464
    bands[24].wave = 12.760273  & bands[24].label = 'Main 12.7 (2)'
      bands[24].sigmaS = 0.080436118  & bands[24].sigmaL = 0.14000000
    bands[25].wave = 13.559342  & bands[25].label = 'Small 13.6'
      bands[25].sigmaS = 0.15954880  & bands[25].sigmaL = 0.16054015
    bands[26].wave = 14.257133  & bands[26].label = 'Small 14.2'
      bands[26].sigmaS = 0.15208135  & bands[26].sigmaL = 0.058951597
    bands[27].wave = 15.893117  & bands[27].label = 'Small 15.6'
      bands[27].sigmaS = 0.17857214  & bands[27].sigmaL = 0.20000000
    bands[28].wave = 16.482868  & bands[28].label = 'Small 16.4'
      bands[28].sigmaS = 0.10000000  & bands[28].sigmaL = 0.058462024
    bands[29].wave = 17.082868  & bands[29].label = 'Plateau 17.0'
      bands[29].sigmaS = 0.49775906  & bands[29].sigmaL = 0.56119197
    bands[30].wave = 17.428485  & bands[30].label = 'Small 17.4'
      bands[30].sigmaS = 0.10000000  & bands[30].sigmaL = 0.10000000
    bands[31].wave = 17.771096  & bands[31].label = 'Small 17.8'
      bands[31].sigmaS = 0.030799172  & bands[31].sigmaL = 0.075249330
    bands[32].wave = 18.925630  & bands[32].label = 'Small 18.9'
      bands[32].sigmaS = 0.034553879  & bands[32].sigmaL = 0.11570587

    ;; Input band list
    IF (PRING(bandsIN[0]) NE '1') THEN BEGIN
      Nband = N_ELEMENTS(bandsIN)
      whband = INTARR(Nband)
      FOR i=0,Nband-1 DO whband[i] = WHERE(bands.label EQ bandsIN[i])
      bands = bands[whband]
    ENDIF ELSE bands = bands[WHERE(bands.wave GT 0.,Nband)]

    ;; Normalised components
    FOR i=0,Nband-1 DO BEGIN
      bands[i].sigmaS += DEGRADERES(bands[i].wave,dwOBS, $
                           INSTRUMENT=instrument[CLOSEST(wavOBS,bands[i].wave)])
      bands[i].sigmaL += DEGRADERES(bands[i].wave,dwOBS, $
                           INSTRUMENT=instrument[CLOSEST(wavOBS,bands[i].wave)])
      bands[i].Climits = bands[i].wave + [-1.,1.]*dwOBS
      bands[i].Fnu0 = LORENTZBAND(wmod,bands[i].wave,bands[i].sigmaS, $
                                  bands[i].sigmaL)
    ENDFOR

    ;; Constraints
    IF KEYWORD_SET(fixcenterbandIN) THEN BEGIN
      CASE N_ELEMENTS(fixcenterbandIN) OF
        1: bands.Cfixed = REPLICATE(fixcenterbandIN,Nband)
        Nband: bands.Cfixed = fixcenterbandIN
        ELSE: BEGIN
          PRINT, "!!! MILES: wrong FIXCENTERBAND keyword..."
          RETURN
        END
      ENDCASE      
    ENDIF
    IF KEYWORD_SET(fixsigmabandIN) THEN BEGIN
      CASE N_ELEMENTS(fixsigmabandIN) OF
        1: bands.Wfixed = REPLICATE(fixsigmabandIN,Nband)
        Nband: bands.Wfixed = fixsigmabandIN
        ELSE: BEGIN
          PRINT, "!!! MILES: wrong FIXSIGMABAND keyword..."
          RETURN
        END
      ENDCASE
    ENDIF
    IF KEYWORD_SET(untieWbandIN) THEN $
      IF (N_ELEMENTS(untieWbandIN) EQ Nband) THEN $
        bands.tiesigma = 1-untieWbandIN ELSE bands.tiesigma = 1-untieWbandIN[0]

    ;; Reduce the wavelength range to the observed wavelengths
    bands = bands[WHERE(bands.wave GT MIN(wavOBS) $
                        AND bands.wave LT MAX(wavOBS))]
    Nband = N_ELEMENTS(bands)
    
  ENDIF ELSE BEGIN

    Nband = 0
    bands = 0

  ENDELSE

  ;; Special band structure
  IF KEYWORD_SET(band_structIN) THEN BEGIN
    bands = band_structIN
    Nband = N_ELEMENTS(bands)
    FOR i=0,Nband-1 DO $
      bands[i].Fnu0 = LORENTZBAND(wmod,bands[i].wave,bands[i].sigmaS, $
                                  bands[i].sigmaL)
  ENDIF
#+END_SRC
