MILES/archives/miles.html
<div id="outline-container-orgc96e852" class="outline-4">
<h4 id="orgc96e852"><span class="section-number-4">7.2.4</span> 3) Bands</h4>
<div class="outline-text-4" id="text-7-2-4">
<div class="org-src-container">
<pre class="src src-idl"><span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">bandsIN</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">BEGIN</span>

  ;; The limits are <span style="color: #afd8af;">relative</span> <span style="color: #ff69b4;">Wlimits</span>*sigma
  bands = REPLICATE( {wave:0.D, label:<span style="color: #61CE3C;">''</span>, type:<span style="color: #61CE3C;">''</span>, sigmaS:0.D, sigmaL:0.D, $
                      Ifixed:0, Wfixed:0, Cfixed:0, tiesigma:1, $
                      Wlimits:[0.5D,2.D], Climits:[0.D,0.D], $
                      Fnu0:DBLARR(Nwmod)}, 33)

  bands[0].wave = 3.3  &amp; bands[0].label = <span style="color: #61CE3C;">'Main 3.3'</span>
    bands[0].sigmaS = 0.04  &amp; bands[0].sigmaL = 0.04
  bands[1].wave = 3.45  &amp; bands[1].label = <span style="color: #61CE3C;">'Main 3.4'</span>
    bands[1].sigmaS = 0.04  &amp; bands[1].sigmaL = 0.04
  bands[2].wave = 5.2394667  &amp; bands[2].label = <span style="color: #61CE3C;">'Small 5.2'</span>
    bands[2].sigmaS = 0.025218240  &amp; bands[2].sigmaL = 0.058333420
  bands[3].wave = 5.6437461  &amp; bands[3].label = <span style="color: #61CE3C;">'Small 5.7 (1)'</span>
    bands[3].sigmaS = 0.040000000  &amp; bands[3].sigmaL = 0.080000000
  bands[4].wave = 5.7490305  &amp; bands[4].label = <span style="color: #61CE3C;">'Small 5.7 (2)'</span>
    bands[4].sigmaS = 0.040000000  &amp; bands[4].sigmaL = 0.080000000
  bands[5].wave = 6.0106598  &amp; bands[5].label = <span style="color: #61CE3C;">'Small 6.0'</span>
    bands[5].sigmaS = 0.040000000  &amp; bands[5].sigmaL = 0.066646401
  bands[6].wave = 6.2034273  &amp; bands[6].label = <span style="color: #61CE3C;">'Main 6.2 (1)'</span>
    bands[6].sigmaS = 0.031300317  &amp; bands[6].sigmaL = 0.060000000
  bands[7].wave = 6.2672596  &amp; bands[7].label = <span style="color: #61CE3C;">'Main 6.2 (2)'</span>
    bands[7].sigmaS = 0.036922155  &amp; bands[7].sigmaL = 0.11633640
  bands[8].wave = 6.6273788  &amp; bands[8].label = <span style="color: #61CE3C;">'Small 6.6'</span>
    bands[8].sigmaS = 0.12000000  &amp; bands[8].sigmaL = 0.12000000
  bands[9].wave = 6.8548833  &amp; bands[9].label = <span style="color: #61CE3C;">'Small 6.8'</span>
    bands[9].sigmaS = 0.080000000  &amp; bands[9].sigmaL = 0.080000000
  bands[10].wave = 7.0791725  &amp; bands[10].label = <span style="color: #61CE3C;">'Small 7.1'</span>
    bands[10].sigmaS = 0.080000000  &amp; bands[10].sigmaL = 0.080000000
  bands[11].wave = 7.6000000  &amp; bands[11].label = <span style="color: #61CE3C;">'Plateau 7.7'</span>
    bands[11].sigmaS = 0.48000000  &amp; bands[11].sigmaL = 0.50247515
  bands[12].wave = 7.6171123  &amp; bands[12].label = <span style="color: #61CE3C;">'Main 7.7 (1)'</span>
    bands[12].sigmaS = 0.11856752  &amp; bands[12].sigmaL = 0.14531480
  bands[13].wave = 7.8704769  &amp; bands[13].label = <span style="color: #61CE3C;">'Main 7.7 (2)'</span>
    bands[13].sigmaS = 0.16998357  &amp; bands[13].sigmaL = 0.24523967
  bands[14].wave = 8.3623706  &amp; bands[14].label = <span style="color: #61CE3C;">'Small 8.3'</span>
    bands[14].sigmaS = 0.016256724  &amp; bands[14].sigmaL = 0.016256724
  bands[15].wave = 8.6204540  &amp; bands[15].label = <span style="color: #61CE3C;">'Main 8.6'</span>
    bands[15].sigmaS = 0.18340577  &amp; bands[15].sigmaL = 0.13337054
  bands[16].wave = 9.5244838  &amp; bands[16].label = <span style="color: #61CE3C;">'Small 9.5'</span>
    bands[16].sigmaS = 0.10766965  &amp; bands[16].sigmaL = 0.60000000
  bands[17].wave = 10.707132  &amp; bands[17].label = <span style="color: #61CE3C;">'Small 10.7'</span>
    bands[17].sigmaS = 0.10000000  &amp; bands[17].sigmaL = 0.10000000
  bands[18].wave = 11.038349  &amp; bands[18].label = <span style="color: #61CE3C;">'Small 11.0'</span>
    bands[18].sigmaS = 0.026989462  &amp; bands[18].sigmaL = 0.073146141
  bands[19].wave = 11.237893  &amp; bands[19].label = <span style="color: #61CE3C;">'Main 11.2'</span>
    bands[19].sigmaS = 0.053507232  &amp; bands[19].sigmaL = 0.15254629
  bands[20].wave = 11.400432  &amp; bands[20].label = <span style="color: #61CE3C;">'Plateau 11.3'</span>
    bands[20].sigmaS = 0.72000000  &amp; bands[20].sigmaL = 0.63657944
  bands[21].wave = 11.796389  &amp; bands[21].label = <span style="color: #61CE3C;">'Small 11.8'</span>
    bands[21].sigmaS = 0.020813349  &amp; bands[21].sigmaL = 0.020813349
  bands[22].wave = 11.949674  &amp; bands[22].label = <span style="color: #61CE3C;">'Small 11.9'</span>
    bands[22].sigmaS = 0.080352283  &amp; bands[22].sigmaL = 0.22192473
  bands[23].wave = 12.626842  &amp; bands[23].label = <span style="color: #61CE3C;">'Main 12.7 (1)'</span>
    bands[23].sigmaS = 0.20000000  &amp; bands[23].sigmaL = 0.094424464
  bands[24].wave = 12.760273  &amp; bands[24].label = <span style="color: #61CE3C;">'Main 12.7 (2)'</span>
    bands[24].sigmaS = 0.080436118  &amp; bands[24].sigmaL = 0.14000000
  bands[25].wave = 13.559342  &amp; bands[25].label = <span style="color: #61CE3C;">'Small 13.6'</span>
    bands[25].sigmaS = 0.15954880  &amp; bands[25].sigmaL = 0.16054015
  bands[26].wave = 14.257133  &amp; bands[26].label = <span style="color: #61CE3C;">'Small 14.2'</span>
    bands[26].sigmaS = 0.15208135  &amp; bands[26].sigmaL = 0.058951597
  bands[27].wave = 15.893117  &amp; bands[27].label = <span style="color: #61CE3C;">'Small 15.6'</span>
    bands[27].sigmaS = 0.17857214  &amp; bands[27].sigmaL = 0.20000000
  bands[28].wave = 16.482868  &amp; bands[28].label = <span style="color: #61CE3C;">'Small 16.4'</span>
    bands[28].sigmaS = 0.10000000  &amp; bands[28].sigmaL = 0.058462024
  bands[29].wave = 17.082868  &amp; bands[29].label = <span style="color: #61CE3C;">'Plateau 17.0'</span>
    bands[29].sigmaS = 0.49775906  &amp; bands[29].sigmaL = 0.56119197
  bands[30].wave = 17.428485  &amp; bands[30].label = <span style="color: #61CE3C;">'Small 17.4'</span>
    bands[30].sigmaS = 0.10000000  &amp; bands[30].sigmaL = 0.10000000
  bands[31].wave = 17.771096  &amp; bands[31].label = <span style="color: #61CE3C;">'Small 17.8'</span>
    bands[31].sigmaS = 0.030799172  &amp; bands[31].sigmaL = 0.075249330
  bands[32].wave = 18.925630  &amp; bands[32].label = <span style="color: #61CE3C;">'Small 18.9'</span>
    bands[32].sigmaS = 0.034553879  &amp; bands[32].sigmaL = 0.11570587

  ;; Input band <span style="color: #afd8af;">list</span>
  <span style="color: #ff1493;">IF</span> (PRING(<span style="color: #afd8af;">bandsIN</span>[0]) NE <span style="color: #61CE3C;">'1'</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #ff69b4;">Nband</span> = N_ELEMENTS(bandsIN)
    whband = INTARR(Nband)
    <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">i</span>=0,<span style="color: #ff69b4;">Nband</span>-1 DO whband[i] = WHERE(bands.label EQ bandsIN[i])
    bands = bands[whband]
  ENDIF ELSE bands = bands[WHERE(bands.wave GT 0.,Nband)]

  ;; Normalised components
  <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">i</span>=0,<span style="color: #ff69b4;">Nband</span>-1 DO BEGIN
    bands[i].sigmaS += DEGRADERES(bands[i].wave,dwOBS, $
                         INSTRUMENT=instrument[CLOSEST(wavOBS,bands[i].wave)])
    bands[i].sigmaL += DEGRADERES(bands[i].wave,dwOBS, $
                         INSTRUMENT=instrument[CLOSEST(wavOBS,bands[i].wave)])
    bands[i].Climits = bands[i].wave + [-1.,1.]*dwOBS
    bands[i].Fnu0 = LORENTZBAND(wmod,bands[i].wave,bands[i].sigmaS, $
                                bands[i].sigmaL)
  ENDFOR

  ;; Constraints
  <span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">fixcenterbandIN</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #afd8af;">CASE</span> <span style="color: #ff1493;">N_ELEMENTS</span>(<span style="color: #afd8af;">fixcenterbandIN</span>) OF
      1: bands.Cfixed = REPLICATE(fixcenterbandIN,Nband)
      Nband: bands.Cfixed = fixcenterbandIN
      ELSE: BEGIN
        PRINT, <span style="color: #61CE3C;">"!!! MILES: wrong FIXCENTERBAND keyword..."</span>
        RETURN
      END
    ENDCASE      
  ENDIF
  IF KEYWORD_SET(fixsigmabandIN) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #afd8af;">CASE</span> <span style="color: #ff1493;">N_ELEMENTS</span>(<span style="color: #afd8af;">fixsigmabandIN</span>) OF
      1: bands.Wfixed = REPLICATE(fixsigmabandIN,Nband)
      Nband: bands.Wfixed = fixsigmabandIN
      ELSE: BEGIN
        PRINT, <span style="color: #61CE3C;">"!!! MILES: wrong FIXSIGMABAND keyword..."</span>
        RETURN
      END
    ENDCASE
  ENDIF
  IF KEYWORD_SET(untieWbandIN) THEN $
    IF (N_ELEMENTS(untieWbandIN) <span style="color: #afd8af;">EQ</span> <span style="color: #ff69b4;">Nband</span>) THEN $
      bands.tiesigma = 1-untieWbandIN ELSE bands.tiesigma = 1-untieWbandIN[0]

  ;; Reduce the wavelength range to the observed <span style="color: #afd8af;">wavelengths</span>
  <span style="color: #ff69b4;">bands</span> = bands[WHERE(bands.wave GT MIN(wavOBS) $
                      AND bands.wave LT MAX(wavOBS))]
  Nband = N_ELEMENTS(bands)

ENDIF ELSE <span style="color: #afd8af;">BEGIN</span>

  <span style="color: #ff69b4;">Nband</span> = 0
  bands = 0

ENDELSE

;; Special band structure
<span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">band_structIN</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
  <span style="color: #ff69b4;">bands</span> = band_structIN
  Nband = N_ELEMENTS(bands)
  <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">i</span>=0,<span style="color: #ff69b4;">Nband</span>-1 DO $
    bands[i].Fnu0 = LORENTZBAND(wmod,bands[i].wave,bands[i].sigmaS, $
                                bands[i].sigmaL)
ENDIF
</pre>
</div>
</div>
</div>
