MILES/arx/miles.org
*** 4) Stellar ISRF
#+BEGIN_SRC idl
  ;; [Lsun/Hz/Msun]
  IF KEYWORD_SET(old_starIN) THEN BEGIN
    Fnu_star0 = ISRFpegase(wmod,AGE=5.D3,/INTERP,/WAVE,/LNU,/MKS,/NOVERB) $
              / !MKS.Lsun
    Nstar = 1
    IF KEYWORD_SET(fixmassStarIN) THEN fixmassStar = fixmassStarIN $
                                  ELSE fixmassStar = 0
    IF KEYWORD_SET(ranmassStarIN) THEN BEGIN
      ranmassStar = ranmassStarIN
      limitedmassStar = [1,1]
    ENDIF ELSE BEGIN
      ranmassStar = [0.D,0.D]
      limitedmassStar = [1,0]
    ENDELSE
  ENDIF ELSE BEGIN
    Nstar = 0
    Fnu_star0 = 0
  ENDELSE
#+END_SRC
*** 5) Dust and ice extinction
#+BEGIN_SRC idl
  ;; Constraints
  IF KEYWORD_SET(extinctionIN) THEN BEGIN

    NAv = N_ELEMENTS(extinctionIN)

    IF (PRING(extinctionIN[0]) NE '1') THEN BEGIN
      IF KEYWORD_SET(AvIN) THEN Av = AvIN ELSE Av = REPLICATE(1.D,NAv)
      IF KEYWORD_SET(fixAvIN) THEN $
        IF (N_ELEMENTS(fixAvIN) EQ 1) THEN fixAv = REPLICATE(fixAvIN,NAv) $
                                      ELSE fixAv = fixAvIN $
      ELSE fixAv = REPLICATE(0,NAv)
      IF KEYWORD_SET(AvmaxIN) THEN Avmax = AvmaxIN $
                              ELSE Avmax = REPLICATE(100.D,NAv)
      extinction = extinctionIN
    ENDIF ELSE BEGIN
      IF KEYWORD_SET(AvIN) THEN Av = AvIN ELSE Av = 1.D
      IF KEYWORD_SET(fixAvIN) THEN fixAv = fixAvIN ELSE fixAv = 0
      IF KEYWORD_SET(AvmaxIN) THEN Avmax = AvmaxIN ELSE Avmax = 100.D
      extinction = "dust"
    ENDELSE

  ENDIF ELSE BEGIN

    Av = 0.D   &  fixAv = 1         &   Avmax = 0.D 
    NAv = 0    &  extinction = 0

  ENDELSE

  ;; - a) Dust absorption 
  IF (PRING(extinction[0]) NE '0') THEN BEGIN
    extinction[WHERE(extinction EQ "dust")] = "Dudley"
    ext_law = ["Dudley","GC","Mathis","chiar05","chiar05_GC"]
    FOR i=0,NAv-1 DO BEGIN
      IF (WHERE(ext_law EQ extinction[i]) GE 0) THEN BEGIN
        extfile = !IDLFRED+"Dust/Extinction/law_Av_"+extinction[i]+".dat"
        READCOL, extfile, wave_tab, Av_tab
        ;; Normalization to Av=1
        Av_tab = Av_tab / FINTERPOL(Av_tab,wave_tab,!BAND.V,/POW)
        tau_tab = Av_tab / 1.086
        tau_dust = FINTERPOL(tau_tab,wave_tab,wmod)
        wh0 = WHERE(tau_dust LT 0.,N0)
        IF (N0 GT 0) THEN tau_dust[wh0] = 0.
      ENDIF
    ENDFOR
  ENDIF ELSE tau_dust = DBLARR(Nwmod)

  ;; - b) CO2 ice absorption
  IF KEYWORD_SET(TCO2IN) THEN TCO2 = TCO2IN ELSE TCO2 = 75.D ;; K
  RESTORE, !IDLFRED+"Dust/Data/tau_CO2_all.xdr"
  tau_ice = $
    REFORM(tau_CO2[WHERE(fH2O EQ 1. AND fCH3OH EQ 0.),CLOSEST(T_CO2,TCO2),*])
  whIN = WHERE(ISINE(wmod,MINMAX(wave_CO2)) EQ 1,NIN)
  tau_CO2 = DBLARR(Nwmod)
  IF (NIN GT 0) THEN tau_CO2[whIN] = FINTERPOL(tau_ice,wave_CO2,wmod[whIN])

  ;; All the components
  extinctstr = {w_ref: 0.D, type: "", tau0: DBLARR(Nwmod), fixed: 0, $
                temperature: 0.D, tempfixed: 1, Avmax:0.D }
  IF (NAv GT 0) THEN extinct = REPLICATE(extinctstr,NAv) ELSE extinct = 0
  FOR i=0,NAv-1 DO BEGIN
    IF (extinction[i] EQ "CO2") THEN BEGIN
      extinct[i].w_ref = 15.2D
      extinct[i].tau0 = tau_CO2
      extinct[i].temperature = TCO2
      extinct[i].tempfixed = 1
    ENDIF ELSE BEGIN
      extinct[i].w_ref = !BAND.V 
      extinct[i].tau0 = tau_dust
    ENDELSE
    extinct[i].fixed = fixAV[i]
    extinct[i].type = extinction[i]
    extinct[i].Avmax = Avmax[i]
  ENDFOR
#+END_SRC
** Initital Guesses and Parameter Variations
*** Parameters
#+BEGIN_SRC idl
  Nparm = 2*Nbb + 3*Nline + 4*Nband + NAv + Nstar
  parinfo = REPLICATE({fixed:0,limited:[0,0],limits:[0.D,0.D],parname:"", $
                       value:0.D,tied:"",mpprint:1},Nx,Ny,Nparm)


  ;; Output arrays
  parstrOUT = REPLICATE(PARSTRUCT(DBLARR(Nparm),Nbb=Nbb,Nline=Nline, $
                        Nband=Nband,NAv=NAv,Nstar=Nstar),Nx,Ny) 
  errparstrOUT = parstrOUT
  statusOUT = INTARR(Nx,Ny)
  chi2OUT = DBLARR(Nx,Ny)
  timin = DBLARR(Nx,Ny)
  IF KEYWORD_SET(modsaveIN) THEN BEGIN
    Fnu_tot = DBLARR(Nx,Ny,Nwmod)
    IF (Nbb GT 0) THEN Fnu_BB = DBLARR(Nx,Ny,Nbb,Nwmod) $
                  ELSE Fnu_BB = DBLARR(Nx,Ny,1,Nwmod)
    Fnu_Line = DBLARR(Nx,Ny,Nwmod)
    IF (Nband GT 0) THEN Fnu_Band = DBLARR(Nx,Ny,Nband,Nwmod) $
                    ELSE Fnu_Band = DBLARR(Nx,Ny,1,Nwmod)
    Pabs = DBLARR(Nx,Ny,Nwmod)
    Fnu_star = DBLARR(Nx,Ny,Nwmod)
  ENDIF
  fitOUT = 0
#+END_SRC
