MILES/archives/miles.html
<div id="outline-container-org93379e1" class="outline-4">
<h4 id="org93379e1"><span class="section-number-4">7.2.5</span> 4) Stellar ISRF</h4>
<div class="outline-text-4" id="text-7-2-5">
<div class="org-src-container">
<pre class="src src-idl">;; [Lsun/Hz/Msun]
IF KEYWORD_SET(old_starIN) THEN <span style="color: #afd8af;">BEGIN</span>
  <span style="color: #ff69b4;">Fnu_star0</span> = ISRFpegase(wmod,AGE=5.D3,/INTERP,/WAVE,/LNU,/MKS,/NOVERB) $
            / !MKS.Lsun
  Nstar = 1
  IF KEYWORD_SET(fixmassStarIN) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">fixmassStar</span> = fixmassStarIN $
                                ELSE fixmassStar = 0
  IF KEYWORD_SET(ranmassStarIN) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #ff69b4;">ranmassStar</span> = ranmassStarIN
    limitedmassStar = [1,1]
  ENDIF ELSE BEGIN
    ranmassStar = [0.D,0.D]
    limitedmassStar = [1,0]
  ENDELSE
ENDIF ELSE BEGIN
  Nstar = 0
  Fnu_star0 = 0
ENDELSE
</pre>
</div>
</div>
</div>
<div id="outline-container-org656b5a8" class="outline-4">
<h4 id="org656b5a8"><span class="section-number-4">7.2.6</span> 5) Dust and ice extinction</h4>
<div class="outline-text-4" id="text-7-2-6">
<div class="org-src-container">
<pre class="src src-idl">;; Constraints
<span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">extinctionIN</span>) THEN <span style="color: #afd8af;">BEGIN</span>

  <span style="color: #ff69b4;">NAv</span> = N_ELEMENTS(extinctionIN)

  IF (PRING(extinctionIN[0]) NE <span style="color: #61CE3C;">'1'</span>) THEN <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">AvIN</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">Av</span> = AvIN ELSE Av = REPLICATE(1.D,NAv)
    <span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">fixAvIN</span>) THEN $
      IF (N_ELEMENTS(fixAvIN) EQ 1) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">fixAv</span> = REPLICATE(fixAvIN,NAv) $
                                    ELSE fixAv = fixAvIN $
    ELSE fixAv = REPLICATE(0,NAv)
    <span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">AvmaxIN</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">Avmax</span> = AvmaxIN $
                            ELSE Avmax = REPLICATE(100.D,NAv)
    extinction = extinctionIN
  ENDIF ELSE BEGIN
    IF KEYWORD_SET(AvIN) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">Av</span> = AvIN ELSE Av = 1.D
    IF KEYWORD_SET(fixAvIN) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">fixAv</span> = fixAvIN ELSE fixAv = 0
    IF KEYWORD_SET(AvmaxIN) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">Avmax</span> = AvmaxIN ELSE Avmax = 100.D
    extinction = <span style="color: #61CE3C;">"dust"</span>
  ENDELSE

ENDIF ELSE BEGIN

  Av = 0.D   &amp;  fixAv = 1         &amp;   Avmax = 0.D 
  NAv = 0    &amp;  extinction = 0

ENDELSE

;; - a) Dust <span style="color: #afd8af;">absorption</span> 
<span style="color: #ff1493;">IF</span> (PRING(<span style="color: #afd8af;">extinction</span>[0]) NE <span style="color: #61CE3C;">'0'</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
  <span style="color: #ff69b4;">extinction</span>[WHERE(<span style="color: #afd8af;">extinction</span> <span style="color: #ff69b4;">EQ</span> <span style="color: #61CE3C;">"dust"</span>)] = <span style="color: #61CE3C;">"Dudley"</span>
  ext_law = [<span style="color: #61CE3C;">"Dudley"</span>,<span style="color: #61CE3C;">"GC"</span>,<span style="color: #61CE3C;">"Mathis"</span>,<span style="color: #61CE3C;">"chiar05"</span>,<span style="color: #61CE3C;">"chiar05_GC"</span>]
  FOR i=0,<span style="color: #ff1493;">NAv</span>-1 DO BEGIN
    IF (WHERE(ext_law <span style="color: #afd8af;">EQ</span> <span style="color: #ff69b4;">extinction</span>[i]) GE 0) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
      <span style="color: #ff69b4;">extfile</span> = !IDLFRED+<span style="color: #61CE3C;">"Dust/Extinction/law_Av_"</span>+extinction[i]+<span style="color: #61CE3C;">".dat"</span>
      READCOL, <span style="color: #ff69b4;">extfile</span>, <span style="color: #ff69b4;">wave_tab</span>, <span style="color: #ff69b4;">Av_tab</span>
      ;; Normalization <span style="color: #afd8af;">to</span> <span style="color: #ff69b4;">Av</span>=1
      Av_tab = Av_tab / FINTERPOL(Av_tab,wave_tab,!BAND.V,/POW)
      tau_tab = Av_tab / 1.086
      tau_dust = FINTERPOL(tau_tab,wave_tab,wmod)
      wh0 = WHERE(<span style="color: #afd8af;">tau_dust</span> <span style="color: #ff69b4;">LT</span> 0.,N0)
      IF (<span style="color: #afd8af;">N0</span> <span style="color: #ff69b4;">GT</span> 0) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">tau_dust</span>[wh0] = 0.
    ENDIF
  ENDFOR
ENDIF ELSE tau_dust = DBLARR(Nwmod)

;; - b) CO2 ice <span style="color: #afd8af;">absorption</span>
<span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">TCO2IN</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">TCO2</span> = TCO2IN ELSE TCO2 = 75.D ;; <span style="color: #afd8af;">K</span>
<span style="color: #ff69b4;">RESTORE</span>, !IDLFRED+<span style="color: #61CE3C;">"Dust/Data/tau_CO2_all.xdr"</span>
tau_ice = $
  REFORM(tau_CO2[WHERE(<span style="color: #afd8af;">fH2O</span> <span style="color: #ff69b4;">EQ</span> 1. AND fCH3OH EQ 0.),CLOSEST(T_CO2,TCO2),*])
whIN = WHERE(ISINE(wmod,MINMAX(wave_CO2)) EQ 1,NIN)
tau_CO2 = DBLARR(Nwmod)
IF (<span style="color: #afd8af;">NIN</span> <span style="color: #ff69b4;">GT</span> 0) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">tau_CO2</span>[whIN] = FINTERPOL(tau_ice,wave_CO2,wmod[whIN])

;; All the <span style="color: #afd8af;">components</span>
<span style="color: #ff69b4;">extinctstr</span> = {w_ref: 0.D, type: <span style="color: #61CE3C;">""</span>, tau0: DBLARR(Nwmod), <span style="color: #afd8af;">fixed</span>: 0, $
              temperature: 0.D, tempfixed: 1, Avmax:0.D }
IF (<span style="color: #afd8af;">NAv</span> <span style="color: #ff69b4;">GT</span> 0) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">extinct</span> = REPLICATE(extinctstr,NAv) <span style="color: #afd8af;">ELSE</span> <span style="color: #ff69b4;">extinct</span> = 0
FOR i=0,<span style="color: #ff1493;">NAv</span>-1 DO BEGIN
  IF (extinction[i] EQ <span style="color: #61CE3C;">"CO2"</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #ff69b4;">extinct</span>[i].w_ref = 15.2D
    extinct[i].tau0 = tau_CO2
    extinct[i].temperature = TCO2
    extinct[i].tempfixed = 1
  ENDIF ELSE BEGIN
    extinct[i].w_ref = !BAND.V 
    extinct[i].tau0 = tau_dust
  ENDELSE
  extinct[i].<span style="color: #afd8af;">fixed</span> = fixAV[i]
  extinct[i].type = extinction[i]
  extinct[i].Avmax = Avmax[i]
ENDFOR
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org26be6e2" class="outline-3">
<h3 id="org26be6e2"><span class="section-number-3">7.3</span> Initital Guesses and Parameter Variations</h3>
<div class="outline-text-3" id="text-7-3">
</div>
<div id="outline-container-org7f6b196" class="outline-4">
<h4 id="org7f6b196"><span class="section-number-4">7.3.1</span> Parameters</h4>
<div class="outline-text-4" id="text-7-3-1">
<div class="org-src-container">
<pre class="src src-idl">Nparm = 2*Nbb + 3*Nline + 4*Nband + NAv + Nstar
parinfo = REPLICATE({<span style="color: #afd8af;">fixed</span>:0,limited:[0,0],limits:[0.D,0.D],parname:<span style="color: #61CE3C;">""</span>, $
                     value:0.D,tied:<span style="color: #61CE3C;">""</span>,mpprint:1},Nx,Ny,Nparm)


;; Output <span style="color: #afd8af;">arrays</span>
<span style="color: #ff69b4;">parstrOUT</span> = REPLICATE(PARSTRUCT(DBLARR(Nparm),Nbb=Nbb,Nline=Nline, $
                      Nband=Nband,NAv=NAv,Nstar=Nstar),Nx,Ny) 
errparstrOUT = parstrOUT
statusOUT = INTARR(Nx,Ny)
chi2OUT = DBLARR(Nx,Ny)
timin = DBLARR(Nx,Ny)
<span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">modsaveIN</span>) THEN <span style="color: #afd8af;">BEGIN</span>
  <span style="color: #ff69b4;">Fnu_tot</span> = DBLARR(Nx,Ny,Nwmod)
  IF (<span style="color: #afd8af;">Nbb</span> <span style="color: #ff69b4;">GT</span> 0) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">Fnu_BB</span> = DBLARR(Nx,Ny,Nbb,Nwmod) $
                ELSE Fnu_BB = DBLARR(Nx,Ny,1,Nwmod)
  Fnu_Line = DBLARR(Nx,Ny,Nwmod)
  IF (<span style="color: #afd8af;">Nband</span> <span style="color: #ff69b4;">GT</span> 0) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">Fnu_Band</span> = DBLARR(Nx,Ny,Nband,Nwmod) $
                  ELSE Fnu_Band = DBLARR(Nx,Ny,1,Nwmod)
  Pabs = DBLARR(Nx,Ny,Nwmod)
  Fnu_star = DBLARR(Nx,Ny,Nwmod)
<span style="color: #afd8af;">ENDIF</span>
<span style="color: #ff69b4;">fitOUT</span> = 0
</pre>
</div>
</div>
</div>
