MILES/arx/miles.org
*** BIG LOOP
#+BEGIN_SRC idl
FOR x=0,Nx-1 DO BEGIN
FOR y=0,Ny-1 DO BEGIN
IF (mask[x,y] EQ 0) THEN BEGIN
  t1 = SYSTIME(1)

  Fnuobs0 = REFORM(Fnuobs[x,y,*])
  dFnuobs0 = REFORM(dFnuobs[x,y,*])
  weights0 = REFORM(weights[x,y,*])

  IF (quiet LE 2) THEN IF (Nx GT 1) THEN IF (Ny GT 1) THEN $
    PRINT, " - x="+PRING(x+1)+"/"+PRING(Nx)+", y="+PRING(y+1)+"/"+PRING(Ny) $
                                    ELSE PRINT, " - x="+PRING(x+1)+"/"+PRING(Nx)

  ;; Plotting range
  IF KEYWORD_SET(rangefluxIN) THEN ranFnu = rangefluxIN ELSE BEGIN
    wh = WHERE(FnuOBS0-dFnuOBS0 GT 0.,N0)
    IF (N0 GE 10) THEN minOBS = MIN((SMOOTH(FnuOBS0-dFnuOBS0,10))[wh]) $
                  ELSE minOBS = 0.
    maxOBS = ABS(MAX(FnuOBS0+dFnuOBS0))
    IF (minOBS LT 1.D-3*maxOBS) THEN minOBS = 1.D-3*maxOBS
    IF (logplot EQ 0) THEN ranFnu = [0.,1.1*maxOBS] $
                      ELSE ranFnu = [0.5*minOBS,1.1*maxOBS]
  ENDELSE


  ;; Extra parameters
  title_plot = title
  IF (Nx GT 1) THEN $
    IF (Ny GT 1) THEN $
      title_plot += "[x="+PRING(x+1)+"/"+PRING(Nx)+",y=" $
                    +PRING(y+1)+"/"+PRING(Ny)+"]" $
    ELSE title_plot += " [x="+PRING(x+1)+"/"+PRING(Nx)+"]"
#+END_SRC
