MILES/archives/miles.html
<div id="outline-container-org2369724" class="outline-4">
<h4 id="org2369724"><span class="section-number-4">7.3.2</span> BIG LOOP</h4>
<div class="outline-text-4" id="text-7-3-2">
<div class="org-src-container">
<pre class="src src-idl"><span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">x</span>=0,<span style="color: #ff69b4;">Nx</span>-1 DO BEGIN
FOR y=0,<span style="color: #ff1493;">Ny</span>-1 DO BEGIN
IF (mask[x,y] EQ 0) THEN <span style="color: #afd8af;">BEGIN</span>
  <span style="color: #ff69b4;">t1</span> = SYSTIME(1)

  Fnuobs0 = REFORM(Fnuobs[x,y,*])
  dFnuobs0 = REFORM(dFnuobs[x,y,*])
  weights0 = REFORM(weights[x,y,*])

  IF (<span style="color: #afd8af;">quiet</span> <span style="color: #ff69b4;">LE</span> 2) <span style="color: #afd8af;">THEN</span> <span style="color: #ff1493;">IF</span> (<span style="color: #afd8af;">Nx</span> <span style="color: #ff69b4;">GT</span> 1) <span style="color: #afd8af;">THEN</span> <span style="color: #ff1493;">IF</span> (<span style="color: #afd8af;">Ny</span> <span style="color: #ff69b4;">GT</span> 1) THEN $
    PRINT, <span style="color: #61CE3C;">" - x="</span>+PRING(x+1)+<span style="color: #61CE3C;">"/"</span>+PRING(Nx)+<span style="color: #61CE3C;">", y="</span>+PRING(y+1)+<span style="color: #61CE3C;">"/"</span>+PRING(Ny) $
                                    ELSE PRINT, <span style="color: #61CE3C;">" - x="</span>+PRING(x+1)+<span style="color: #61CE3C;">"/"</span>+PRING(Nx)

  ;; Plotting range
  <span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">rangefluxIN</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">ranFnu</span> = rangefluxIN ELSE BEGIN
    wh = WHERE(FnuOBS0-dFnuOBS0 GT 0.,N0)
    IF (<span style="color: #afd8af;">N0</span> <span style="color: #ff69b4;">GE</span> 10) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">minOBS</span> = MIN((SMOOTH(FnuOBS0-dFnuOBS0,10))[wh]) $
                  ELSE minOBS = 0.
    maxOBS = ABS(MAX(FnuOBS0+dFnuOBS0))
    IF (<span style="color: #afd8af;">minOBS</span> <span style="color: #ff69b4;">LT</span> 1.D-3*maxOBS) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">minOBS</span> = 1.D-3*maxOBS
    IF (<span style="color: #afd8af;">logplot</span> <span style="color: #ff69b4;">EQ</span> 0) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">ranFnu</span> = [0.,1.1*maxOBS] $
                      ELSE ranFnu = [0.5*minOBS,1.1*maxOBS]
  ENDELSE


  ;; Extra <span style="color: #afd8af;">parameters</span>
  <span style="color: #ff69b4;">title_plot</span> = title
  IF (<span style="color: #afd8af;">Nx</span> <span style="color: #ff69b4;">GT</span> 1) THEN $
    IF (<span style="color: #afd8af;">Ny</span> <span style="color: #ff69b4;">GT</span> 1) THEN $
      title_plot += <span style="color: #61CE3C;">"[x="</span>+PRING(x+1)+<span style="color: #61CE3C;">"/"</span>+PRING(Nx)+<span style="color: #61CE3C;">",y="</span> $
                    +PRING(y+1)+<span style="color: #61CE3C;">"/"</span>+PRING(Ny)+<span style="color: #61CE3C;">"]"</span> $
    ELSE title_plot += <span style="color: #61CE3C;">" [x="</span>+PRING(x+1)+<span style="color: #61CE3C;">"/"</span>+PRING(Nx)+<span style="color: #61CE3C;">"]"</span>
</pre>
</div>
</div>
</div>
</div>
