MILES/arx/miles.org
** Preliminary Line Fit
#+BEGIN_SRC idl
  IF KEYWORD_SET(line_firstIN) THEN BEGIN
    PRINT, " Preliminary line fit..."
    Iline_first = DBLARR(Nline)
    dIline_first = DBLARR(Nline)
    Cline_first = DBLARR(Nline)
    Wline_first = DBLARR(Nline)
    FOR i=0,Nline-1 DO BEGIN
      IF (lines[i].degpoly GT 0) THEN BEGIN

        ;; Preparation
        ;;------------
        ;; Structure passed by the _EXTRA mechanism
        ranw0 = lines[i].wave + [-6.D,6.D]*lines[i].sigma
        whObs = WHERE(ISINE(wavObs,ranw0),Nobs0)
        whMod = WHERE(ISINE(wmod,ranw0),Nwmod0)
        extra0 = { $
                  ;; Observations
                  Nobs:Nobs0, wavobs:wavobs[whObs], nuobs:nuobs[whObs], $
                  Fnuobs:Fnuobs0[whObs], dFnuobs:dFnuobs0[whObs], $
                  ;; Plot settings
                  title:title_plot+" "+lines[i].label, noplot:noplot, $
                  milli:milli, hires:hires, logplot:logplot, $
                  ;; Fit settings
                  ranw:ranw0, $
                  ;; Fit templates
                  Nw:Nwmod0, w:wmod[whMod], nu:numod[whMod], $
                  center:lines[i].wave } 

        ;; Initial guesses
        Nparm0 = 6
        parm0 = DBLARR(Nparm0)
        parinf0 = REPLICATE(parinfo[0,0,0],Nparm0)
        ;; 1) Lines
        whc = CLOSEST(wavOBS,extra0.center)
        intens = ABS(Fnuobs0[whc])/lines[i].Fnu0[whc] / 2.
        parm0[0:2] = [ intens, lines[i].wave, lines[i].sigma ]
        parinf0[0:2].value = parm0[0:2]
        parinf0[0:2].fixed = [lines[i].Ifixed,lines[i].Cfixed,lines[i].Wfixed]
        parinf0[0].limited = [1,0] 
        parinf0[0].limits = [0.D,0.D]
        parinf0[1].limited = [1,1]
        parinf0[1].limits = lines[i].Climits
        parinf0[2].limited = [1,1]
        parinf0[2].limits = lines[i].Wlimits
        parinf0[0:2].parname = [ "I("+lines[i].label+")", $
                                 "C("+lines[i].label+")", $
                                 "W("+lines[i].label+")" ]
        ;; 2) Grain continuum
        mask0 = (INDGEN(3) LE lines[i].degpoly)
        parm0[3:5] = [ Fnuobs0[whc], 10.D, 10.D ]*mask0
        parinf0[3:5].value = parm0[3:5]
        parinf0[3:5].fixed = 1-mask0
        parinf0[3].limited = [1,0]
        parinf0[3].limits = [0.D,0.D]
        parinf0[3:5].parname = ["a","b","c"]

        ;; Make sure the parameters don't excess the limits
        FOR j=0,Nparm0-1 DO BEGIN
          IF (parinf0[j].fixed EQ 0) THEN BEGIN
            IF (parinf0[j].limited[0] EQ 1 $
                AND parm0[j] LT parinf0[j].limits[0]) THEN BEGIN
              IF (quiet EQ 0) THEN $
                PRINT, "!!! MILES: parameter "+parinf0[j].parname $
                     + " is lower than limit..."
              parm0[j] = parinf0[j].limits[0]
            ENDIF
            IF (parinf0[j].limited[1] EQ 1 $
                AND parm0[j] GT parinf0[j].limits[1]) THEN BEGIN
              IF (quiet EQ 0) THEN $
                PRINT, "!!! MILES: parameter "+parinf0[j].parname $
                     + " is higher than limit..."
              parm0[j] = parinf0[j].limits[1]
            ENDIF
          ENDIF
        ENDFOR

        ;; Printing
        whnoprint = WHERE(parinf0.tied NE "" OR parinf0.fixed EQ 1,Nnoprint)
        IF (Nnoprint GT 0) THEN parinf0[whnoprint].mpprint = 0


        ;; Fit of the lines
        ;;-----------------
        IF (N_ELEMENTS(WHERE(parinf0.fixed EQ 0 $
                             AND parinf0.tied EQ "")) GT Nobs0) THEN BEGIN
          PRINT, "!!! MILES: Number of parameters is higher than number of " $
               + "observations for the separate line fit..."
          RETURN
        ENDIF
        IF (quiet GE 1) THEN quietFIT = 1 ELSE quietFIT = 0

        ;; Actual fit
        weiline = weights0[whObs]
        fit = MPCURVEFIT(extra0.wavObs,extra0.Fnuobs,weiline,parm0, $
                         FUNCTION_NAME="linealone",PARINFO=parinf0, $
                         /NODERIVATIVE,FUNCTARGS=extra0,FTOL=ftol, $
                         XTOL=1.D-50, GTOL=1.D-50,QUIET=quietFIT,COVAR=covar0)

        ;; Error
        sigpar0 = DBLARR(Nparm0)
        FOR j=0,Nparm0-1 DO sigpar0[j] = SQRT(covar0[j,j])

        ;; Final parameters
        Iline_first[i] = parm0[0]
        Cline_first[i] = parm0[1]
        Wline_first[i] = parm0[2]
        dIline_first[i] = sigpar0[0]
        IF (quiet LE 2) THEN $
          PRINT, STRING(lines[i].label,F="(A15)")+"   I="+PRING(Iline_first[i])

        ;; Update the template for the complete fit
        lines[i].Fnu0 = GAUSSLINE(wmod,Cline_first[i],Wline_first[i])

        ;; Save the plot
        IF KEYWORD_SET(coplineIN) THEN BEGIN
          extra0.noplot = 0
          fileps0 = STRREPLACE(fileps[x,y],".eps","_"+lines[i].label+".eps")
          SETPLOT_PS, /TeX, FILE=fileps0, /DEMI
          LINEALONE, extra0.wavObs, parm0, Fnu0, _EXTRA=extra0
          ENDPS, FILE=fileps0, /PDF, NOX=KEYWORD_SET(noX)
        ENDIF

      ENDIF
    ENDFOR
    
    ;; Final template for the line fit
    whtemplate = WHERE(lines.degpoly GT 0,Ntemplate)
    Fnu0_line = DBLARR(Nwmod)
    FOR i=0,Ntemplate-1 DO $
      Fnu0_line += Iline_first[whtemplate[i]]*lines[whtemplate[i]].Fnu0

  ENDIF ELSE Fnu0_line = DBLARR(Nwmod)
#+END_SRC
** Complete Fit
