MILES/archives/miles.html
<div id="outline-container-orga7ff6dc" class="outline-3">
<h3 id="orga7ff6dc"><span class="section-number-3">7.4</span> Preliminary Line Fit</h3>
<div class="outline-text-3" id="text-7-4">
<div class="org-src-container">
<pre class="src src-idl"><span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">line_firstIN</span>) THEN <span style="color: #afd8af;">BEGIN</span>
  <span style="color: #ff69b4;">PRINT</span>, <span style="color: #61CE3C;">" Preliminary line fit..."</span>
  Iline_first = DBLARR(Nline)
  dIline_first = DBLARR(Nline)
  Cline_first = DBLARR(Nline)
  Wline_first = DBLARR(Nline)
  <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">i</span>=0,<span style="color: #ff1493;">Nline</span>-1 DO BEGIN
    IF (lines[i].degpoly GT 0) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">BEGIN</span>

      ;; Preparation
      ;;------------
      ;; Structure passed by the _EXTRA <span style="color: #afd8af;">mechanism</span>
      <span style="color: #ff69b4;">ranw0</span> = lines[i].wave + [-6.D,6.D]*lines[i].sigma
      whObs = WHERE(ISINE(wavObs,ranw0),Nobs0)
      whMod = WHERE(ISINE(wmod,ranw0),Nwmod0)
      extra0 = { $
                ;; Observations
                <span style="color: #afd8af;">Nobs</span>:Nobs0, wavobs:wavobs[whObs], nuobs:nuobs[whObs], $
                Fnuobs:Fnuobs0[whObs], dFnuobs:dFnuobs0[whObs], $
                ;; Plot settings
                <span style="color: #afd8af;">title</span>:title_plot+<span style="color: #61CE3C;">" "</span>+lines[i].label, noplot:noplot, $
                milli:milli, hires:hires, logplot:logplot, $
                ;; Fit settings
                <span style="color: #afd8af;">ranw</span>:ranw0, $
                ;; Fit templates
                <span style="color: #afd8af;">Nw</span>:Nwmod0, w:wmod[whMod], nu:numod[whMod], $
                center:lines[i].wave } 

      ;; Initial <span style="color: #afd8af;">guesses</span>
      <span style="color: #ff69b4;">Nparm0</span> = 6
      parm0 = DBLARR(Nparm0)
      parinf0 = REPLICATE(parinfo[0,0,0],Nparm0)
      ;; 1) <span style="color: #afd8af;">Lines</span>
      <span style="color: #ff69b4;">whc</span> = CLOSEST(wavOBS,extra0.center)
      intens = ABS(Fnuobs0[whc])/lines[i].Fnu0[whc] / 2.
      parm0[0:2] = [ intens, lines[i].wave, lines[i].sigma ]
      parinf0[0:2].value = parm0[0:2]
      parinf0[0:2].<span style="color: #afd8af;">fixed</span> = [lines[i].Ifixed,lines[i].Cfixed,lines[i].Wfixed]
      parinf0[0].limited = [1,0] 
      parinf0[0].limits = [0.D,0.D]
      parinf0[1].limited = [1,1]
      parinf0[1].limits = lines[i].Climits
      parinf0[2].limited = [1,1]
      parinf0[2].limits = lines[i].Wlimits
      parinf0[0:2].parname = [ <span style="color: #61CE3C;">"I("</span>+lines[i].label+<span style="color: #61CE3C;">")"</span>, $
                               <span style="color: #61CE3C;">"C("</span>+lines[i].label+<span style="color: #61CE3C;">")"</span>, $
                               <span style="color: #61CE3C;">"W("</span>+lines[i].label+<span style="color: #61CE3C;">")"</span> ]
      ;; 2) Grain <span style="color: #afd8af;">continuum</span>
      <span style="color: #ff69b4;">mask0</span> = (INDGEN(3) <span style="color: #afd8af;">LE</span> <span style="color: #ff69b4;">lines</span>[i].degpoly)
      parm0[3:5] = [ Fnuobs0[whc], 10.D, 10.D ]*mask0
      parinf0[3:5].value = parm0[3:5]
      parinf0[3:5].<span style="color: #afd8af;">fixed</span> = 1-mask0
      parinf0[3].limited = [1,0]
      parinf0[3].limits = [0.D,0.D]
      parinf0[3:5].parname = [<span style="color: #61CE3C;">"a"</span>,<span style="color: #61CE3C;">"b"</span>,<span style="color: #61CE3C;">"c"</span>]

      ;; Make sure the <span style="color: #afd8af;">parameters</span> <span style="color: #ff69b4;">don</span><span style="color: #ff69b4;">'</span><span style="color: #61CE3C;">t excess the limits</span>
<span style="color: #61CE3C;">      FOR j=0,Nparm0-1 DO BEGIN</span>
<span style="color: #61CE3C;">        IF (parinf0[j].fixed EQ 0) THEN BEGIN</span>
<span style="color: #61CE3C;">          IF (parinf0[j].limited[0] EQ 1 $</span>
<span style="color: #61CE3C;">              AND parm0[j] LT parinf0[j].limits[0]) THEN BEGIN</span>
<span style="color: #61CE3C;">            IF (quiet EQ 0) THEN $</span>
<span style="color: #61CE3C;">              PRINT, "!!! MILES: parameter "+parinf0[j].parname $</span>
<span style="color: #61CE3C;">                   + " is lower than limit..."</span>
<span style="color: #61CE3C;">            parm0[j] = parinf0[j].limits[0]</span>
<span style="color: #61CE3C;">          ENDIF</span>
<span style="color: #61CE3C;">          IF (parinf0[j].limited[1] EQ 1 $</span>
<span style="color: #61CE3C;">              AND parm0[j] GT parinf0[j].limits[1]) THEN BEGIN</span>
<span style="color: #61CE3C;">            IF (quiet EQ 0) THEN $</span>
<span style="color: #61CE3C;">              PRINT, "!!! MILES: parameter "+parinf0[j].parname $</span>
<span style="color: #61CE3C;">                   + " is higher than limit..."</span>
<span style="color: #61CE3C;">            parm0[j] = parinf0[j].limits[1]</span>
<span style="color: #61CE3C;">          ENDIF</span>
<span style="color: #61CE3C;">        ENDIF</span>
<span style="color: #61CE3C;">      ENDFOR</span>

<span style="color: #61CE3C;">      ;; Printing</span>
<span style="color: #61CE3C;">      whnoprint = WHERE(parinf0.tied NE "" OR parinf0.fixed EQ 1,Nnoprint)</span>
<span style="color: #61CE3C;">      IF (Nnoprint GT 0) THEN parinf0[whnoprint].mpprint = 0</span>


<span style="color: #61CE3C;">      ;; Fit of the lines</span>
<span style="color: #61CE3C;">      ;;-----------------</span>
<span style="color: #61CE3C;">      IF (N_ELEMENTS(WHERE(parinf0.fixed EQ 0 $</span>
<span style="color: #61CE3C;">                           AND parinf0.tied EQ "")) GT Nobs0) THEN BEGIN</span>
<span style="color: #61CE3C;">        PRINT, "!!! MILES: Number of parameters is higher than number of " $</span>
<span style="color: #61CE3C;">             + "observations for the separate line fit..."</span>
<span style="color: #61CE3C;">        RETURN</span>
<span style="color: #61CE3C;">      ENDIF</span>
<span style="color: #61CE3C;">      IF (quiet GE 1) THEN quietFIT = 1 ELSE quietFIT = 0</span>

<span style="color: #61CE3C;">      ;; Actual fit</span>
<span style="color: #61CE3C;">      weiline = weights0[whObs]</span>
<span style="color: #61CE3C;">      fit = MPCURVEFIT(extra0.wavObs,extra0.Fnuobs,weiline,parm0, $</span>
<span style="color: #61CE3C;">                       FUNCTION_NAME="linealone",PARINFO=parinf0, $</span>
<span style="color: #61CE3C;">                       /NODERIVATIVE,FUNCTARGS=extra0,FTOL=ftol, $</span>
<span style="color: #61CE3C;">                       XTOL=1.D-50, GTOL=1.D-50,QUIET=quietFIT,COVAR=covar0)</span>

<span style="color: #61CE3C;">      ;; Error</span>
<span style="color: #61CE3C;">      sigpar0 = DBLARR(Nparm0)</span>
<span style="color: #61CE3C;">      FOR j=0,Nparm0-1 DO sigpar0[j] = SQRT(covar0[j,j])</span>

<span style="color: #61CE3C;">      ;; Final parameters</span>
<span style="color: #61CE3C;">      Iline_first[i] = parm0[0]</span>
<span style="color: #61CE3C;">      Cline_first[i] = parm0[1]</span>
<span style="color: #61CE3C;">      Wline_first[i] = parm0[2]</span>
<span style="color: #61CE3C;">      dIline_first[i] = sigpar0[0]</span>
<span style="color: #61CE3C;">      IF (quiet LE 2) THEN $</span>
<span style="color: #61CE3C;">        PRINT, STRING(lines[i].label,F="(A15)")+"   I="+PRING(Iline_first[i])</span>

<span style="color: #61CE3C;">      ;; Update the template for the complete fit</span>
<span style="color: #61CE3C;">      lines[i].Fnu0 = GAUSSLINE(wmod,Cline_first[i],Wline_first[i])</span>

<span style="color: #61CE3C;">      ;; Save the plot</span>
<span style="color: #61CE3C;">      IF KEYWORD_SET(coplineIN) THEN BEGIN</span>
<span style="color: #61CE3C;">        extra0.noplot = 0</span>
<span style="color: #61CE3C;">        fileps0 = STRREPLACE(fileps[x,y],".eps","_"+lines[i].label+".eps")</span>
<span style="color: #61CE3C;">        SETPLOT_PS, /TeX, FILE=fileps0, /DEMI</span>
<span style="color: #61CE3C;">        LINEALONE, extra0.wavObs, parm0, Fnu0, _EXTRA=extra0</span>
<span style="color: #61CE3C;">        ENDPS, FILE=fileps0, /PDF, NOX=KEYWORD_SET(noX)</span>
<span style="color: #61CE3C;">      ENDIF</span>

<span style="color: #61CE3C;">    ENDIF</span>
<span style="color: #61CE3C;">  ENDFOR</span>

<span style="color: #61CE3C;">  ;; Final template for the line fit</span>
<span style="color: #61CE3C;">  whtemplate = WHERE(lines.degpoly GT 0,Ntemplate)</span>
<span style="color: #61CE3C;">  Fnu0_line = DBLARR(Nwmod)</span>
<span style="color: #61CE3C;">  FOR i=0,Ntemplate-1 DO $</span>
<span style="color: #61CE3C;">    Fnu0_line += Iline_first[whtemplate[i]]*lines[whtemplate[i]].Fnu0</span>

<span style="color: #61CE3C;">ENDIF ELSE Fnu0_line = DBLARR(Nwmod)</span>
</pre>
</div>
</div>
</div>
