MILES/arx/miles.org
*** Initialisation
#+BEGIN_SRC idl
  IF KEYWORD_SET(line_firstIN) THEN PRINT, " Complete fit..."
  parm = DBLARR(Nparm)
  ;; 1) Grain continuum
  i0 = 0
  FOR i=0,Nbb-1 DO BEGIN
    whmax = WHERE(cont[i].Fnu0 EQ MAX(cont[i].Fnu0),Nmax)
    mass = ABS(Fnuobs0[whmax])/cont[i].Fnu0[whmax] / 2.
    i1 = 2*i
    i2 = 2*i+1
    parm[i1:i2] = [mass,cont[i].T]
    parinfo[x,y,i1:i2].value = REFORM(parm[i1:i2],1,1,2)
    parinfo[x,y,i1:i2].fixed = REFORM([cont[i].Mfixed,cont[i].Tfixed],1,1,2)
    parinfo[x,y,i1].limited = [1,0] 
    parinfo[x,y,i1].limits = [0.D,0.D]
    parinfo[x,y,i2].limited = [1,1]
    parinfo[x,y,i2].limits = [cont[i].Tmin,cont[i].Tmax]
    parinfo[x,y,i1:i2].parname = $
      REFORM([ "Mass("+BBtype[i]+"["+PRING(i+1)+"])", $
               "Temp("+BBtype[i]+"["+PRING(i+1)+"])" ],1,1,2)
  ENDFOR
  ;; 2) Lines
  i0 += 2*Nbb
  FOR i=0,Nline-1 DO BEGIN
    i1 = i0+3*i
    i2 = i0+3*i+2
    IF (lines[i].degpoly EQ 0) THEN BEGIN
      whc = CLOSEST(wavOBS,lines[i].wave)
      intens = ABS(Fnuobs0[whc])/lines[i].Fnu0[whc] / 2.
      parm[i1:i2] = [ intens, lines[i].wave, lines[i].sigma ]
      parinfo[x,y,i1:i2].fixed = REFORM([lines[i].Ifixed,lines[i].Cfixed, $
                                         lines[i].Wfixed],1,1,3)
      parinfo[x,y,i1].limited = [1,0] 
      parinfo[x,y,i1].limits = [0.D,0.D]
      parinfo[x,y,i1+1].limited = [1,1]
      parinfo[x,y,i1+1].limits = lines[i].Climits
      parinfo[x,y,i1+2].limited = [1,1]
      parinfo[x,y,i1+2].limits = lines[i].Wlimits
    ENDIF ELSE BEGIN
      whc = CLOSEST(wavOBS,lines[i].wave)
      intens = ABS(Fnuobs0[whc])/lines[i].Fnu0[whc] / 2.
      parm[i1:i2] = [ Iline_first[i], Cline_first[i], Wline_first[i] ]
      parinfo[x,y,i1:i2].fixed = REFORM([1,1,1],1,1,3)
    ENDELSE
    parinfo[x,y,i1:i2].value = REFORM(parm[i1:i2],1,1,3)
    parinfo[x,y,i1:i2].parname = REFORM([ "I("+lines[i].label+")", $
                                          "C("+lines[i].label+")", $
                                          "W("+lines[i].label+")" ],1,1,3)
  ENDFOR
  ;; 3) Bands
  i0 += 3*Nline
  FOR i=0,Nband-1 DO BEGIN
    i1 = i0+4*i
    i2 = i0+4*i+3
    whc = CLOSEST(wavOBS,bands[i].wave)
    intens = ABS(Fnuobs0[whc])/bands[i].Fnu0[whc] / 2.
    parm[i1:i2] = REFORM([ intens, bands[i].wave, bands[i].sigmaS, $
                           bands[i].sigmaL ],1,1,4)
    parinfo[x,y,i1:i2].value = REFORM(parm[i1:i2],1,1,4)
    parinfo[x,y,i1:i2].fixed = REFORM([bands[i].Ifixed,bands[i].Cfixed, $
                                       bands[i].Wfixed,bands[i].Wfixed],1,1,4)
    parinfo[x,y,i1].limited = [1,0] 
    parinfo[x,y,i1].limits = [0.D,0.D]
    parinfo[x,y,i1+1].limited = [1,1]
    parinfo[x,y,i1+1].limits = bands[i].Climits
    parinfo[x,y,i1+2].limited = [1,1]
    parinfo[x,y,i1+2].limits = bands[i].Wlimits*bands[i].sigmaS
    parinfo[x,y,i1+3].limited = [1,1]
    parinfo[x,y,i1+3].limits = bands[i].Wlimits*bands[i].sigmaL
    IF (bands[i].tiesigma) THEN BEGIN
      parinfo[x,y,i1+3].tied = PRING(parm[i1+3]/parm[i1+2]) $
                               +"*P["+PRING(i1+2)+"]"
    ENDIF
    parinfo[x,y,i1:i2].parname = REFORM([ "I("+bands[i].label+")", $
                                          "C("+bands[i].label+")", $
                                          "WS("+bands[i].label+")", $
                                          "WL("+bands[i].label+")" ],1,1,4)
  ENDFOR
  ;; 4) Dust extinction
  i0 += 4*Nband
  FOR i=0,NAv-1 DO BEGIN
    i1 = i0+i
    parm[i1] = 1.D
    parinfo[x,y,i1].value = parm[i1]
    parinfo[x,y,i1].fixed = extinct[i].fixed
    parinfo[x,y,i1].limits = [0.D,extinct[i].Avmax]
    parinfo[x,y,i1].limited = [1,1]
    IF (extinct[i].type EQ "CO2") THEN parinfo[x,y,i1].parname = "A(CO2)" $
                                  ELSE parinfo[x,y,i1].parname = "Av(dust)"
  ENDFOR
  ;; 5) Stellar continuum
  i0 += NAv
  IF (Nstar EQ 1) THEN BEGIN
    whmax = WHERE(Fnu_star0 EQ MAX(Fnu_star0),Nmax)
    mass = ABS(Fnuobs0[whmax])/Fnu_star0[whmax] / 2.
    parm[i0] = mass
    parinfo[x,y,i0].value = mass
    parinfo[x,y,i0].fixed = fixmassStar
    parinfo[x,y,i0].limited = limitedmassStar
    parinfo[x,y,i0].limits = ranmassStar
    parinfo[x,y,i0].parname = "Mass(star)"
  ENDIF

  ;; Make sure the parameters don't excess the limits
  FOR i=0,Nparm-1 DO BEGIN
    IF (parinfo[x,y,i].fixed EQ 0) THEN BEGIN
      IF (parinfo[x,y,i].limited[0] EQ 1 $
          AND parm[i] LT parinfo[x,y,i].limits[0]) THEN BEGIN
        IF (quiet EQ 0) THEN $
          PRINT, "!!! MILES: parameter "+parname[i]+" is lower than limit..."
        parm[i] = parinfo[x,y,i].limits[0]
      ENDIF
      IF (parinfo[x,y,i].limited[1] EQ 1 $
          AND parm[i] GT parinfo[x,y,i].limits[1]) THEN BEGIN
        IF (quiet EQ 0) THEN $
          PRINT, "!!! MILES: parameter "+parname[i]+" is higher than limit..."
        parm[i] = parinfo[x,y,i].limits[1]
      ENDIF
    ENDIF
  ENDFOR

  ;; Printing
  parinfo[x,y,WHERE(parinfo[x,y,*].tied NE "" $
                    OR parinfo[x,y,*].fixed EQ 1)].mpprint = 0

  ;; Separate the treatment of the various lines and bands
  IF (Nline GT 0) THEN BEGIN
    ;; - Lines that were computed previously (for the absorption):
    whline1 = WHERE(lines.degpoly GT 0,Nline1,COMP=whline2,NCOMP=Nline2)
    ;; - Lines where the center and the width are fixed and not
    ;;   previously computed:
    whlinefix = WHERE(lines.degpoly EQ 0 AND $
                      lines.Cfixed EQ 1 AND lines.Wfixed EQ 1 $
                      AND lines.degpoly EQ 0,Nlinefix)
    whlinefree = WHERE(lines.degpoly EQ 0 AND $
                       (lines.Cfixed EQ 0 OR lines.Wfixed EQ 0) $
                       AND lines.degpoly EQ 0,Nlinefree)
  ENDIF ELSE BEGIN
    whline1 = 0
    whline2 = 0 
    whlinefix = 0
    whlinefree = 0
    Nline1 = 0
    Nline2 = 0
    Nlinefix = 0
    Nlinefree = 0
  ENDELSE
  ;; - Bands fixed:
  whbandfix = WHERE(bands.Cfixed EQ 1 AND bands.Wfixed EQ 1,Nbandfix, $
                    COMP=whbandfree,NCOMP=Nbandfree)

  ;; Structure passed by the _EXTRA mechanism
  extra = { $
            ;; Observations
            Nobs:Nobs, wavobs:wavobs, nuobs:nuobs, $
            Fnuobs:Fnuobs0, dFnuobs:dFnuobs0, $
            ;; Plot settings
            title:title_plot, noplot:noplot, milli:milli, hires:hires, $
            ranw:ranw, ranFnu:ranFnu, logplot:logplot, $
            ;; Fit settings
            Nbb:Nbb, Nline:Nline, Nband:Nband, NAv:NAv, Nstar:Nstar, $
            ;; Fit templates
            Nw:Nwmod, w:wmod, nu:numod, cont:cont, lines:lines, bands:bands, $
            extinct:extinct, Fnu_star0:Fnu_star0, Qabs:Qabs_str, $
            Nline1:Nline1, whline1:whline1, Nline2:Nline2, whline2:whline2, $
            Nlinefix:Nlinefix, whlinefix:whlinefix, Nlinefree:Nlinefree, $
            whlinefree:whlinefree, Fnu0_line:Fnu0_line, $
            whbandfix:whbandfix, Nbandfix:Nbandfix, whbandfree:whbandfree, $
            Nbandfree:Nbandfree } 
#+END_SRC
