MILES/archives/miles.html
<div id="outline-container-orgd4448c5" class="outline-3">
<h3 id="orgd4448c5"><span class="section-number-3">7.5</span> Complete Fit</h3>
<div class="outline-text-3" id="text-7-5">
</div>
<div id="outline-container-org3d2ffc7" class="outline-4">
<h4 id="org3d2ffc7"><span class="section-number-4">7.5.1</span> Initialisation</h4>
<div class="outline-text-4" id="text-7-5-1">
<div class="org-src-container">
<pre class="src src-idl"><span style="color: #afd8af;">IF</span> <span style="color: #ff1493;">KEYWORD_SET</span>(<span style="color: #afd8af;">line_firstIN</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">PRINT</span>, <span style="color: #61CE3C;">" Complete fit..."</span>
parm = DBLARR(Nparm)
;; 1) Grain <span style="color: #afd8af;">continuum</span>
<span style="color: #ff69b4;">i0</span> = 0
FOR i=0,<span style="color: #ff69b4;">Nbb</span>-1 DO BEGIN
  whmax = WHERE(cont[i].Fnu0 EQ MAX(cont[i].Fnu0),Nmax)
  mass = ABS(Fnuobs0[whmax])/cont[i].Fnu0[whmax] / 2.
  i1 = 2*i
  i2 = 2*i+1
  parm[i1:i2] = [mass,cont[i].T]
  parinfo[x,y,i1:i2].value = REFORM(parm[i1:i2],1,1,2)
  parinfo[x,y,i1:i2].<span style="color: #afd8af;">fixed</span> = REFORM([cont[i].Mfixed,cont[i].Tfixed],1,1,2)
  parinfo[x,y,i1].limited = [1,0] 
  parinfo[x,y,i1].limits = [0.D,0.D]
  parinfo[x,y,i2].limited = [1,1]
  parinfo[x,y,i2].limits = [cont[i].Tmin,cont[i].Tmax]
  parinfo[x,y,i1:i2].parname = $
    REFORM([ <span style="color: #61CE3C;">"Mass("</span>+BBtype[i]+<span style="color: #61CE3C;">"["</span>+PRING(i+1)+<span style="color: #61CE3C;">"])"</span>, $
             <span style="color: #61CE3C;">"Temp("</span>+BBtype[i]+<span style="color: #61CE3C;">"["</span>+PRING(i+1)+<span style="color: #61CE3C;">"])"</span> ],1,1,2)
ENDFOR
;; 2) <span style="color: #afd8af;">Lines</span>
<span style="color: #ff69b4;">i0</span> += 2*Nbb
FOR i=0,<span style="color: #ff69b4;">Nline</span>-1 DO BEGIN
  i1 = i0+3*i
  i2 = i0+3*i+2
  IF (lines[i].degpoly EQ 0) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #ff69b4;">whc</span> = CLOSEST(wavOBS,lines[i].wave)
    intens = ABS(Fnuobs0[whc])/lines[i].Fnu0[whc] / 2.
    parm[i1:i2] = [ intens, lines[i].wave, lines[i].sigma ]
    parinfo[x,y,i1:i2].<span style="color: #afd8af;">fixed</span> = REFORM([lines[i].Ifixed,lines[i].Cfixed, $
                                       lines[i].Wfixed],1,1,3)
    parinfo[x,y,i1].limited = [1,0] 
    parinfo[x,y,i1].limits = [0.D,0.D]
    parinfo[x,y,i1+1].limited = [1,1]
    parinfo[x,y,i1+1].limits = lines[i].Climits
    parinfo[x,y,i1+2].limited = [1,1]
    parinfo[x,y,i1+2].limits = lines[i].Wlimits
  ENDIF ELSE BEGIN
    whc = CLOSEST(wavOBS,lines[i].wave)
    intens = ABS(Fnuobs0[whc])/lines[i].Fnu0[whc] / 2.
    parm[i1:i2] = [ Iline_first[i], Cline_first[i], Wline_first[i] ]
    parinfo[x,y,i1:i2].<span style="color: #afd8af;">fixed</span> = REFORM([1,1,1],1,1,3)
  <span style="color: #afd8af;">ENDELSE</span>
  <span style="color: #ff69b4;">parinfo</span>[x,<span style="color: #afd8af;">y</span>,i1:i2].value = REFORM(parm[i1:i2],1,1,3)
  parinfo[x,y,i1:i2].parname = REFORM([ <span style="color: #61CE3C;">"I("</span>+lines[i].label+<span style="color: #61CE3C;">")"</span>, $
                                        <span style="color: #61CE3C;">"C("</span>+lines[i].label+<span style="color: #61CE3C;">")"</span>, $
                                        <span style="color: #61CE3C;">"W("</span>+lines[i].label+<span style="color: #61CE3C;">")"</span> ],1,1,3)
ENDFOR
;; 3) <span style="color: #afd8af;">Bands</span>
<span style="color: #ff69b4;">i0</span> += 3*Nline
FOR i=0,<span style="color: #ff69b4;">Nband</span>-1 DO BEGIN
  i1 = i0+4*i
  i2 = i0+4*i+3
  whc = CLOSEST(wavOBS,bands[i].wave)
  intens = ABS(Fnuobs0[whc])/bands[i].Fnu0[whc] / 2.
  parm[i1:i2] = REFORM([ intens, bands[i].wave, bands[i].sigmaS, $
                         bands[i].sigmaL ],1,1,4)
  parinfo[x,y,i1:i2].value = REFORM(parm[i1:i2],1,1,4)
  parinfo[x,y,i1:i2].<span style="color: #afd8af;">fixed</span> = REFORM([bands[i].Ifixed,bands[i].Cfixed, $
                                     bands[i].Wfixed,bands[i].Wfixed],1,1,4)
  parinfo[x,y,i1].limited = [1,0] 
  parinfo[x,y,i1].limits = [0.D,0.D]
  parinfo[x,y,i1+1].limited = [1,1]
  parinfo[x,y,i1+1].limits = bands[i].Climits
  parinfo[x,y,i1+2].limited = [1,1]
  parinfo[x,y,i1+2].limits = bands[i].Wlimits*bands[i].sigmaS
  parinfo[x,y,i1+3].limited = [1,1]
  parinfo[x,y,i1+3].limits = bands[i].Wlimits*bands[i].sigmaL
  IF (bands[i].tiesigma) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #ff69b4;">parinfo</span>[x,<span style="color: #afd8af;">y</span>,i1+3].tied = PRING(parm[i1+3]/parm[i1+2]) $
                             +<span style="color: #61CE3C;">"*P["</span>+PRING(i1+2)+<span style="color: #61CE3C;">"]"</span>
  ENDIF
  parinfo[x,y,i1:i2].parname = REFORM([ <span style="color: #61CE3C;">"I("</span>+bands[i].label+<span style="color: #61CE3C;">")"</span>, $
                                        <span style="color: #61CE3C;">"C("</span>+bands[i].label+<span style="color: #61CE3C;">")"</span>, $
                                        <span style="color: #61CE3C;">"WS("</span>+bands[i].label+<span style="color: #61CE3C;">")"</span>, $
                                        <span style="color: #61CE3C;">"WL("</span>+bands[i].label+<span style="color: #61CE3C;">")"</span> ],1,1,4)
ENDFOR
;; 4) Dust <span style="color: #afd8af;">extinction</span>
<span style="color: #ff69b4;">i0</span> += 4*Nband
FOR i=0,<span style="color: #ff69b4;">NAv</span>-1 DO BEGIN
  i1 = i0+i
  parm[i1] = 1.D
  parinfo[x,y,i1].value = parm[i1]
  parinfo[x,y,i1].<span style="color: #afd8af;">fixed</span> = extinct[i].<span style="color: #afd8af;">fixed</span>
  parinfo[x,y,i1].limits = [0.D,extinct[i].Avmax]
  parinfo[x,y,i1].limited = [1,1]
  IF (extinct[i].type EQ <span style="color: #61CE3C;">"CO2"</span>) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">parinfo</span>[x,<span style="color: #afd8af;">y</span>,i1].parname = <span style="color: #61CE3C;">"A(CO2)"</span> $
                                ELSE parinfo[x,y,i1].parname = <span style="color: #61CE3C;">"Av(dust)"</span>
ENDFOR
;; 5) Stellar <span style="color: #afd8af;">continuum</span>
<span style="color: #ff69b4;">i0</span> += NAv
IF (<span style="color: #afd8af;">Nstar</span> <span style="color: #ff69b4;">EQ</span> 1) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
  <span style="color: #ff69b4;">whmax</span> = WHERE(Fnu_star0 <span style="color: #afd8af;">EQ</span> <span style="color: #ff1493;">MAX</span>(<span style="color: #afd8af;">Fnu_star0</span>),Nmax)
  mass = ABS(Fnuobs0[whmax])/Fnu_star0[whmax] / 2.
  parm[i0] = mass
  parinfo[x,y,i0].value = mass
  parinfo[x,y,i0].<span style="color: #afd8af;">fixed</span> = fixmassStar
  parinfo[x,y,i0].limited = limitedmassStar
  parinfo[x,y,i0].limits = ranmassStar
  parinfo[x,y,i0].parname = <span style="color: #61CE3C;">"Mass(star)"</span>
ENDIF

;; Make sure the <span style="color: #afd8af;">parameters</span> <span style="color: #ff69b4;">don</span><span style="color: #ff69b4;">'</span><span style="color: #61CE3C;">t excess the limits</span>
<span style="color: #61CE3C;">FOR i=0,Nparm-1 DO BEGIN</span>
<span style="color: #61CE3C;">  IF (parinfo[x,y,i].fixed EQ 0) THEN BEGIN</span>
<span style="color: #61CE3C;">    IF (parinfo[x,y,i].limited[0] EQ 1 $</span>
<span style="color: #61CE3C;">        AND parm[i] LT parinfo[x,y,i].limits[0]) THEN BEGIN</span>
<span style="color: #61CE3C;">      IF (quiet EQ 0) THEN $</span>
<span style="color: #61CE3C;">        PRINT, "!!! MILES: parameter "+parname[i]+" is lower than limit..."</span>
<span style="color: #61CE3C;">      parm[i] = parinfo[x,y,i].limits[0]</span>
<span style="color: #61CE3C;">    ENDIF</span>
<span style="color: #61CE3C;">    IF (parinfo[x,y,i].limited[1] EQ 1 $</span>
<span style="color: #61CE3C;">        AND parm[i] GT parinfo[x,y,i].limits[1]) THEN BEGIN</span>
<span style="color: #61CE3C;">      IF (quiet EQ 0) THEN $</span>
<span style="color: #61CE3C;">        PRINT, "!!! MILES: parameter "+parname[i]+" is higher than limit..."</span>
<span style="color: #61CE3C;">      parm[i] = parinfo[x,y,i].limits[1]</span>
<span style="color: #61CE3C;">    ENDIF</span>
<span style="color: #61CE3C;">  ENDIF</span>
<span style="color: #61CE3C;">ENDFOR</span>

<span style="color: #61CE3C;">;; Printing</span>
<span style="color: #61CE3C;">parinfo[x,y,WHERE(parinfo[x,y,*].tied NE "" $</span>
<span style="color: #61CE3C;">                  OR parinfo[x,y,*].fixed EQ 1)].mpprint = 0</span>

<span style="color: #61CE3C;">;; Separate the treatment of the various lines and bands</span>
<span style="color: #61CE3C;">IF (Nline GT 0) THEN BEGIN</span>
<span style="color: #61CE3C;">  ;; - Lines that were computed previously (for the absorption):</span>
<span style="color: #61CE3C;">  whline1 = WHERE(lines.degpoly GT 0,Nline1,COMP=whline2,NCOMP=Nline2)</span>
<span style="color: #61CE3C;">  ;; - Lines where the center and the width are fixed and not</span>
<span style="color: #61CE3C;">  ;;   previously computed:</span>
<span style="color: #61CE3C;">  whlinefix = WHERE(lines.degpoly EQ 0 AND $</span>
<span style="color: #61CE3C;">                    lines.Cfixed EQ 1 AND lines.Wfixed EQ 1 $</span>
<span style="color: #61CE3C;">                    AND lines.degpoly EQ 0,Nlinefix)</span>
<span style="color: #61CE3C;">  whlinefree = WHERE(lines.degpoly EQ 0 AND $</span>
<span style="color: #61CE3C;">                     (lines.Cfixed EQ 0 OR lines.Wfixed EQ 0) $</span>
<span style="color: #61CE3C;">                     AND lines.degpoly EQ 0,Nlinefree)</span>
<span style="color: #61CE3C;">ENDIF ELSE BEGIN</span>
<span style="color: #61CE3C;">  whline1 = 0</span>
<span style="color: #61CE3C;">  whline2 = 0 </span>
<span style="color: #61CE3C;">  whlinefix = 0</span>
<span style="color: #61CE3C;">  whlinefree = 0</span>
<span style="color: #61CE3C;">  Nline1 = 0</span>
<span style="color: #61CE3C;">  Nline2 = 0</span>
<span style="color: #61CE3C;">  Nlinefix = 0</span>
<span style="color: #61CE3C;">  Nlinefree = 0</span>
<span style="color: #61CE3C;">ENDELSE</span>
<span style="color: #61CE3C;">;; - Bands fixed:</span>
<span style="color: #61CE3C;">whbandfix = WHERE(bands.Cfixed EQ 1 AND bands.Wfixed EQ 1,Nbandfix, $</span>
<span style="color: #61CE3C;">                  COMP=whbandfree,NCOMP=Nbandfree)</span>

<span style="color: #61CE3C;">;; Structure passed by the _EXTRA mechanism</span>
<span style="color: #61CE3C;">extra = { $</span>
<span style="color: #61CE3C;">          ;; Observations</span>
<span style="color: #61CE3C;">          Nobs:Nobs, wavobs:wavobs, nuobs:nuobs, $</span>
<span style="color: #61CE3C;">          Fnuobs:Fnuobs0, dFnuobs:dFnuobs0, $</span>
<span style="color: #61CE3C;">          ;; Plot settings</span>
<span style="color: #61CE3C;">          title:title_plot, noplot:noplot, milli:milli, hires:hires, $</span>
<span style="color: #61CE3C;">          ranw:ranw, ranFnu:ranFnu, logplot:logplot, $</span>
<span style="color: #61CE3C;">          ;; Fit settings</span>
<span style="color: #61CE3C;">          Nbb:Nbb, Nline:Nline, Nband:Nband, NAv:NAv, Nstar:Nstar, $</span>
<span style="color: #61CE3C;">          ;; Fit templates</span>
<span style="color: #61CE3C;">          Nw:Nwmod, w:wmod, nu:numod, cont:cont, lines:lines, bands:bands, $</span>
<span style="color: #61CE3C;">          extinct:extinct, Fnu_star0:Fnu_star0, Qabs:Qabs_str, $</span>
<span style="color: #61CE3C;">          Nline1:Nline1, whline1:whline1, Nline2:Nline2, whline2:whline2, $</span>
<span style="color: #61CE3C;">          Nlinefix:Nlinefix, whlinefix:whlinefix, Nlinefree:Nlinefree, $</span>
<span style="color: #61CE3C;">          whlinefree:whlinefree, Fnu0_line:Fnu0_line, $</span>
<span style="color: #61CE3C;">          whbandfix:whbandfix, Nbandfix:Nbandfix, whbandfree:whbandfree, $</span>
<span style="color: #61CE3C;">          Nbandfree:Nbandfree } </span>
</pre>
</div>
</div>
</div>
