MILES/arx/miles.org
*** Fit of the SED
#+BEGIN_SRC idl
  IF (N_ELEMENTS(WHERE(parinfo[x,y,*].fixed EQ 0 $
                       AND parinfo[x,y,*].tied EQ "")) GT Nobs) THEN BEGIN
    PRINT, "!!! MILES: Number of parameters is higher than number of " $
         + "observations..."
    RETURN
  ENDIF
  IF (quiet GT 1) THEN quietFIT = 1 ELSE quietFIT = 0
  IF (Niter GT 1) THEN BEGIN
    ;; Actual fit
    fit = MPCURVEFIT( wavobs,Fnuobs0,weights0,parm,$
                  FUNCTION_NAME="specmodel",PARINFO=REFORM(parinfo[x,y,*]), $
                  STATUS=status1D,/NODERIVATIVE,FUNCTARGS=extra,FTOL=ftol, $
                  XTOL=1.D-50, GTOL=1.D-50,QUIET=quietFIT,COVAR=covar, $
                  CHI=chi21D,ITMAX=Niter )

    ;; Iteration 
    IF (restart GE 1) THEN BEGIN
pc
stop
      FOR k=0,restart-1 DO BEGIN
        IF (quiet LE 1) THEN PRINT, " Iteration..."
        parinf = REFORM(parinfo[x,y,*])
        parinf.parname = "Iter "+PRING(k+1)+": "+parinf.parname
        whbad = WHERE(parm LT 1.D-4*parinfo[x,y,*].value $
                      AND STRPOS(parinfo[x,y,*].parname,"I(") EQ 0 $ ;; a modifier !!!
                      AND parinfo[x,y,*].fixed EQ 0,Nbad) ;; a modifier !!!
;; Faire un restart selectif...
       IF (Nbad GT 0) THEN parm[whbad] = parinfo[x,y,whbad].value
       fit = MPCURVEFIT( wavobs,Fnuobs0,weights0, $
                          parm,FUNCTION_NAME="specmodel",PARINFO=parinf, $
                          STATUS=status1D,/NODERIVATIVE,FUNCTARGS=extra, $
                          FTOL=ftol,XTOL=1.D-50,GTOL=1.D-50,QUIET=quietFIT, $
                          COVAR=covar,CHI=chi21D,ITMAX=Niter)
      ENDFOR
    ENDIF
    parstrOUT[x,y] = PARSTRUCT(parm,Nbb=Nbb,Nline=Nline,Nband=Nband,NAv=NAv, $
                               Nstar=Nstar)
    
    ;; Error
    sigpar = DBLARR(Nparm)
    FOR i=0,Nparm-1 DO sigpar[i] = SQRT(covar[i,i])

    ;; Final printing
    timin[x,y] = (SYSTIME(1)-t1)/60.
    IF (quiet LE 2) THEN BEGIN
      FOR i=0,Nparm-1 DO IF (parinfo[x,y,i].mpprint EQ 1) THEN $
        PRINT, STRING(parinfo[x,y,i].parname,"(A20)")+" = ", parm[i], " +- ", $
               sigpar[i]
      PRINT, " - status="+PRING(status1D)+", " $
             +PRING((SYSTIME(1)-t0)/60.,F="(F8.1)")+" minutes elapsed."
    ENDIF

  ENDIF ELSE BEGIN
    
    ;; No fit
    sigpar = DBLARR(Nparm)
    status = -1
    chi2 = 0.D

  ENDELSE
#+END_SRC
*** Outputs
#+BEGIN_SRC idl
  ;; Final parameters
  errparstrOUT[x,y] = PARSTRUCT(sigpar,Nbb=Nbb,Nline=Nline,Nband=Nband, $
                                NAv=NAv,Nstar=Nstar)
  parinfoOUT = parinfo
  statusOUT[x,y] = status1D
  chi2OUT[x,y] = chi21D

  ;; Save the model
  SPECMODEL, wmod, parm, Fnu_tot1D, FNU_BB=Fnu_BB1D, FNU_STAR=Fnu_star1D, $
             FNU_LINE=Fnu_line1D, FNU_BAND=Fnu_band1D, PABS=Pabs1D, $
             _EXTRA=extra
  IF KEYWORD_SET(modsaveIN) THEN BEGIN
    Fnu_tot[x,y,*] = Fnu_tot1D
    Fnu_BB[x,y,*,*] = Fnu_BB1D
    Fnu_line[x,y,*] = Fnu_line1D
    Fnu_band[x,y,*,*] = Fnu_band1D
    Fnu_star[x,y,*] = Fnu_star1D
    Pabs[x,y,*] = Pabs1D
    fitOUT = {Nw:Nwmod, w:wmod, nu:numod, Fnu_tot:REFORM(Fnu_tot), $
              Fnu_BB:Fnu_BB, Fnu_star:Fnu_star, Fnu_line:Fnu_line, $
              Fnu_band:Fnu_band, Pabs:Pabs}
  ENDIF ELSE fitOUT = 0

  ;; Correct for the absorption of the lines that were fitted first
  FOR i=0,Nline1-1 DO BEGIN
    Pabsline = Pabs1D[CLOSEST(wmod,lines[whline1[i]].wave)]
    parstrOUT[x,y].Iline[whline1[i]] /= Pabsline
    errparstrOUT[x,y].Iline[whline1[i]] /= Pabsline
  ENDFOR

  ;; Plottings
  FOR k=(noplot GE 1),KEYWORD_SET(filepsIN) DO BEGIN
    extra.noplot = 0
    IF (k EQ 1) THEN SETPLOT_PS, /TeX, FILE=fileps[x,y]
      SPECMODEL, wmod, parm, Fnu_tot1D, FNU_BB=Fnu_BB1D, FNU_STAR=Fnu_star1D, $
                 FNU_LINE=Fnu_line1D, FNU_BAND=Fnu_band1D, PABS=Pabs1D, $
                 _EXTRA=extra
    IF (k EQ 1) THEN $
      ENDPS, FILE=fileps[x,y], PDF=KEYWORD_SET(pdfIN), EPS=KEYWORD_SET(epsIN), $
             NOX=KEYWORD_SET(noX) 
  ENDFOR

ENDIF
ENDFOR

  ;; Savings (once every column)
  IF (KEYWORD_SET(filexdrIN)) THEN BEGIN
    parstr = REFORM(parstrOUT)
    errparstr = REFORM(errparstrOUT)
    fit = fitOUT
    status = REFORM(statusOUT)
    chi2 = REFORM(chi2OUT)
    SAVE, FILE=filexdrIN, Nx, Ny, Nobs, wavobs, nuobs, Fnuobs, dFnuobs, $
                          weights, mask, parstr, errparstr, parinfo, $
                          status, chi2, fit, instrument, timin, cont, lines, $
                          bands, extinct
    PRINT, " - File "+filexdrIN+" has been written."
  ENDIF 

ENDFOR
;; BIG LOOP

IF (quiet LE 1) THEN PRINT, STRJOIN(REPLICATE("-",80))


END
#+END_SRC
