MILES/archives/miles.html
<div id="outline-container-orgd8ce7fe" class="outline-4">
<h4 id="orgd8ce7fe"><span class="section-number-4">7.5.2</span> Fit of the SED</h4>
<div class="outline-text-4" id="text-7-5-2">
<div class="org-src-container">
<pre class="src src-idl">  IF (N_ELEMENTS(WHERE(parinfo[x,y,*].<span style="color: #afd8af;">fixed</span> EQ 0 $
                       AND parinfo[x,y,*].tied EQ <span style="color: #61CE3C;">""</span>)) <span style="color: #afd8af;">GT</span> <span style="color: #ff69b4;">Nobs</span>) THEN <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #ff69b4;">PRINT</span>, <span style="color: #61CE3C;">"!!! MILES: Number of parameters is higher than number of "</span> $
         + <span style="color: #61CE3C;">"observations..."</span>
    RETURN
  ENDIF
  IF (<span style="color: #afd8af;">quiet</span> <span style="color: #ff69b4;">GT</span> 1) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">quietFIT</span> = 1 ELSE quietFIT = 0
  IF (<span style="color: #afd8af;">Niter</span> <span style="color: #ff69b4;">GT</span> 1) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">BEGIN</span>
    ;; Actual <span style="color: #afd8af;">fit</span>
    <span style="color: #ff69b4;">fit</span> = MPCURVEFIT( wavobs,Fnuobs0,weights0,parm,$
                  FUNCTION_NAME=<span style="color: #61CE3C;">"specmodel"</span>,PARINFO=REFORM(parinfo[x,y,*]), $
                  STATUS=status1D,/NODERIVATIVE,FUNCTARGS=extra,FTOL=ftol, $
                  XTOL=1.D-50, GTOL=1.D-50,QUIET=quietFIT,COVAR=covar, $
                  CHI=chi21D,ITMAX=Niter )

    ;; <span style="color: #afd8af;">Iteration</span> 
    <span style="color: #ff1493;">IF</span> (<span style="color: #afd8af;">restart</span> <span style="color: #ff69b4;">GE</span> 1) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
pc
stop
      <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">k</span>=0,<span style="color: #ff1493;">restart</span>-1 DO BEGIN
        IF (<span style="color: #afd8af;">quiet</span> <span style="color: #ff69b4;">LE</span> 1) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">PRINT</span>, <span style="color: #61CE3C;">" Iteration..."</span>
        parinf = REFORM(parinfo[x,y,*])
        parinf.parname = <span style="color: #61CE3C;">"Iter "</span>+PRING(k+1)+<span style="color: #61CE3C;">": "</span>+parinf.parname
        whbad = WHERE(<span style="color: #afd8af;">parm</span> <span style="color: #ff69b4;">LT</span> 1.D-4*parinfo[x,y,*].value $
                      AND STRPOS(parinfo[x,y,*].parname,<span style="color: #61CE3C;">"I("</span>) EQ 0 $ ;; <span style="color: #afd8af;">a</span> <span style="color: #ff69b4;">modifier</span> !!!
                      AND parinfo[x,y,*].<span style="color: #afd8af;">fixed</span> EQ 0,<span style="color: #ff69b4;">Nbad</span>) ;; <span style="color: #afd8af;">a</span> <span style="color: #ff69b4;">modifier</span> !!!
;; Faire un <span style="color: #afd8af;">restart</span> <span style="color: #ff1493;">selectif</span>...
       IF (<span style="color: #afd8af;">Nbad</span> <span style="color: #ff69b4;">GT</span> 0) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">parm</span>[whbad] = parinfo[x,y,whbad].value
       fit = MPCURVEFIT( wavobs,Fnuobs0,weights0, $
                          parm,FUNCTION_NAME=<span style="color: #61CE3C;">"specmodel"</span>,PARINFO=parinf, $
                          STATUS=status1D,/NODERIVATIVE,FUNCTARGS=extra, $
                          FTOL=ftol,XTOL=1.D-50,GTOL=1.D-50,QUIET=quietFIT, $
                          COVAR=covar,CHI=chi21D,ITMAX=Niter)
      ENDFOR
    <span style="color: #afd8af;">ENDIF</span>
    <span style="color: #ff69b4;">parstrOUT</span>[x,y] = PARSTRUCT(parm,Nbb=Nbb,Nline=Nline,Nband=Nband,NAv=NAv, $
                               Nstar=Nstar)

    ;; <span style="color: #afd8af;">Error</span>
    <span style="color: #ff69b4;">sigpar</span> = DBLARR(Nparm)
    <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">i</span>=0,<span style="color: #ff69b4;">Nparm</span>-1 DO sigpar[i] = SQRT(covar[i,i])

    ;; Final <span style="color: #afd8af;">printing</span>
    <span style="color: #ff69b4;">timin</span>[x,y] = (SYSTIME(1)-t1)/60.
    IF (<span style="color: #afd8af;">quiet</span> <span style="color: #ff69b4;">LE</span> 2) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
      <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">i</span>=0,<span style="color: #ff1493;">Nparm</span>-1 DO IF (parinfo[x,y,i].mpprint EQ 1) THEN $
        PRINT, STRING(parinfo[x,y,i].parname,<span style="color: #61CE3C;">"(A20)"</span>)+<span style="color: #61CE3C;">" = "</span>, parm[i], <span style="color: #61CE3C;">" +- "</span>, $
               sigpar[i]
      PRINT, <span style="color: #61CE3C;">" - status="</span>+PRING(status1D)+<span style="color: #61CE3C;">", "</span> $
             +PRING((SYSTIME(1)-t0)/60.,F=<span style="color: #61CE3C;">"(F8.1)"</span>)+<span style="color: #61CE3C;">" minutes elapsed."</span>
    ENDIF

  ENDIF ELSE BEGIN

    ;; No <span style="color: #afd8af;">fit</span>
    <span style="color: #ff69b4;">sigpar</span> = DBLARR(Nparm)
    status = -1
    chi2 = 0.D

  ENDELSE
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf263028" class="outline-4">
<h4 id="orgf263028"><span class="section-number-4">7.5.3</span> Outputs</h4>
<div class="outline-text-4" id="text-7-5-3">
<div class="org-src-container">
<pre class="src src-idl">  ;; Final <span style="color: #afd8af;">parameters</span>
  <span style="color: #ff69b4;">errparstrOUT</span>[x,y] = PARSTRUCT(sigpar,Nbb=Nbb,Nline=Nline,Nband=Nband, $
                                NAv=NAv,Nstar=Nstar)
  parinfoOUT = parinfo
  statusOUT[x,y] = status1D
  chi2OUT[x,y] = chi21D

  ;; Save the <span style="color: #afd8af;">model</span>
  <span style="color: #ff69b4;">SPECMODEL</span>, <span style="color: #ff69b4;">wmod</span>, <span style="color: #ff69b4;">parm</span>, <span style="color: #ff69b4;">Fnu_tot1D</span>, <span style="color: #ff69b4;">FNU_BB</span>=Fnu_BB1D, <span style="color: #ff69b4;">FNU_STAR</span>=Fnu_star1D, $
             FNU_LINE=Fnu_line1D, FNU_BAND=Fnu_band1D, PABS=Pabs1D, $
             _EXTRA=extra
  IF KEYWORD_SET(modsaveIN) THEN <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #ff69b4;">Fnu_tot</span>[x,<span style="color: #afd8af;">y</span>,*] = Fnu_tot1D
    Fnu_BB[x,y,*,*] = Fnu_BB1D
    Fnu_line[x,y,*] = Fnu_line1D
    Fnu_band[x,y,*,*] = Fnu_band1D
    Fnu_star[x,y,*] = Fnu_star1D
    Pabs[x,y,*] = Pabs1D
    fitOUT = {Nw:Nwmod, w:wmod, nu:numod, Fnu_tot:REFORM(Fnu_tot), $
              Fnu_BB:Fnu_BB, Fnu_star:Fnu_star, Fnu_line:Fnu_line, $
              Fnu_band:Fnu_band, Pabs:Pabs}
  ENDIF <span style="color: #afd8af;">ELSE</span> <span style="color: #ff69b4;">fitOUT</span> = 0

  ;; Correct for <span style="color: #afd8af;">the</span> <span style="color: #ff69b4;">absorption</span> <span style="color: #4c83ff;">of</span> <span style="color: #afd8af;">the</span> lines that were fitted first
  FOR i=0,<span style="color: #ff69b4;">Nline1</span>-1 DO BEGIN
    Pabsline = Pabs1D[CLOSEST(wmod,lines[whline1[i]].wave)]
    parstrOUT[x,y].Iline[whline1[i]] /= Pabsline
    errparstrOUT[x,y].Iline[whline1[i]] /= Pabsline
  ENDFOR

  ;; Plottings
  <span style="color: #afd8af;">FOR</span> <span style="color: #ff69b4;">k</span>=(<span style="color: #afd8af;">noplot</span> <span style="color: #ff69b4;">GE</span> 1),<span style="color: #ff1493;">KEYWORD_SET</span>(filepsIN) DO <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #ff69b4;">extra</span>.noplot = 0
    IF (<span style="color: #afd8af;">k</span> <span style="color: #ff69b4;">EQ</span> 1) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">SETPLOT_PS</span>, /TeX, FILE=fileps[x,y]
      SPECMODEL, wmod, parm, Fnu_tot1D, FNU_BB=Fnu_BB1D, FNU_STAR=Fnu_star1D, $
                 FNU_LINE=Fnu_line1D, FNU_BAND=Fnu_band1D, PABS=Pabs1D, $
                 _EXTRA=extra
    IF (<span style="color: #afd8af;">k</span> <span style="color: #ff69b4;">EQ</span> 1) THEN $
      ENDPS, FILE=fileps[x,y], PDF=KEYWORD_SET(pdfIN), EPS=KEYWORD_SET(epsIN), $
             NOX=KEYWORD_SET(noX) 
  ENDFOR

<span style="color: #afd8af;">ENDIF</span>
<span style="color: #ff69b4;">ENDFOR</span>

  ;; Savings (once <span style="color: #afd8af;">every</span> <span style="color: #ff69b4;">column</span>)
  IF (KEYWORD_SET(filexdrIN)) <span style="color: #afd8af;">THEN</span> <span style="color: #afd8af;">BEGIN</span>
    <span style="color: #ff69b4;">parstr</span> = REFORM(parstrOUT)
    errparstr = REFORM(errparstrOUT)
    fit = fitOUT
    status = REFORM(statusOUT)
    chi2 = REFORM(chi2OUT)
    SAVE, <span style="color: #ff69b4;">FILE</span>=filexdrIN, <span style="color: #ff69b4;">Nx</span>, <span style="color: #ff69b4;">Ny</span>, <span style="color: #ff69b4;">Nobs</span>, <span style="color: #ff69b4;">wavobs</span>, <span style="color: #ff69b4;">nuobs</span>, <span style="color: #ff69b4;">Fnuobs</span>, <span style="color: #ff69b4;">dFnuobs</span>, $
                          weights, mask, parstr, errparstr, parinfo, $
                          status, chi2, fit, instrument, timin, cont, lines, $
                          bands, <span style="color: #afd8af;">extinct</span>
    <span style="color: #ff69b4;">PRINT</span>, <span style="color: #61CE3C;">" - File "</span>+filexdrIN+<span style="color: #61CE3C;">" has been written."</span>
  ENDIF 

ENDFOR
;; BIG <span style="color: #afd8af;">LOOP</span>

<span style="color: #ff1493;">IF</span> (<span style="color: #afd8af;">quiet</span> <span style="color: #ff69b4;">LE</span> 1) <span style="color: #afd8af;">THEN</span> <span style="color: #ff69b4;">PRINT</span>, <span style="color: #ff1493;">STRJOIN</span>(REPLICATE(<span style="color: #61CE3C;">"-"</span>,80))


END
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: HU Dangning</p>
<p class="date">Created: 2020-05-11 Mon 10:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
